[
    {
        "submission_id": "5rrasx",
        "submission_score": 224,
        "submission_title": "Official Discussion: Rings [SPOILERS]",
        "submission_text": "#Please remember this is a spoiler friendly zone. You don't have to use spoiler tags in this thread. If you haven't seen the film LEAVE NOW. If you want to see the opinions of redditors check the poll below. Also any comments that clearly show the commenter has not seen the film IT WILL BE REMOVED.\n\n---------\n\n#Poll\n\n**If you've seen the film, please rate it [at this poll](http://www.polljunkie.com/poll/qjzykp/rings-rmovies-poll).**\n\n**If you haven't seen the film but would like to see the result of the poll, [click here](http://www.polljunkie.com/poll/kppjwo/rings-rmovies-poll/view).**\n\n---------\n\n**Summary:** A young woman becomes worried about her boyfriend when he explores a dark subculture surrounding a mysterious videotape said to kill the watcher seven days after he has viewed it. She sacrifices herself to save her boyfriend and in doing so makes a horrifying discovery: there is a “movie within the movie” that no one has ever seen before... \n\n**Director:** \t\tF. Javier Gutiérrez\n\n**Writesr:** David Loucka, Jacob Aaron Estes, Akiva Goldsman\n\n**Cast:**\n\n* Matilda Lutz as Julia\n* Alex Roe as Holt\n* Johnny Galecki as Gabriel\n* Vincent D'Onofrio as Burke\n* Aimee Teegarden as Skye\n* Bonnie Morgan as Samara\n* Chuck David Willis as Blue\n* Patrick R. Walker as Jamal\n* Zach Roerig as Carter\n* Laura Wiggins as Faith\n* Lizzie Brocheré as Kelly\n* Karen Ceesay as Flight Attendant\n* Dave Blamy as First Officer\n* Michael E. Sanders as Pilot\n* Randall Taylor as Holt's Father\n* Drew Grey as Sam\n* Kayli Carter as Evelyn\n* Jill Jane Clements as Karen Styx\n* Adam Fristoe as Chris\n\n**Rotten Tomatoes:** [7%](https://www.rottentomatoes.com/m/rings_2017)\n\n**Metacritic:** [19/100](http://www.metacritic.com/movie/rings)\n\n**After Credits Scene?:** No"
    },
    [
        {
            "score": 229,
            "body": "Priest: Samara can't hurt me cuz I'm blind lol\n\nSamara: bet",
            "author": "Cheeseburguh",
            "parent_id": "t3_5rrasx",
            "time": 1486127840.0,
            "id": "dd9pgje",
            "sentiment_score": 0.44501272152788407
        },
        {
            "score": 113,
            "body": "Rotten tomatoes should make it 00% for its score cause a 0% is just a ring.",
            "author": "Nooker",
            "parent_id": "t3_5rrasx",
            "time": 1486168353.0,
            "id": "dda9tyi",
            "sentiment_score": -0.2637746577580118
        },
        {
            "score": 210,
            "body": "Literally 95% jump scares in this film. Add to the fact that the ending is in the trailer (the mirror wipe that shows she's possessed), no wonder this thing was delayed for so long; they must have known it was awful.",
            "author": "kurunner",
            "parent_id": "t3_5rrasx",
            "time": 1486121985.0,
            "id": "dd9lmvm",
            "sentiment_score": -0.585714815925358
        },
        {
            "score": 96,
            "body": "Very interesting that the studio decided that they didn't want reviews being released before the movie, or even while the movie is out.",
            "author": "IanMazgelis",
            "parent_id": "t3_5rrasx",
            "time": 1486119146.0,
            "id": "dd9jkee",
            "sentiment_score": -0.5192490569524129
        },
        {
            "score": 95,
            "body": "I wish they would've just stuck with the professor and his experiment's storyline. I was actually interested to see so many people watching the tape and what they would do to defend themselves. But then, they decide to go through with a half-assed plot that led to a shitty version of Don't Breathe. God, this movie is bad. ",
            "author": "enemyjake",
            "parent_id": "t3_5rrasx",
            "time": 1486130474.0,
            "id": "dd9qxif",
            "sentiment_score": 0.31902087971176574
        },
        {
            "score": 237,
            "body": "*The Bye Bye Man* was at least fun in its ineptitude. This movie was just plain terrible AND boring to boot.",
            "author": "Schlock_Supreme",
            "parent_id": "t3_5rrasx",
            "time": 1486118642.0,
            "id": "dd9j6qo",
            "sentiment_score": 0.7175680731414262
        },
        {
            "score": 133,
            "body": "Holy shit. I'm not really a movie critic and I have pretty low standards when it comes to movies. This was fucking terrible. Scariest part of the movie was a dog barking and an umbrella opening. Also the dialogue was horrendous, and the main actress was just plain bad. They really managed to make an all around bad movie.",
            "author": "jdog90000",
            "parent_id": "t3_5rrasx",
            "time": 1486122513.0,
            "id": "dd9m0gm",
            "sentiment_score": -0.9501059765271809
        },
        {
            "score": 70,
            "body": "Can someone who has seen it post a full spoiler plot recap?",
            "author": "bustedbeatbox",
            "parent_id": "t3_5rrasx",
            "time": 1486132318.0,
            "id": "dd9rujr",
            "sentiment_score": -0.686107557678735
        },
        {
            "score": 180,
            "body": "Lame and forgettable.\n\nI can make you jump if I hide around a corner. It doesn't take talent. Horror should be about the transformative power of fear through cinema. I personally like my horror to take me to the edge whereby I come dangerously close to not liking the film.\n\nMartyrs and The Witch being great examples. Genuinely unsettling and unnerving. This is just trash.",
            "author": "OceanCyclone",
            "parent_id": "t3_5rrasx",
            "time": 1486119349.0,
            "id": "dd9jprx",
            "sentiment_score": 0.374979685958448
        },
        {
            "score": 42,
            "body": "This has nothing to do with this awful movie, but when I watched the first one, I was like 10 and dial up Internet was still around. Anyway, I watched the first one for the first time on dvd and turned on the internet so nobody could call me. I thought I was so smart for doing that. I was a stupid kid. ",
            "author": "santablazer",
            "parent_id": "t3_5rrasx",
            "time": 1486179542.0,
            "id": "ddajxj9",
            "sentiment_score": -0.18249288270930908
        },
        {
            "score": 42,
            "body": "  I felt during the second half of the movie the main girl just had a habit of saying what was happening. \"This is the church from the video\", \"Those are the birds from the video\", and \"That woman is the woman from the video\". It just really start aggravating me the entire last half.",
            "author": "Pyrocube98",
            "parent_id": "t3_5rrasx",
            "time": 1486187226.0,
            "id": "ddaqol1",
            "sentiment_score": -0.5906374464406741
        },
        {
            "score": 81,
            "body": "Monster Trucks, xXx 3, Resident Evil, The Bye Bye Man and now this. I truly hate myself for having paid actual money to watch these films. ",
            "author": "MandalorianLord",
            "parent_id": "t3_5rrasx",
            "time": 1486164652.0,
            "id": "dda6new",
            "sentiment_score": -0.40019106290528783
        },
        {
            "score": 64,
            "body": "I don't care for watching the movie, somebody spoil it for me in PM or comment, so I can somehow convince my girlfriend not to watch this. ",
            "author": "Correa24",
            "parent_id": "t3_5rrasx",
            "time": 1486121881.0,
            "id": "dd9lk5w",
            "sentiment_score": -0.8430407952812407
        },
        {
            "score": 50,
            "body": "Critics: The horror genre is dying\n\nMe: No it's not! There are-\n\nRings: yes it is\n\nMe: No, but-\n\nRings: yes it is\n\nHonestly, where to even begin. This is fucking terrible. The cold open is kind of fun in an incredibly stupid way, but everything else is just not very good. It hints at doing something interesting early on with a weird ass Ring Club where everyone's watched the tape and it looks like one of those mission control rooms in spy movies and there are clocks on the wall counting down everyone's time until they die...but then immediately drops it and opts instead to copy and paste every major horror movie that's come out in the last few years.\n\nOuija, Don't Breathe, Final Destination, Insidious...they're all in this movie. Which wouldn't be too bad if the movie was scary or well-written or something. Hell, I'd even settle for actors who aren't terrible. Nope.",
            "author": "mouse_cunt",
            "parent_id": "t3_5rrasx",
            "time": 1486121711.0,
            "id": "dd9lfuh",
            "sentiment_score": -0.8549585253695648
        },
        {
            "score": 53,
            "body": "Worst film of the year and it's only February.",
            "author": "lqtely",
            "parent_id": "t3_5rrasx",
            "time": 1486130860.0,
            "id": "dd9r4or",
            "sentiment_score": 0.8296524873446243
        },
        {
            "score": 28,
            "body": "Pretty mediocre movie. There isn't much to say about it other than it's fairly typical in my opinion, there were a couple of decent jump scares but nothing too crazy. I forgot I was watching *Rings* and thought that I might have been watching *Don't Breathe* again when Julia was in the blind guy's house. :P\n\nI'd pass on this one if you're looking for a good scare.",
            "author": "nitrouspillow",
            "parent_id": "t3_5rrasx",
            "time": 1486119052.0,
            "id": "dd9jht5",
            "sentiment_score": -0.21505823412294878
        },
        {
            "score": 27,
            "body": "\"Well what is it... Chicken... or Steak?\"\n\"Ha... you're funny.\"\nI laughed REALLY hard at that cheesy line.",
            "author": "topherthepest",
            "parent_id": "t3_5rrasx",
            "time": 1486126198.0,
            "id": "dd9oggm",
            "sentiment_score": 0.19423135864882557
        },
        {
            "score": 28,
            "body": "Rings makes Ring 2 look like The Ring.",
            "author": "rdz1986",
            "parent_id": "t3_5rrasx",
            "time": 1486272847.0,
            "id": "ddc2tlv",
            "sentiment_score": 0.28776929140765994
        },
        {
            "score": 25,
            "body": "I can't believe this movie got made. I love the first one and feel like it's the *only* decent J-Horror remake. But it a came out so long ago. Is there really anyone who wants to see another Ring film after all the shitty sequels?\n\nJust give me: Sadako vs. Kayako (which I'm sure sucks too, but come on!)",
            "author": "JacobCrim88",
            "parent_id": "t3_5rrasx",
            "time": 1486159383.0,
            "id": "dda2rk8",
            "sentiment_score": -0.17688725860308918
        },
        {
            "score": 22,
            "body": "a 0% DAMN",
            "author": "Penisgang",
            "parent_id": "t3_5rrasx",
            "time": 1486180172.0,
            "id": "ddakify",
            "sentiment_score": -0.21273005850524251
        },
        {
            "score": 19,
            "body": "Not being screened for critics so they can capitalize on the success of the first one before people find out they wasted their money? Lol",
            "author": "None",
            "parent_id": "t3_5rrasx",
            "time": 1486130728.0,
            "id": "dd9r2a8",
            "sentiment_score": -0.39479011365932326
        },
        {
            "score": 21,
            "body": "The scariest part of this film was when someone opened their umbrella quickly in the direction of the camera.",
            "author": "Only_a_dog",
            "parent_id": "t3_5rrasx",
            "time": 1486188114.0,
            "id": "ddarf7k",
            "sentiment_score": 0.04356253492755191
        },
        {
            "score": 20,
            "body": "I'm late on this post, but I would love to commiserate with my friends here at /r/movies about all the TERRIBLE that was in this movie:\n\n* The cold open was the airplane scene. The dude was a TRUE DICK for getting on that plane knowing he was going to die. The fact that it led to Big Bang boy finding a VCR at a swap meet was straight up crazy town. \n\n* These people are supposed to be 18 in this... \n\n* For real, who thought that the dialogue in the bedroom scene between the 'couple' was a good idea? Followed shortly by the \"I'll miss your smell\" and having the dude take his shirt off??? WTF?\n\n* Could this be the craziest/stupidest person ever in a horror movie? (the girlfriend) She texts/calls and gets no response, okay makes sense to worry. She gets a Skype from a girl IN HIS BEDROOM, so she drives up to try and stalk him and then DIGS THROUGH HIS PERSONAL PROPERTY. \n\n* The previous part also contains maybe the worst dialogue delivery since \"The Room\", along the lines of 'I just had the weirdest conversation of my life with a girl that called me' something like that, so bad.\n\n* Ok, I've stalked him to find out something isn't right. I've discovered that he is part of some strange killer VHS tape plot. WHAT DO I DO??? I watch the video tape and will sacrifice myself because I'm 18 and am in love with this cringe machine. \n\n* Umbrella opening jump scare\n\n* Fast forward to Vincent D'onofrio chewing scenery, while explaining 100% of the stuff you don't get because of bad movie making (Oh, he's blind? Oh, I totally wonder where they are taking THAT piece of business.)\n\n* Track back/maybe forward who knows. Cops dicking around with an empty car instead of HELPING A MAN UPSIDE DOWN IN A CAR DIRECTLY IN FRONT OF THEM. The movie then turns to Final Destination for a second with some power poles.\n\n* Fast forward to \"Don't Breathe\" lite for about 10 minutes and SAMARA IS FREED SO YOU CAN BE FRIENDS NOW HOORAY! \n\n* Oh wait, your possessed now and they showed it all in the trailers and now Samara can magically imbue your Mac with RAM to be able to process thousands of simultaneous emails/uploads. Also those SICK instant email responses, cuz millennials get on those email chains quick right?\n\nI've seen every major horror release of the past 5 years, and in my opinion this was the worst one. Bye Bye Man was a close 2nd. ",
            "author": "ivtecdoyou",
            "parent_id": "t3_5rrasx",
            "time": 1486418777.0,
            "id": "ddednit",
            "sentiment_score": -0.9319598876291628
        },
        {
            "score": 16,
            "body": "I just got out of the showing at the Atlanta Regal.\n\nI had no idea what to expect since I got the tickets for free from a co-worker so I was able to go in with no expectations.\n\nWow this movie was bad. I have to say it was probably in the bottom 25% of movies I've seen.\n\nFirstly the dialogue was like listening to a bad audio dub of a Japanese RPG. I was outright laughing at multiple points and so were other people. People would randomly come up to the main characters and introduce themselves while characters are doing illegal things with zero explanation.\n\nThe acting was terrible. Budget Zac Effron and Kristen Stewart were bad, and the fact that these obviously mid/upper 20's people were supposed to be college freshmen brought me out of the movie completely.\n\nThe writing in general was bad. *Spoilers*\n\nWhy did the people in the study not just send the video to their friends like at the end? How did 12 people get chosen enough to find the priest but somehow people havent started to put two and two together? How did missing sex dungeon not not draw any interest from police? How has no one heard about this professors sketchy ass research lab? When I did a psych study for the university there was so much oversight it boggles my mind no one thinks twice.\n\nReally the only redeeming quality was that I recognized locations on my college campus a ton. Probably a 3.5/10 from me, would not recommend unless you're a big series fan or your ticket is free. ",
            "author": "TehAlpacalypse",
            "parent_id": "t3_5rrasx",
            "time": 1486119190.0,
            "id": "dd9jlii",
            "sentiment_score": -0.1580769043038266
        },
        {
            "score": 17,
            "body": "Wasn't there a completely different backstory for Samara's mother in The Ring Two?",
            "author": "JakkuScavenger",
            "parent_id": "t3_5rrasx",
            "time": 1486171702.0,
            "id": "ddactwv",
            "sentiment_score": 0.25022153498035626
        },
        {
            "score": 18,
            "body": "The very first scene of the movie is shockingly and hilariously bad. When he starts talking abou the tape out of nowhere people in my theater just burst out laughing. What a terrible movie",
            "author": "NotTheBees_ARGH",
            "parent_id": "t3_5rrasx",
            "time": 1486250532.0,
            "id": "ddbmw0d",
            "sentiment_score": -0.01975920609245807
        },
        {
            "score": 46,
            "body": "A true masterpiece, I'M FUCKING KIDDING.\n\n\nI AM FUCKING FURIOUS I ACTUALLY MOVED MY PHYSICAL BODY INTO MY CAR, DROVE TO THE THEATER AND SAT DOWN FOR TWO FUCKING HOURS AND SAW THIS MOVIE. \n\nThis movie was STRAIGHT GARBAGE. DO NOT SEE THIS MOVIE WHATEVER YOU DO. \n\nTHERE IS A FUCKING JUMPSCARE, I KID YOU NOT, OF AN UM-FUCKING-BRELLA OPENING. I AM NOT KIDDING. I REPEAT, I AM NOT KIDDING. \n\nTHE SCARIEST FUCKING THING ABOUT THIS MOVIE, IS KNOWING THAT 33 MILLION DOLLARS WAS SPENT TO MAKE THIS FUCKING GARBAGE. WHERE DID THE FUCKING MONEY GO? SERIOUSLY, IT'S FUCKING DISTURBING. WHERE DID IT GO? WHERE DID IT GO?\n\nHoly mother fucker, this might be in top 5 worst movies I've EVER SEEN. HOLY SHIT.",
            "author": "blankvisual",
            "parent_id": "t3_5rrasx",
            "time": 1486402762.0,
            "id": "dde7k55",
            "sentiment_score": -0.05071233156739696
        },
        {
            "score": 16,
            "body": "I don't know why, but I just burst out laughing at the moment when [Samara attacks the airplane. I'm open to new interpretations and whatnot, but when and how could she have possibly gained the power to hijack all those monitors? In fact, what's the point of copying the video and passing that around if she can just show said video to anyone within the vicinity of a cursed person? Why even kill all those people on the plane if she was only after that one passenger?](#spoiler)\n\nDid anyone else find the scene to be funny?",
            "author": "deh_tommy",
            "parent_id": "t3_5rrasx",
            "time": 1486246255.0,
            "id": "ddbkhja",
            "sentiment_score": 0.28251123227319397
        },
        {
            "score": 14,
            "body": "Okay so saw an Advance Screening yesterday so i'm glad I didn't spend any money on this trash. Such a disappointment from the classic original Ring. Horrible slow paced, laughable acting, nothing but cheap jump scares, no tension or creepiness, the plot twist was okay but not worth the stupid character decisions, cringeworthy dialogue/characters, and plot holes. The CGI was godawful and the whole concept of the movie was goddamn stupid: \"There's a movie....INSIDE THE MOVIE??!!!??\"",
            "author": "mrmcspicy",
            "parent_id": "t3_5rrasx",
            "time": 1486183135.0,
            "id": "ddan6jj",
            "sentiment_score": -0.10243873291458261
        },
        {
            "score": 13,
            "body": "So this is basically Don't Breathe 2:  Elect-ring Boogaloo.",
            "author": "Verreaux",
            "parent_id": "t3_5rrasx",
            "time": 1486229955.0,
            "id": "ddbf1z3",
            "sentiment_score": -0.15022920645032634
        },
        {
            "score": 14,
            "body": "As someone who has been patiently awaiting the return of Samara this is very upsetting. The original pitches and rumors for the sequel sounded infinitely better than what we were served. Once I saw the two month delay I new bad times were ahead.  Samara deserves better #imwithher. ",
            "author": "Jaredocobo",
            "parent_id": "t3_5rrasx",
            "time": 1486252599.0,
            "id": "ddbo7ff",
            "sentiment_score": -0.6202840114056771
        },
        {
            "score": 12,
            "body": "Is it at least funny-bad?",
            "author": "winterd",
            "parent_id": "t3_5rrasx",
            "time": 1486166292.0,
            "id": "dda80y2",
            "sentiment_score": -0.2103528493670821
        },
        {
            "score": 13,
            "body": "How the hell do they keep fucking this up? Making a good sequel to the Ring shouldn't be difficult. ",
            "author": "ev6464",
            "parent_id": "t3_5rrasx",
            "time": 1486185156.0,
            "id": "ddaoxq4",
            "sentiment_score": 0.34466728710022165
        },
        {
            "score": 12,
            "body": "Typing this on my phone, while still in the theater building, just finished the film, so here are my immediate thoughts. \n\n\nThe casting was terrible. While the boyfriend didn't distract me very much, neither did Gabriel, the Priest and Julia were horrid. The actress playing Julia suffered from the bad actress sy drone of feeling stoff, unable to express emotions other than a blank face, and (as used by another member here) felt like she was reading from queue cards. \n\nI did like that they reused some of the original score, however, it didn't properly blend into the new one, which wasn't that great. I wished they would have also kept more of the blue filter as used in the original instead of the grimey green for this one. \n\nThe 7 Club was a much better plot point for a sequel than the direction this one ultimately took. They introduced this whole idea of Samaras father, which ultimately falls apart during the third act by numerous plot holes. \n\nI actually found the tape within a tape thing interesting, and it was well executed. However, the idea that Samara was simply trying to be reborn into this world through someone's body is a little ambiguous (and was already done in Part 2). The Priest states that 11 other people got close to finding her body, but this begs the question as to why Julia was chosen versus anyone else watching the tape. \n\nAlso, am I suppose to infer that Samaras bones being cremated was suppose to allow her to actively possess someone? She was pretty damn close to getting Aiden (I mean, she basically did). And before anyone says this disregards 2, it doesn't. Not only did they use the same name for the mother, they also showed the same photographs that Evelyn had stored in the suitcase in Part 2. It's clearly part of the time line. \n\nHowever, the timeline is still all *beep* up. They never explain what happened to Evelyn, although the idea that she wanted to kill Samara remained, as in 2. \n\nThe opening was far too rushed and not at all suspenseful. The original was great because it focuses more on suspense and the discovery aspect than it does jump scares. And while sure, Rachel had the nightmare, and the vision in the well towards the end, she was not plagued by cheap visions to help advance the plot. Literally, that was the entire decide used to advance the story. Instead of them really digging to find stuff, they would go \"Let's go to this town, where I will have a random vision while I'm awake so that I can tell the audience what happened back in the day, instead of using a well driven story and clues as in the original.\" \n\nSkye (don't even get me started on her, I still don't understand why anyone casts her after Scream 4), states that things are getting worse, the visions more intense, and that Samara is getting pissed about the 7 club. Nice way to introduce something into the plot that never gets explored. \n\nAlso slightly confused by the climax. Julia and the tape time frame becomes meaningless. Also, if Samara had the power to restore eyesight, then what was the purpose of having him be blind in the first place? \n\nIt was established she can only kill you after 7 days once you watch the tape. Now she can appear whenever to kill you? \n\n\n\n\nOverall, the film is watchable. While I don't hate 2 like everyone else (it is still no where near on par with the first), I would would say this falls slightly beneath that. This film could have excelled it they focused on the more interesting story of the Seven Club, and properly structured the father storyline without leaving gaping plot holes. Not to mention better tension, less cheap jump scares, and a cast who can act. \n\n\n\nSay what you want about The Ring Two, but at least they casted solid actors.",
            "author": "ndrw17",
            "parent_id": "t3_5rrasx",
            "time": 1486208549.0,
            "id": "ddb5v3r",
            "sentiment_score": 0.21232363836171086
        },
        {
            "score": 11,
            "body": "For those who have seen it -- is there a trailer to *IT* attached?",
            "author": "Czechmix",
            "parent_id": "t3_5rrasx",
            "time": 1486121044.0,
            "id": "dd9ky74",
            "sentiment_score": 0.2185148020769041
        },
        {
            "score": 10,
            "body": "Akiva Goldsman<shudder>",
            "author": "spacednlost",
            "parent_id": "t3_5rrasx",
            "time": 1486156216.0,
            "id": "dda0wm0",
            "sentiment_score": -0.9513400365663249
        },
        {
            "score": 12,
            "body": "Can someone explain to me how can Johnny Galecki, a guy earning 1 million per BBT episode, get involve in such a movie ? I mean, is that contractual ? I find it really intriguing. \n\n",
            "author": "PeterLeroy",
            "parent_id": "t3_5rrasx",
            "time": 1486236690.0,
            "id": "ddbgx0x",
            "sentiment_score": 0.9800725460884556
        },
        {
            "score": 20,
            "body": "This one was awful. They just took the most recognizable imagery from the first Ring movie and tried to make a sequel with no consideration for what actually made the first one great. The atmosphere and tone felt completely off. There was 0 real tension or mystery. The plot was dumb, the lead actress was horrible, and it just felt like a giant insult to the original film.",
            "author": "thefairlygoodgatsby",
            "parent_id": "t3_5rrasx",
            "time": 1486259742.0,
            "id": "ddbtc8l",
            "sentiment_score": -0.17429520713115143
        },
        {
            "score": 11,
            "body": "Are the faces of the victims at least creepy? That's was one of the best parts of the first Ring. Really left an image in your head.",
            "author": "Krettlecorn13",
            "parent_id": "t3_5rrasx",
            "time": 1486193648.0,
            "id": "ddavq3g",
            "sentiment_score": -0.4671030983918285
        },
        {
            "score": 10,
            "body": "This is what bugs me about Hollywood.  The Ring worked because it had an adult woman, that was an investigative journalist trying to unravel Samara's video.  In Rings we get two 18 year old morons that flit from plot point to plot point based mostly on lucky guesses a book with all the answers they were literally handed.  And this is fine if you are trying to start a new franchise but all of the people that watched and liked The Ring are in their 30's and 40's now, we are the ones excited to see a continuation of the mythos. Rings could have been a great movie if they had focused on the Professor and made it a story about him using science to test Samara and her boundaries instead of 2 empty-headed jerkbait kids.  ",
            "author": "Ouxington",
            "parent_id": "t3_5rrasx",
            "time": 1486698642.0,
            "id": "ddjkuob",
            "sentiment_score": -0.0655230102396751
        },
        {
            "score": 25,
            "body": "I saw this movie for free and I still demand a refund. I will never get those 1.5 hours of my life back.\n\nThe writing was awful. I'm not sure why the scene on the airplane was included. I didn't give a damn about Julia or Mr. Cardboard cutout. Some of the special effects were straight out of baby's first 3d modeling class. Let's not even mention the ending. Just all around awful.",
            "author": "ILikeBigButtss",
            "parent_id": "t3_5rrasx",
            "time": 1486128242.0,
            "id": "dd9poze",
            "sentiment_score": -0.4436909071877988
        },
        {
            "score": 9,
            "body": "I would give it a 5/10 I was never bored and was interested to see where it goes, but I never had a moment where I was scared or really on edge.  I also did not like the last scene.  Dont hate myself for watching it but have no need to see it again.  ",
            "author": "haunthorror",
            "parent_id": "t3_5rrasx",
            "time": 1486141520.0,
            "id": "dd9vhem",
            "sentiment_score": 0.6202044922179084
        },
        {
            "score": 8,
            "body": "I highly recommend reading the books. This movie takes the mutation idea from the books and does nothing with it; the 2nd book in the series just goes full bore into that concept.",
            "author": "fantasyfeasts",
            "parent_id": "t3_5rrasx",
            "time": 1486196200.0,
            "id": "ddaxkbn",
            "sentiment_score": -0.608720525703764
        },
        {
            "score": 10,
            "body": "The main girl's acting was distractingly bad. ",
            "author": "fuckthemodlice",
            "parent_id": "t3_5rrasx",
            "time": 1486558079.0,
            "id": "ddh4mqn",
            "sentiment_score": -0.8442674784756201
        },
        {
            "score": 9,
            "body": "7% on RT? What happened? I had no intention of seeing the movie before but if someone can tell me in great spoilerific detail why its terrible, that would be nice!",
            "author": "Doro1234",
            "parent_id": "t3_5rrasx",
            "time": 1486195438.0,
            "id": "ddax17b",
            "sentiment_score": -0.8640217862870083
        },
        {
            "score": 7,
            "body": "What was the point of Samara sending everyone the video tape online now that she was already in a host body on Earth and could wreak havoc that way?",
            "author": "vvsj",
            "parent_id": "t3_5rrasx",
            "time": 1486227827.0,
            "id": "ddbefob",
            "sentiment_score": -0.5519095549092217
        },
        {
            "score": 7,
            "body": "Just came home after watching it. As a horror movie lover i'm not really impressed. Here is my spoiler free opinion.\n\nThe movie has too many \"filler\" scenes trying to explain the story which is not even that hard to figure out at the first sentence they say. The atmosphere isnt dark and scary its just walking from one scene to another with the ocassional jump scare which i hate. If a horror movie has to have jump scares to scare you its a bad written movie. Movies like conjuring kept me on my toes for 2 hours. \n\nIts an ok movie. They tried to polish up the see tape die story a bit which actually had some potential but was not very well written. A solid 5/10.\n\n",
            "author": "Rudarnik",
            "parent_id": "t3_5rrasx",
            "time": 1486275018.0,
            "id": "ddc4ct7",
            "sentiment_score": -0.2893586824610974
        },
        {
            "score": 7,
            "body": "So how does Leonard get killed then?",
            "author": "JJCXV",
            "parent_id": "t3_5rrasx",
            "time": 1486151580.0,
            "id": "dd9yufl",
            "sentiment_score": -0.31008976562009005
        },
        {
            "score": 7,
            "body": "Watched Rings last night. It wasn't as bad as people say it is, it was pretty darn average. \n\nIt felt like the film was rushed with too many plot holes. \n\nBefore the film, i knew it wouldn't live up to the hype. Difference between The Ring films and Rings was there wasn't much plot holes in the original films - and that's good. \n\nOriginal films had the chance to develop their character, develop the story-line (not in a rushed way). Yes i know it was the first film of Rings, but they could have left some plot holes for the second film. \n\n5/10. ",
            "author": "mathpipebomb",
            "parent_id": "t3_5rrasx",
            "time": 1486512128.0,
            "id": "ddg2ext",
            "sentiment_score": -0.6540311642623329
        },
        {
            "score": 18,
            "body": "Yay!!! This looks like a fun soft reboot!!!\n\n>Rotten Tomatoes: 7%\n\nThat's not good.\n\n>Metacritic: 19/100\n\nThat's not good either.\n\n>After Credits Scene?: No\n\nHey, that's neutral!\n\n>Typing this on my phone, while still in the theater\n\nTHAT'S NOT GOOD AT ALL! CAN'T EVEN WAIT FOR THE MOVIE TO END TO TRASH IT CUZ IT'S *JUST THAT BAD*?!? YIIIIKES!!!",
            "author": "deepintheupsidedown",
            "parent_id": "t3_5rrasx",
            "time": 1486227048.0,
            "id": "ddbe78r",
            "sentiment_score": -0.3536983886365894
        },
        {
            "score": 14,
            "body": "I actually really enjoyed this movie. I'm a huge fan of the Ring and Ringu films so I guess I'm pretty biased, I went to see a Ring movie and that's basically what I got. I enjoy that it went a more unique route than the previous 2 American films went and I even enjoyed the end of it even if it has been done before. \n\nIn comparison to normal movies yeah its bad, but I enjoy these movies so I was happy. \n\n[The area under the church for some reason creeped the hell out of me, I really would hate to be there at all, let alone in the middle of the night.](#spoiler)\n",
            "author": "zrox456",
            "parent_id": "t3_5rrasx",
            "time": 1486132141.0,
            "id": "dd9rri8",
            "sentiment_score": 0.7443173965133163
        },
        {
            "score": 12,
            "body": "For those who have seen it, there's a shot in the trailer that suggests the movie leaks onto the Internet. Does this actually happen?",
            "author": "bluscoutnoob",
            "parent_id": "t3_5rrasx",
            "time": 1486176473.0,
            "id": "ddah5hm",
            "sentiment_score": 0.7258788007477279
        },
        {
            "score": 12,
            "body": "I had a special history with the Rings franchise because I remember The Ring being the first horror movie I ever watched as a kid that really scared me.\n\nJohnny Galecki and Vincent D'Onofrio I thought did an excellent job in their roles. Unfortunately the main couple that were clearly late 20-somethings cast at college freshmen weren't quite as inspiring. \n\nI thought the movie felt more like a psychological mystery with a darker twist than an actual horror film. Meaning I was never really scared while watching the film, for a part of the movie even Samara could be considered on the good team which makes it hard to be scared in that scenario. The film felt more like a reboot than a sequel as well. There were a few plot points I found intriguing, mostly I liked the ending, some might call it cliche but I didn't see it coming and it had the right feeling of how a horror movie should end imo.\n\nOverall I would say the movie was decent. I don't think it lived up to the reputation the first movie has and by no means am I saying everyone should go out and see it but I certainly don't think it deserves the 1/10 and 2/10 reviews it seems to be getting. It was a serviceable film and wasn't any worse than most of the horror movies that have came out recently. I think a 6/10 or 7/10 is a fair score.\n\n",
            "author": "sevenw1nters",
            "parent_id": "t3_5rrasx",
            "time": 1486190697.0,
            "id": "ddati2f",
            "sentiment_score": -0.16293061313972568
        },
        {
            "score": 6,
            "body": "What is the ending? I keep hearing people talk about how terrible it is. ",
            "author": "mardfet",
            "parent_id": "t3_5rrasx",
            "time": 1486119209.0,
            "id": "dd9jm0r",
            "sentiment_score": -0.2859516195747571
        },
        {
            "score": 7,
            "body": "Jessica Ablish was monotone for EVERY one of her lines. I rolled my eyes every time she spoke. I will say the movie has a slightly creative way of being unique, and for a lot of it, I did feel callbacks to the first movie... but the bad acting and the fact that the final scene was in the trailer... I say pretty forgettable movie.",
            "author": "topherthepest",
            "parent_id": "t3_5rrasx",
            "time": 1486125338.0,
            "id": "dd9nwr8",
            "sentiment_score": -0.8907304748077662
        },
        {
            "score": 7,
            "body": "Can someone put the airplane scene into context? I feel like that would have to be  the last scene of the movie and if its not, how does it fit into the rest of it?",
            "author": "BansheeJam",
            "parent_id": "t3_5rrasx",
            "time": 1486170570.0,
            "id": "ddabt9u",
            "sentiment_score": -0.07723101159035828
        },
        {
            "score": 7,
            "body": "7% on Rotten Tomatoes? Ouch.",
            "author": "Rosebunse",
            "parent_id": "t3_5rrasx",
            "time": 1486201186.0,
            "id": "ddb11oa",
            "sentiment_score": -0.24966057167419264
        },
        {
            "score": 6,
            "body": "This movie was somehow worse than I was expecting and I wasn't expecting much. Bad Story, bad acting, nothing scary, bunch of filler, not worth watching imo",
            "author": "austine567",
            "parent_id": "t3_5rrasx",
            "time": 1486297235.0,
            "id": "ddcjh5z",
            "sentiment_score": -0.678185104180169
        },
        {
            "score": 5,
            "body": "I honestly liked the premise of a university professor doing research in the video on test subjects. But the movie went downhill after the lead actress decides to investigate.  What a snoozefest.  ",
            "author": "SargeantM",
            "parent_id": "t3_5rrasx",
            "time": 1486310122.0,
            "id": "ddcpyvn",
            "sentiment_score": 0.49649341743060216
        },
        {
            "score": 6,
            "body": "This movie pulled a suicide squad. Half the cool scenes in the trailer aren't even in the movie lmao this is trash ",
            "author": "GotNoChill",
            "parent_id": "t3_5rrasx",
            "time": 1486355633.0,
            "id": "dddcxfd",
            "sentiment_score": 0.8874295046674148
        },
        {
            "score": 15,
            "body": "This is an unrepentant pile of shit. The acting in this movie was the scariest part.",
            "author": "Vunks",
            "parent_id": "t3_5rrasx",
            "time": 1486119643.0,
            "id": "dd9jxgv",
            "sentiment_score": 0.15921576268637128
        },
        {
            "score": 10,
            "body": "Very predictable and boring\n\n\nEveryone laughed when the 7th floor secret \"lounge\" was shown. That seemed interesting at first as a different take on the story, then it went off to reboot the first movie.",
            "author": "discoparty",
            "parent_id": "t3_5rrasx",
            "time": 1486127755.0,
            "id": "dd9peob",
            "sentiment_score": -0.5272698372232087
        },
        {
            "score": 23,
            "body": "I know this wasn't a great movie, but I have a fantastic idea for a sequel. It would be called Rings: The Samara Cycle. \n\nThe film takes place ten years after the events of Rings. In the space of time between the two films, a lot has happened to reshape the world. The video went viral, causing thousands of people to perish. But on the plus side, humanity has figured out the mystery of the video and thus found a way to beat it. Building off of Professor Burke's \"tail\" experiment, we have figured out a way to perpetually exploit this system, creating a continuous loop of tails, or a cycle as it is called. To put it simply, Person A copies the file and shows Person B who copies the file and shows Person C who copies it and shows Person A. Thus creating a circle... a ring. \n\nIn this world, everyone knows about the tape mythos but it's a very taboo topic. It's gained a disturbing underground cult following. Weirdos will go to clubs (just like Club 7 in the Rings film) just to watch the tape and see how close they can get to the deadline without dying. Some people get off on it, like a fetish. Other people do it for the rush, like dumbass college kids. There are also people called Cyclers, who make it their job to find tails for a price. They work under the table and are hard to track down. \n\nThe conflict of the film arises when the whole world loses Internet and becomes crippled. Don't ask how. Just picture one giant server out in rural Idaho that has all the Internet on a big cloud, and it shuts down. The point is, the world no longer has Internet. Maybe it was a virus that Samara made. I'm going for a post-apocalyptic vibe. So now the world is in a state of panic. If you watched the tape and didn't pass it off, you're screwed. So the whole world is scrambling to find the long lost hard copies, which are incredibly valuable and circling around the black market. \n\nThe film follows a hacker named Grady (codename: Demagogue), who is trying to track down a hard copy, not for altruistic purposes, but simply to make a shameless profit. Somewhere along the way, he teams up with a 10-year-old girl named Beth, who is a jaded spunky orphan who reminds Grady a lot of himself. They go searching for this tape around the area where the servers crashed in Idaho. \n\nLong story short, it turns out that Beth is Julia and Holt's daughter from after the events of Rings took place. She is the new Samara (the \"rebirth\"). Julia and Holt died after giving birth to her (because she's evil) so Beth grows up as an orphan. \n\nI realize there's some plot holes I need to fill in, but you get basic idea. Oh, and also, it's very important that the film doesn't take itself too seriously. The tone should be similar to Hackers or some other shlocky sci-fi movie from the 1990s. Feel free to help me continue writing this masterpiece. We can start a Google Doc. ",
            "author": "CaptainWalton",
            "parent_id": "t3_5rrasx",
            "time": 1486475920.0,
            "id": "ddflkee",
            "sentiment_score": -0.17035004100868822
        },
        {
            "score": 10,
            "body": "Haven't seen the movie yet, probably going to just cause i hate my eyeballs.\n\nThis movie sounds like the IP ownership was about to expire so the owners are just making one more cash grab. Kinda like how FOX keeps putting out brain-meltingly bad Fantastic 4 movies just to keep the rights to it. Does anyone know if that's the case for this?",
            "author": "StasisNation",
            "parent_id": "t3_5rrasx",
            "time": 1486187824.0,
            "id": "ddar6m6",
            "sentiment_score": 0.19811083197403967
        },
        {
            "score": 5,
            "body": "I laughed out loud at work when I read the plot synopsis, that: \"there is a “movie within the movie”\". \nThen everyone looked at me weird, I haven't read anything so ridiculous and destined for terrible. ",
            "author": "llames",
            "parent_id": "t3_5rrasx",
            "time": 1486131195.0,
            "id": "dd9ras1",
            "sentiment_score": 0.2189719349418877
        },
        {
            "score": 5,
            "body": "It was too bland, too cookie cutter.\n\nThere was only one scene with a feeling of sustained dread or tension (when she's in the priests house at the end). The rest is just jump scares after jump scare in between scenes of boring plot development.\n\nI expected nothing and I'm still let down. ",
            "author": "bigpig1054",
            "parent_id": "t3_5rrasx",
            "time": 1486131929.0,
            "id": "dd9rnqy",
            "sentiment_score": -0.11132142625585151
        },
        {
            "score": 5,
            "body": "I remember Ring",
            "author": "NotTheBees_ARGH",
            "parent_id": "t3_5rrasx",
            "time": 1486166398.0,
            "id": "dda849a",
            "sentiment_score": 0.04946659097598416
        },
        {
            "score": 5,
            "body": "The lead actress sucked, she sounded like she was having an orgasm through the entire movie.",
            "author": "GlamourTits",
            "parent_id": "t3_5rrasx",
            "time": 1486304305.0,
            "id": "ddcniex",
            "sentiment_score": 0.7684571348076488
        },
        {
            "score": 6,
            "body": "did anyone else catch perhaps a subtle in-joke or found it coincidental that gabriel used the elevator and julia's seemed to be out of service (before the key) - bbt reference?  i was waiting for someone to *knock knock knock, gabriel?  knock knock knock, gabriel?...*\n\nalso, i know it ruins the canon/whole point of story, but since it's near garbage anyway, why doesn't anyone who needs a tail visit terminally ill patients, \"vegetables\" as well?  some of those people would be glad to end their suffering earlier.  well, besides the final seven days of...",
            "author": "remora2626",
            "parent_id": "t3_5rrasx",
            "time": 1486450545.0,
            "id": "ddf3jfo",
            "sentiment_score": -0.4081574746299337
        },
        {
            "score": 5,
            "body": "The film felt rushed, there was really no good character setup, development or backgrounds. There were lots of plot holes and questions I had one of them: How was Samara's body/skeleton in the closet if Rachel finds her body in the well at the end of the first movie? And the scares weren't even scary the hair pull out of throat was done before and all the jump scares were so cheap I barely jumped, also the main leads acting is so horrible, especially when she's solving parts of the puzzle \"you were pregnant\" \"your samaras mother\" \"you were kept down here\" \"that bird, it was the bird from the video\" thanks for telling us we couldn't figure that out on our own.",
            "author": "dipperdipperpines19",
            "parent_id": "t3_5rrasx",
            "time": 1486589666.0,
            "id": "ddhhd58",
            "sentiment_score": 0.8888554494165306
        },
        {
            "score": 10,
            "body": "I've seen shitty horror movies on Netflix that were better than this movie. ",
            "author": "SACKO_",
            "parent_id": "t3_5rrasx",
            "time": 1486129601.0,
            "id": "dd9qgsc",
            "sentiment_score": -0.421243959531161
        },
        {
            "score": 8,
            "body": "ENDLESS TRASH!!!!",
            "author": "NiceRepostBROoO",
            "parent_id": "t3_5rrasx",
            "time": 1486353990.0,
            "id": "dddbpf6",
            "sentiment_score": 0.4926244229977641
        },
        {
            "score": 9,
            "body": "Worst acting I've seen in a movie that actually made it to theaters.  And what was the purpose of the cold open?  It had nothing to do with the rest of the movie.",
            "author": "jiodjflak",
            "parent_id": "t3_5rrasx",
            "time": 1486429095.0,
            "id": "ddel86c",
            "sentiment_score": 0.9751394265794027
        },
        {
            "score": 3,
            "body": "So it's... Infinite Jest? ",
            "author": "makeshiftpatriot",
            "parent_id": "t3_5rrasx",
            "time": 1486119022.0,
            "id": "dd9jgzm",
            "sentiment_score": -0.27638157496017524
        },
        {
            "score": 5,
            "body": "(Slightly attractive ) Bella and Edward try to solve the ring case",
            "author": "The_Frisky_Firefly",
            "parent_id": "t3_5rrasx",
            "time": 1486126607.0,
            "id": "dd9opp7",
            "sentiment_score": -0.06863704617829414
        },
        {
            "score": 5,
            "body": "I really love Vincent D'Onofrio, he's an awesome actor. Even his voice was different as the Kingpin. \n\nBut he does make some terrible movie choices. What a hell have I just watched?",
            "author": "sumofawitch",
            "parent_id": "t3_5rrasx",
            "time": 1486202549.0,
            "id": "ddb1yih",
            "sentiment_score": 0.47120440505647054
        },
        {
            "score": 4,
            "body": "Vincent D'Onofrio was good, and the ending does set up an interesting idea for a sequel. Aside from that, it was just another bland jumpscare fest with poor performances and a serious case of Fuck You Editing in the 3rd act.",
            "author": "ThatSithOverThere",
            "parent_id": "t3_5rrasx",
            "time": 1486285596.0,
            "id": "ddcboxz",
            "sentiment_score": 0.034143340781187526
        },
        {
            "score": 4,
            "body": "Welp, they could have just  try to recreate the atmosphere that made the American Ring good.\n\nOr faithfully adapt the book for a hard-reboot. The story of the book is more relevant than ever, it's a shame they missed the chance. I mean this one already borrowed the elements from the book : the tape 'mutated' into different forms, Samara being a rape victim, and rebirth of Samara / Sadako with a human vessel. ",
            "author": "RamaAnthony",
            "parent_id": "t3_5rrasx",
            "time": 1486327200.0,
            "id": "ddcv64z",
            "sentiment_score": 0.9886697017134627
        },
        {
            "score": 3,
            "body": "There's definetly going to be a sequel. So Samara was reborn as Julia? Or born into Julia or whatever. I didn't know how to put it. \nIt wasn't a terrible movie but it wasn't great. The plane scene did make me laugh though. \nSo technically the creepy priest pervert was right and Julia should've listened. At the beginning she said she didn't want anyone to die because of her..she just doesn't know what kind of hell she's unleashed now. \nIt went different as expected certainly. I thought Julia would get pregnant and Samara would be reborn as the baby or whatever. \nBut what is Samara's motive exactly? Why did she need a human host?",
            "author": "its_the_green_che",
            "parent_id": "t3_5rrasx",
            "time": 1486348073.0,
            "id": "ddd7asa",
            "sentiment_score": 0.923679589516547
        },
        {
            "score": 4,
            "body": "So was this movie supposed to be a fresh start from the other movies? Because the plot involving Samsara's parents was completely different than what we learned in the first two. \n\nIt's a shame, the first one is one of my favorite movies.",
            "author": "Futurames",
            "parent_id": "t3_5rrasx",
            "time": 1486640095.0,
            "id": "ddimip5",
            "sentiment_score": -0.12423710196967974
        },
        {
            "score": 3,
            "body": "Blair Witch and The Ring were my 2 favorite horror movies as a \"tween\". PLEASE STOP RUINING MY MOVIES",
            "author": "jonsnow312",
            "parent_id": "t3_5rrasx",
            "time": 1486670699.0,
            "id": "ddizvij",
            "sentiment_score": -0.31756158825481684
        },
        {
            "score": 3,
            "body": "Of all the things that scared me in this film it was when they put an umbrella up outside of the church, great horror",
            "author": "_YerDa",
            "parent_id": "t3_5rrasx",
            "time": 1486699693.0,
            "id": "ddjlrr2",
            "sentiment_score": -0.6170343472852993
        },
        {
            "score": 6,
            "body": "Watch this if you're trying to fix your sleep schedule. It did for me!",
            "author": "yellowbus12",
            "parent_id": "t3_5rrasx",
            "time": 1486487312.0,
            "id": "ddfq4ig",
            "sentiment_score": -0.04600998963551506
        },
        {
            "score": 7,
            "body": "Typical remake garbage, somehow managed to do worse than the original (not) surprisingly, if you're on the fence about this movie, just give it a pass.",
            "author": "AvantAveGarde",
            "parent_id": "t3_5rrasx",
            "time": 1486615550.0,
            "id": "ddi37w7",
            "sentiment_score": 0.7595797714242305
        },
        {
            "score": 3,
            "body": "Guess it won't scare me based on all the crappy reviews.",
            "author": "DragonFireDon",
            "parent_id": "t3_5rrasx",
            "time": 1486122519.0,
            "id": "dd9m0lt",
            "sentiment_score": -0.7703572649530297
        },
        {
            "score": 3,
            "body": "So someone tell me if i'm remembering right. Didn't Samara's mom in the Ring 2 imply that her father was some kind of otherworldly being?\n\nAm I remembering wrong? Because when the priest was revealed to be father I went what?\n\n",
            "author": "dragonman8001",
            "parent_id": "t3_5rrasx",
            "time": 1486273278.0,
            "id": "ddc34lu",
            "sentiment_score": -0.81222789860608
        },
        {
            "score": 3,
            "body": "Wouldn't say it's the worst thing I've ever scene. Pretty much all jump scares, though it did have like some Final Destination/Don't Breathe segments which I thought was a nice change of pace. It's obviously in the eye of the beholder but people are definitely over exaggerating how bad it is. ",
            "author": "CovetedBody",
            "parent_id": "t3_5rrasx",
            "time": 1486566883.0,
            "id": "ddh90vc",
            "sentiment_score": -0.6968843706001804
        },
        {
            "score": 3,
            "body": "Huh, I didn't even realize they were making a Ring sequel/reboot/thing. Shame that it apparently sucked; I loved the first two.\n\nActually, come to think of it, I'm seeing Ring Two get a lot of hate. Which just seems odd to me because I remember it being amazingly terrifying, though I was much younger when I last saw it. Maybe I should give them both a rewatch...maybe go and watch the Japanese original, too.",
            "author": "Shockz0rz",
            "parent_id": "t3_5rrasx",
            "time": 1486633359.0,
            "id": "ddihmrk",
            "sentiment_score": 0.7641700812380954
        },
        {
            "score": 6,
            "body": "This movie was not screened for critics and now has a 0% on rottentomatoes, which means absolutely no one should see it. Another creative horror story milked into a money grab POS. \"Hey remember that good horror movie from 2000? Remember how the sequel didn't work out so well? What if we made another, but just didn't try this time and filled it with jump scares and hired the cheapest actors we could find?\" Even the original wasn't really \"original.\"",
            "author": "ImMakinTrees",
            "parent_id": "t3_5rrasx",
            "time": 1486154523.0,
            "id": "dda02s0",
            "sentiment_score": 0.5522425144870486
        },
        {
            "score": 5,
            "body": "Thought it was going to go somewhere interesting with the whole \"Tails\" thing, but nope, that went out the window pretty quick. What was even the point of that?\n\nThe acting is pretty flat. Half the time, the main character just kind of points things out in her lines.\n\nDidn't expect the movie to be any good, but I didn't really expect it to be this bad either.",
            "author": "toastedbreadcrumb",
            "parent_id": "t3_5rrasx",
            "time": 1486130544.0,
            "id": "dd9qyv0",
            "sentiment_score": -0.8103055617544188
        },
        {
            "score": 5,
            "body": "It was a solid 5/10 for me through the middle. Then I stopped caring and we got a good performance from big D, redeemed it up to a 6. Honestly, I loved the idea that Johnny Gilecki wanted to science that shit. It's just a nice progression from the original that made sense and *would have* been really cool, had they not dropped the plotline without even explaining the experiment. \n\nMain theme was set up well and I'm glad they never really spelled this out like a lot of movies do. The story of Orpheus is an example of unconditional love. She was Orpheus in that she followed him into hell and watched the video, not out of curiosity or thrill seeking, but to save him. *Maybe* that's at least a decent explanation why she unlocked the bonus content? Whatever. From there they follow the plot of the original and by the middle it's clear that this is not a good movie. Point is, that love and empathy led to Samara taking revenge on who she wanted and spawning within Julia. \"We paid a high price for the charity we gave\" or something along those lines. \n\nOverall, some good ideas that got half-baked thrown together with some lazy writing. I thought the acting was at least on the upper end for horror and the effects were pretty good.",
            "author": "diddles_giraffes",
            "parent_id": "t3_5rrasx",
            "time": 1486214577.0,
            "id": "ddb99qd",
            "sentiment_score": -0.22583180958214144
        },
        {
            "score": 5,
            "body": "this was really bad. i went for a prescreening at paramount studios and left 40 minutes into the film because i was bored to death. it's pretty much a high school drama with the VHS tag thrown in because it's a ring movie.",
            "author": "anti_body",
            "parent_id": "t3_5rrasx",
            "time": 1486128532.0,
            "id": "dd9pv2t",
            "sentiment_score": -0.3746599533064241
        },
        {
            "score": 4,
            "body": "Goddamn it looks like it sucks",
            "author": "fatchobanispliff",
            "parent_id": "t3_5rrasx",
            "time": 1486177457.0,
            "id": "ddai1u8",
            "sentiment_score": 0.45044818468935177
        },
        {
            "score": 4,
            "body": "Just got back from and I will say I was excited for the movie I'll admit so I had expectations. The movie was ok that's it. It wasn't bad and definetly not boring(but it did drag at times) it wasn't great either. 6 maybe 5 out of 10 for me. A few notes I actually enjoyed Johnny Galecki's character. Also really liked Vincent D'Onofrio's as well. The main actress wasn't really bad but I really hated her character very very much. The main actor was just generic to me that's about it. The overall plot was enjoyable. I really did like the twist that was the priest. The last scene of the movie was kind of predictable but I did really like it. Samara Morgan still does creep me out I'll admit that. The jump scares sucked. Overall the film isn't winning any awards any time soon. I wouldn't necessarily recommend it to anyone. If you do see yourself watching it. I think it's a big time waster movie. There are some good scenes in it and some bad scenes it. I think it's good enough for a one time watch. ",
            "author": "gclem16",
            "parent_id": "t3_5rrasx",
            "time": 1486222780.0,
            "id": "ddbcsx7",
            "sentiment_score": -0.3517995484905194
        },
        {
            "score": 5,
            "body": "This movie was trash.. the only good thing I got out of going to the theater was nachos.. what a waste of money. ",
            "author": "April040715",
            "parent_id": "t3_5rrasx",
            "time": 1486435329.0,
            "id": "ddeqlnn",
            "sentiment_score": -0.7026446858228108
        },
        {
            "score": 4,
            "body": "Is it just me or were a lot of scenes from the trailer not in the film itself?",
            "author": "Greatest_Ever_III",
            "parent_id": "t3_5rrasx",
            "time": 1486704336.0,
            "id": "ddjpsy5",
            "sentiment_score": -0.08777509430773733
        },
        {
            "score": 2,
            "body": "Might be the most boring horror movie ever",
            "author": "9Virtues",
            "parent_id": "t3_5rrasx",
            "time": 1486206624.0,
            "id": "ddb4mvq",
            "sentiment_score": 0.39309235844969503
        },
        {
            "score": 2,
            "body": "Honestly, are there really any good horror movies that are actually scary? I always thought you were supposed to give horrors a pass because their main point is to make you jumpy and nervous, not to impress you.\n\nEdit: Thanks for all the suggestions, I really didn't expect so many.",
            "author": "darklord0211",
            "parent_id": "t3_5rrasx",
            "time": 1486652503.0,
            "id": "dditjiy",
            "sentiment_score": -0.8243436456226831
        },
        {
            "score": 2,
            "body": "I felt like it deviated rather far from the first film and some parts were a little strange but the colour scheme was really nice to watch",
            "author": "mori-arty",
            "parent_id": "t3_5rrasx",
            "time": 1486703958.0,
            "id": "ddjph3i",
            "sentiment_score": -0.7690305310676138
        },
        {
            "score": 7,
            "body": "Wow, I wasn't expecting much based on how much everyone was shitting on it. That movie was MUCH better than The Ring 2, it had the core of a great story (I'll admit some fine details were fucking weird), the actors weren't nearly as bad as everyone was making them out to be either. \n\nThey needed to tie the end up though. Stop leaving it open for new movies. The Ring should have at most had 2 movies.\n\nI personally give it 7/10. I feel like a lot of people shitting on it are 14 year olds who weren't even alive when The Ring came out.",
            "author": "naphthoylindole",
            "parent_id": "t3_5rrasx",
            "time": 1486293397.0,
            "id": "ddch1ib",
            "sentiment_score": -0.30698416840868226
        },
        {
            "score": 4,
            "body": "not a bad film overall.. once the twist with the preist came about I really got into it.. preists always scare the shit outta me and that arc was great(i love vincent d so thats probably why as well). . but id recommend waiting for dollar movies or redbox. i had a cinemark gift card lol. i give this about a 5.8/10.. definitely not a zero , and not the worse movie ive seen in the last year.. that still goes to suicide squad lol\n\nthis movie would be a solid 6.5 if it just ended on a good note.. why would samara take over julia if shes finally free? and julia helped her kill the priest too.. wtf?preparing for more ring movies really soured the ending of what I thought was a decent flick",
            "author": "cheshire_ranch",
            "parent_id": "t3_5rrasx",
            "time": 1486214786.0,
            "id": "ddb9dhl",
            "sentiment_score": 0.6617270110717852
        },
        {
            "score": 4,
            "body": "I really wish they'd just made it a stealth remake of It Follows and focused more on the idea of passing the video onto the next person, and that if they don't, then Samara goes back down the line and starts killing all the people who copied it.",
            "author": "shaneo632",
            "parent_id": "t3_5rrasx",
            "time": 1486246826.0,
            "id": "ddbks99",
            "sentiment_score": -0.44745164758691724
        },
        {
            "score": 3,
            "body": "[So is pedo priest kinda the good guy? He's a scumbag racist but him killing the other 11 people who came to try and free Samara pretty much stopped her from spreading her curse to the masses. He was a piece of shit but he was pretty much in the right](#spoiler)",
            "author": "dragonman8001",
            "parent_id": "t3_5rrasx",
            "time": 1486286025.0,
            "id": "ddcbzun",
            "sentiment_score": 0.22171758199199898
        },
        {
            "score": 2,
            "body": "I'm so confused. \n\nWasn't Samantha's body in the well (ring 1)?\n\nSamantha was already a ghost, why would she need rebirth? Does that mean she's free to walk the earth? ",
            "author": "BruteeRex",
            "parent_id": "t3_5rrasx",
            "time": 1486380865.0,
            "id": "dddwonr",
            "sentiment_score": 0.5117389984402094
        },
        {
            "score": 2,
            "body": "The movie was better than it had any right to be, but it didn't try to do anything new. I actually enjoyed the mystery aspect of the film, but it kind of failed as a scary movie, as it wasn't scary at all and was filled with cheap fake jump scares. If you want to see my full review you can check it out here: https://www.youtube.com/watch?v=JstAEbfzXwI",
            "author": "BigZ7337",
            "parent_id": "t3_5rrasx",
            "time": 1486200328.0,
            "id": "ddb0gic",
            "sentiment_score": 0.5703612255384187
        },
        {
            "score": 2,
            "body": "I'm definitely in the minority here but I think it was a pretty solid movie. Everyone finding it boring must not be a big fan of horror movies because I was pretty much glued to the screen the entire time. Maybe I just have low standards, and maybe it was just nostalgia, but I liked it a lot (except for the ending).",
            "author": "snowdog_93",
            "parent_id": "t3_5rrasx",
            "time": 1486219706.0,
            "id": "ddbbmvo",
            "sentiment_score": 0.9573696630577999
        },
        {
            "score": 2,
            "body": "When I saw this on Friday with some friends, the theater forgot to charge my card and just gave me tickets. So, SO glad I didn't pay to see this. ",
            "author": "aaspradlin",
            "parent_id": "t3_5rrasx",
            "time": 1486438965.0,
            "id": "ddetr28",
            "sentiment_score": -0.3202316105166174
        },
        {
            "score": 2,
            "body": "Anyone else pretending that this movie never happened? It had too many plot holes and inconsistencies to be considered a \"sequel\". ",
            "author": "TheEternalServant",
            "parent_id": "t3_5rrasx",
            "time": 1486487957.0,
            "id": "ddfqbvo",
            "sentiment_score": -0.7746949227718545
        },
        {
            "score": 2,
            "body": "Holy crap I forgot this movie came out and was mildly excited for it. Now I see it's the trainwreck of the decade and glad I didn't get to it.",
            "author": "MontanaSD",
            "parent_id": "t3_5rrasx",
            "time": 1486430721.0,
            "id": "ddemls1",
            "sentiment_score": 0.24201928550335228
        },
        {
            "score": 100,
            "body": "Vincent D'Onfrio needs to stop being Mr.Exposition in all these shitty horror movies ",
            "author": "KicksButtson",
            "parent_id": "t1_dd9pgje",
            "time": 1486151131.0,
            "id": "dd9yo9p",
            "sentiment_score": 0.19046226078127848
        },
        {
            "score": 15,
            "body": "Yeah, so everyone should just close their eyes when she'd come. ",
            "author": "sumofawitch",
            "parent_id": "t1_dd9pgje",
            "time": 1486202387.0,
            "id": "ddb1unv",
            "sentiment_score": -0.5814693334431162
        },
        {
            "score": 9,
            "body": "If that were true he'd literally just have to wear a blindfold whenever he thought the shit was going down.",
            "author": "IanMazgelis",
            "parent_id": "t1_dd9pgje",
            "time": 1486222383.0,
            "id": "ddbcnoy",
            "sentiment_score": -0.2997874354772194
        },
        {
            "score": 3,
            "body": "Lmfao",
            "author": "mhs003",
            "parent_id": "t1_dd9pgje",
            "time": 1486295303.0,
            "id": "ddci9oq",
            "sentiment_score": 0.4690184501740555
        },
        {
            "score": 2,
            "body": "What did she end up doing to him",
            "author": "dark-flamessussano",
            "parent_id": "t1_dd9pgje",
            "time": 1486249824.0,
            "id": "ddbmgn1",
            "sentiment_score": 0.8475228792100973
        },
        {
            "score": 94,
            "body": "You forgot to mention that while 95% of the scary parts are jump scares, only like 20 minutes of the movie are scary parts.",
            "author": "jdog90000",
            "parent_id": "t1_dd9lmvm",
            "time": 1486123962.0,
            "id": "dd9n075",
            "sentiment_score": -0.02848666333473071
        },
        {
            "score": 14,
            "body": "that shot where the arms grab her from behind is the frickin ending? jeez",
            "author": "poland626",
            "parent_id": "t1_dd9lmvm",
            "time": 1486187053.0,
            "id": "ddaqjd9",
            "sentiment_score": 0.16473234970870165
        },
        {
            "score": 11,
            "body": "Also in the trailer the blind man tells her the hand thing means \"rebirth\" but they made it a plot twist for the final movie. Dumb.\n\nPlus I remembered the bathroom scene hadn't come up yet so the ending was even more predictable.",
            "author": "shaneo632",
            "parent_id": "t1_dd9lmvm",
            "time": 1486247143.0,
            "id": "ddbkylu",
            "sentiment_score": -0.3535061177445704
        },
        {
            "score": 3,
            "body": "I would kind of disagree with this, and the sentence \"Literally 95% jump scares in this film.\" doesn't make any sense. I hated this movie, but there are like 2 jump scares (Snake or whatever, and then the one shown in the trailer).",
            "author": "Y0ungPup",
            "parent_id": "t1_dd9lmvm",
            "time": 1486281789.0,
            "id": "ddc92bf",
            "sentiment_score": -0.21571121682349048
        },
        {
            "score": 35,
            "body": "Probably saw the reviews for The Space Between Us and thought it was a bad idea.",
            "author": "Xerop681",
            "parent_id": "t1_dd9jkee",
            "time": 1486119420.0,
            "id": "dd9jrmj",
            "sentiment_score": -0.6039362911866453
        },
        {
            "score": 33,
            "body": "Ring$\n\n",
            "author": "dangerousbob",
            "parent_id": "t1_dd9jkee",
            "time": 1486131103.0,
            "id": "dd9r93q",
            "sentiment_score": -0.8647050305748629
        },
        {
            "score": 31,
            "body": "There were two or three directions they could have gone that would have been somewhat original, but instead they went for the lowest common denominator.",
            "author": "bigpig1054",
            "parent_id": "t1_dd9qxif",
            "time": 1486132015.0,
            "id": "dd9rpa4",
            "sentiment_score": -0.3965413939177438
        },
        {
            "score": 55,
            "body": "It was terrible. I watched it as a comedy after about halfway and it was much more enjoyable",
            "author": "TehAlpacalypse",
            "parent_id": "t1_dd9j6qo",
            "time": 1486119231.0,
            "id": "dd9jmkv",
            "sentiment_score": 0.5846521317902829
        },
        {
            "score": 25,
            "body": "They're both bad, but bye bye man was all time levels of bad.  This one is watchable, albeit boring at times, but at least it was competently made.  Nothing I saw in bye bye man showed a competent director or acting. ",
            "author": "Hiccup",
            "parent_id": "t1_dd9j6qo",
            "time": 1486149471.0,
            "id": "dd9y32i",
            "sentiment_score": -0.9910385801390544
        },
        {
            "score": 38,
            "body": "and i gotta say, even the japanese Ring vs The Grudge was funner than this shit that is \"Rings\".",
            "author": "leopald18",
            "parent_id": "t1_dd9j6qo",
            "time": 1486119620.0,
            "id": "dd9jwvk",
            "sentiment_score": -0.6075412103409592
        },
        {
            "score": 14,
            "body": "You think so? I enjoyed Rings a hell of a lot more than the Bye Bye Man. I thought the first act of Rings was a cool spin on the idea (that unfortunately was kind of dropped as the film went on). The only thing that I actively disliked about Rings was the ending, which seemed like an obvious set-up for sequels.",
            "author": "BIG_PY",
            "parent_id": "t1_dd9j6qo",
            "time": 1486161686.0,
            "id": "dda4cq1",
            "sentiment_score": -0.5397724833440412
        },
        {
            "score": 6,
            "body": "The Bye Bye Man *tried*. It wasn't successful, but it took a weak swing and instead was a lazy January horror movie. \n\nRings doesn't even *try*. It's content to sit there and take up 2 hours of time. How is the biggest \"scare\" in a horror movie a dog barking and a loud door knock?!",
            "author": "chicagoredditer1",
            "parent_id": "t1_dd9j6qo",
            "time": 1486261020.0,
            "id": "ddbuapo",
            "sentiment_score": 0.6771598844413387
        },
        {
            "score": 31,
            "body": "how does this still happen in this day and age?",
            "author": "bloodflart",
            "parent_id": "t1_dd9m0gm",
            "time": 1486172295.0,
            "id": "ddadd46",
            "sentiment_score": 0.26628344135776905
        },
        {
            "score": 3,
            "body": "Exactly what I was gonna say- I'm also in the crowd of low standards (*especially* compared to this sub) and will honestly be entertained by anything, but maaaaaaaaaan this was not very good.......\n\n\n\nThey had an interesting idea with the \"tails\" but then that just kinda died out.",
            "author": "iBigBoyBrian",
            "parent_id": "t1_dd9m0gm",
            "time": 1486225990.0,
            "id": "ddbdvcj",
            "sentiment_score": 0.2113477093185303
        },
        {
            "score": 1,
            "body": "I don't intend to see this but it sounds like the film knows exactly how it intends to use these cheap scares, and who it appeals to, unfortunately.",
            "author": "mercenarri",
            "parent_id": "t1_dd9m0gm",
            "time": 1486201961.0,
            "id": "ddb1kia",
            "sentiment_score": -0.9711402054686513
        },
        {
            "score": 1,
            "body": "Same. I like a lot of bad movies, but this was pretty much unwatchable, and I should've walked out and got a ticket voucher.",
            "author": "Y0ungPup",
            "parent_id": "t1_dd9m0gm",
            "time": 1486282133.0,
            "id": "ddc9axc",
            "sentiment_score": 0.9196714693274253
        },
        {
            "score": 71,
            "body": "Glad I'm not the only one that likes to read the plot recaps of these terrible horror movies.\n\nI have no idea why. I read through the entirety of the Paranormal Activity franchise's plot synopses on Wikipedia last week.",
            "author": "Ikea_Man",
            "parent_id": "t1_dd9rujr",
            "time": 1486169113.0,
            "id": "ddaahza",
            "sentiment_score": -0.5987160016988846
        },
        {
            "score": 107,
            "body": "Starts off with a college professor finding the tape and kind of making a collegiate society around students watching the tape and then passing it on to another student. Main character's boyfriend gets tangled up in it and she decides to voluntarily watch it to save him. \nProblems arise when it appears that the tape (now a .mov file after being copied as part of this society) has mutated into a new version of the tape that details the disappearance of a different girl. This new copy cannot be copied and basically forces Julia, the main girl, to solve the mystery to save herself.\n\nThis takes her to a town in the northwest where she finds out the girl on the tape was Samara's mother Evelyn who was captured an imprisoned in a secret church basement by a priest, raped and forced to have the child. Through the events of the first film, Samara dies in the well, but her corpse is later relocated to this town, where the body disappears from her grave. \n\nTurns out a blind man who oversees the graveyard is the priest and has Samara buried in his wall. The new mutation of the tape leads Julia to finding this body, liberating the corpse via cremation, breaking the curse.\n\nBut oh no, it is revealed right before the credits that Julia has been branded to become the vessel for Samara's rebirth.\n\nThis is a gross oversimplification of the plot, but basically hits the major points.",
            "author": "BIG_PY",
            "parent_id": "t1_dd9rujr",
            "time": 1486162574.0,
            "id": "dda50rn",
            "sentiment_score": -0.135904860826765
        },
        {
            "score": 14,
            "body": "So it starts off on this plane and this guy is talking about the videotape \"I only have to make it 5 more minutes\" then spooky shit starts to happen. The ring video plays on every screen on the plane. Flash forward 2 years. Some dude (Gabriel) is trying to buy a VCR, and \"it was from this kid that died in a plane crash 2 years ago\" \nGabriel  gets home. Fucks with it and the ring tape pops out. He sees some shit, a fly flies out of his joint.\nTitle\nWe get to know this couple, holt  is leaving for college, Julia is staying home. 6 weeks later they're talking on skype and  he's \"coming home in 7 days\", she's talking to him on skype, his friends burst in and say \"he'll talk to you later\" she's suspicious. \nLater that night she gets a call from him on skype. She answers,It's some random broad (skye) she's like \"where is he?\" \n\"Bitch I don't know\" \n*face distorts \"he won't escape her\"\nShe goes to investigate at his college, bla bla bla comes across Gabreil. She follows him and sees there's a ring club or some shit where everyone watches the video and passes it to someone who volunteers so they don't die. \nShe follows skye back to her place and she's like \"watch this video\" \nJulia steals skyes phone for a bit to text Holt, he tells her not to watch. She hides in the bathroom and the ring girl kills skye. \nJulia and holt meet up again \nThey go to Gabriel's place and it turns out Julia watched an extended cut of the video after they escaped skyes house and she's already been marked, this goes on for a bit. Like the first two movies \"what is the mystery of the ring girl\" (I know her name is samera my phone just keeps correcting it so fuckit) \nSo they go to a church  cemetery to figure shit out all the while Julia is having visions like the movie 'take shelter' with the birds. But the kind priest says \" The ring girl is bured somewhere else not in this unmarked tomb with claw marks and writing on the inside\" \nMeanwhile Gabriel figures some shit out and leaves holt a voice message and drives to find him. But he gets in a car wreck, Julia and holt come across it and then an electrical pole falls and kills Gabriel while he's trying to convey important information. \nSo Julia goes back to the church and finds a cellar. The ring girls mom was apparently imprisoned here  by the priest until Samera was born. \nShe fights the priest. Uses the ring girl to kill the priest. Wins. Looks like she's finally resting in peace....\nUNTIL \nshe's showering, coughes up hair, holt finally receives Gabreils message, turns out the mark on Julia's hand is brail. \nMeanwhile Julia is still pulling hair from her mouth. Finally gets it out. There's a bug in there. \nThe brail reads rebirth. \nThe end\n\nI want my money back. \n\n",
            "author": "Sleepy_Owl420",
            "parent_id": "t1_dd9rujr",
            "time": 1486204165.0,
            "id": "ddb310u",
            "sentiment_score": 0.6486829609299858
        },
        {
            "score": 5,
            "body": "Seconded. I loved the first Ring movie, and the second one was a guilty pleasure of mine. I really don't wanna see this, but I wanna hear how badly they screwed this one up.",
            "author": "ryanman345",
            "parent_id": "t1_dd9rujr",
            "time": 1486157921.0,
            "id": "dda1ur9",
            "sentiment_score": -0.13532385590828722
        },
        {
            "score": 73,
            "body": "The witch was such a slow burn, I loved it. Shitty jump scares make money, though.\n\n",
            "author": "Crom_laughs_at_you",
            "parent_id": "t1_dd9jprx",
            "time": 1486120217.0,
            "id": "dd9kcec",
            "sentiment_score": 0.6685550288033844
        },
        {
            "score": 17,
            "body": "What you describe is what I felt about The Ring and The Grudge.  The scariest moments weren't jump scares.",
            "author": "Lira70",
            "parent_id": "t1_dd9jprx",
            "time": 1486120491.0,
            "id": "dd9kjk5",
            "sentiment_score": 0.6577501889574653
        },
        {
            "score": 7,
            "body": "Man that reminds me I need to go watch The Witch",
            "author": "Ikea_Man",
            "parent_id": "t1_dd9jprx",
            "time": 1486169069.0,
            "id": "ddaagk0",
            "sentiment_score": -0.8427310084012913
        },
        {
            "score": 4,
            "body": "I need to check out Martyrs. The Witch was one of my favorite movies last year, so seeing anything clumped into a category with it means I should check it out.\n",
            "author": "Wint3riscoming",
            "parent_id": "t1_dd9jprx",
            "time": 1486185065.0,
            "id": "ddaouv3",
            "sentiment_score": 0.09106757313874692
        },
        {
            "score": 2,
            "body": "Everyone says \"oh jump scares are soo easy and lazy\" but how are they lazier than filming in the dark and playing atmospheric noise in the back? Everyone praises \"unsettling\" movies, but they use obvious cheap tricks too. It is more difficult to frame and edit in a well placed jumpscare than to film a dark forest while atmospheric nature sounds or lynchian noise plays. \n\n\n\"oh jumpscares are too simple, anyone jumps from being startled!\" and the same can be said for the myriad of \"prestige\" horror movies that use the exact same atmospheric techniques that would make anyone uncomfortable. I'm not saying all jumpscares are good, or that movies never overuse them, but I disagree with the common idea that jumpscares are automatically bad because they aren't a slow burn. The main point I am making is that generalizing film techniques as absolutely bad or good makes no sense, sometimes there are good jumpscares sometimes there aren't. It's like saying jokes are bad because you've watched Adam Sandler's movies, or that jokes in general are just a cheap way to get a reaction from the audience. ",
            "author": "Santasnads",
            "parent_id": "t1_dd9jprx",
            "time": 1486122574.0,
            "id": "dd9m1x5",
            "sentiment_score": -0.9671373697859431
        },
        {
            "score": 32,
            "body": "Well thanks for never turning the internet back off, I really like using it.",
            "author": "modusoperendi",
            "parent_id": "t1_ddajxj9",
            "time": 1486186178.0,
            "id": "ddapszr",
            "sentiment_score": -0.07054531759609461
        },
        {
            "score": 28,
            "body": "And she \"only\" realizes the violin girl is Samara's mother because of the scratch on the wall: 8 months, she was pregnant, she's Samara's mother. \n\nReally?? You've had visions of the girl pregnant!!",
            "author": "sumofawitch",
            "parent_id": "t1_ddaqol1",
            "time": 1486203619.0,
            "id": "ddb2o7k",
            "sentiment_score": -0.7577770321169623
        },
        {
            "score": 7,
            "body": "She sounded like a character straight out of a Resident Evil game. ",
            "author": "HalloweenBlues",
            "parent_id": "t1_ddaqol1",
            "time": 1486312032.0,
            "id": "ddcqmum",
            "sentiment_score": 0.5365832070366172
        },
        {
            "score": 77,
            "body": "Don't you know it's: FUCK YOU, IT'S JANUARY??",
            "author": "nelsonfeelsgoodman",
            "parent_id": "t1_dda6new",
            "time": 1486177907.0,
            "id": "ddaigcx",
            "sentiment_score": -0.9107781131553667
        },
        {
            "score": 19,
            "body": "You had fair warning about Monster Trucks, that's on you dude.",
            "author": "Delta_Assault",
            "parent_id": "t1_dda6new",
            "time": 1486176686.0,
            "id": "ddahcn4",
            "sentiment_score": 0.8459614277782954
        },
        {
            "score": 32,
            "body": "Fuck you its ~~January~~ Forever!",
            "author": "Holovoid",
            "parent_id": "t1_dda6new",
            "time": 1486168010.0,
            "id": "dda9iwx",
            "sentiment_score": 0.8227624601032302
        },
        {
            "score": 12,
            "body": "Well that's because it's the most magical time of the year.  [Fuck you, it's January!](https://www.youtube.com/watch?v=H18RUB1cxfI)",
            "author": "MySonsdram",
            "parent_id": "t1_dda6new",
            "time": 1486179761.0,
            "id": "ddak4pt",
            "sentiment_score": -0.21685022685899136
        },
        {
            "score": 25,
            "body": "You take that back XXX was fantastic",
            "author": "Badloss",
            "parent_id": "t1_dda6new",
            "time": 1486173293.0,
            "id": "ddae9ni",
            "sentiment_score": -0.9300972779994365
        },
        {
            "score": 7,
            "body": "Looking forward to hearing your thoughts on [The Space Between Us,](https://www.rottentomatoes.com/m/the_space_between_us/) then!",
            "author": "madhjsp",
            "parent_id": "t1_dda6new",
            "time": 1486179203.0,
            "id": "ddajmim",
            "sentiment_score": -0.5259206346703422
        },
        {
            "score": 5,
            "body": "Lol what are you thinking? 4 films in my city is would be close to $60. You had to know all of these were trash going into them. Granted, mindless entertainment is fun from time to time, but idk about seeing ALL four of these",
            "author": "ralphzillatron",
            "parent_id": "t1_dda6new",
            "time": 1486188223.0,
            "id": "ddarify",
            "sentiment_score": 0.13756329683164426
        },
        {
            "score": 10,
            "body": "Why did you choose to suffer so much in the first place? ",
            "author": "coldpack_989",
            "parent_id": "t1_dda6new",
            "time": 1486167998.0,
            "id": "dda9iio",
            "sentiment_score": -0.35826271905387874
        },
        {
            "score": 3,
            "body": "Post your address so we can send help. No person voluntarily sees all those movies.",
            "author": "Jabronson",
            "parent_id": "t1_dda6new",
            "time": 1486180759.0,
            "id": "ddal1u5",
            "sentiment_score": 0.9078966400236195
        },
        {
            "score": 5,
            "body": "You need to call a shitty movie crisis line right away.",
            "author": "Mc_nibbler",
            "parent_id": "t1_dda6new",
            "time": 1486192961.0,
            "id": "ddav7s7",
            "sentiment_score": 0.11432347986287605
        },
        {
            "score": 3,
            "body": "This is why I check Metacritic. It's not perfect and won't always line up with your preferences, but reviews exist for a reason.",
            "author": "steve_z",
            "parent_id": "t1_dda6new",
            "time": 1486177154.0,
            "id": "ddahs04",
            "sentiment_score": -0.9247770084699858
        },
        {
            "score": 3,
            "body": "Just watch Split man it'll be all good.",
            "author": "Digitalstardust",
            "parent_id": "t1_dda6new",
            "time": 1486254844.0,
            "id": "ddbpqu1",
            "sentiment_score": -0.21903564027506728
        },
        {
            "score": 5,
            "body": "Do you have a very very hard tradition of going to the cinema every week because damn..why?.",
            "author": "HighballJordan",
            "parent_id": "t1_dda6new",
            "time": 1486190031.0,
            "id": "ddasz9o",
            "sentiment_score": 0.4171146226935343
        },
        {
            "score": 2,
            "body": "xXx was at least hysterical the entire time.",
            "author": "GusFringus",
            "parent_id": "t1_dda6new",
            "time": 1486253079.0,
            "id": "ddboixe",
            "sentiment_score": 0.2784375433273403
        },
        {
            "score": 1,
            "body": "At least you didn't watch the underworld movie.",
            "author": "Pangyun",
            "parent_id": "t1_dda6new",
            "time": 1486315946.0,
            "id": "ddcrv91",
            "sentiment_score": -0.12407413439794812
        },
        {
            "score": 1,
            "body": "Don't know what you're talking about, Monster Trucks is fantastic.",
            "author": "carolinemathildes",
            "parent_id": "t1_dda6new",
            "time": 1486355774.0,
            "id": "dddd19t",
            "sentiment_score": -0.3528593728793634
        },
        {
            "score": 134,
            "body": "Tell her that if she watches it she'll die in 7 days. ",
            "author": "SetYourGoals",
            "parent_id": "t1_dd9lk5w",
            "time": 1486131800.0,
            "id": "dd9rlgx",
            "sentiment_score": -0.5503808622919455
        },
        {
            "score": 6,
            "body": "I hated the cold open.  The minute the film began I had to remember that I was in a ring movie and not a final destination movie.  It even felt that way the way some of the death scenes were filmed. Mediocre movie, at best, and wow, it really did copy/us aspects of  a lot of horror films poorly (a real badly done amalgamation) ",
            "author": "Hiccup",
            "parent_id": "t1_dd9lfuh",
            "time": 1486149931.0,
            "id": "dd9y8pz",
            "sentiment_score": -0.38658730822243004
        },
        {
            "score": 13,
            "body": "Of recent horror movies that I've watched, The Witch and 10 Cloverfield Lane are good. It Follows wasn't bad. The Visit is bearable.",
            "author": "dimidunnit",
            "parent_id": "t1_dd9lfuh",
            "time": 1486129198.0,
            "id": "dd9q8qt",
            "sentiment_score": 0.29533802559158606
        },
        {
            "score": 3,
            "body": "> but then immediately drops it and opts instead to copy and paste every major horror movie that's come out in the last few years.\nOuija, Don't Breathe, Final Destination, Insidious...they're all in this movie.\n\nIt even Bane-posted with that plane scene. I almost broke my fucking nose with how hard I facepalmed when I saw that in the trailer. ",
            "author": "RedDeadErection",
            "parent_id": "t1_dd9lfuh",
            "time": 1486184045.0,
            "id": "ddanz5l",
            "sentiment_score": 0.6807117788672308
        },
        {
            "score": 18,
            "body": "Can it be worse than the Bye Bye Man?",
            "author": "Featherwick",
            "parent_id": "t1_dd9r4or",
            "time": 1486160030.0,
            "id": "dda36yl",
            "sentiment_score": 0.959521941648696
        },
        {
            "score": 11,
            "body": "Don't you think saying that it's the worst movie of the year means less *because* it's February? ",
            "author": "alanbright",
            "parent_id": "t1_dd9r4or",
            "time": 1486135967.0,
            "id": "dd9tfzy",
            "sentiment_score": -0.21290289482533864
        },
        {
            "score": 5,
            "body": "Come on man, everyone knows studios take a dump truck full of their worst movies and dump them all out in January and February.\n\nNot to say there aren't good movies that come out in these months, but the worst of the worst can always be found during these months. ",
            "author": "daveblu92",
            "parent_id": "t1_dd9r4or",
            "time": 1486157910.0,
            "id": "dda1uix",
            "sentiment_score": -0.7409625094634396
        },
        {
            "score": 14,
            "body": "IMO, Resident Evil was worse... but only just. Haha",
            "author": "topherthepest",
            "parent_id": "t1_dd9r4or",
            "time": 1486131096.0,
            "id": "dd9r8yj",
            "sentiment_score": 0.8212989958518198
        },
        {
            "score": 2,
            "body": "You must have missed bye bye man.  It might still be in theaters by you if you're looking to see more shitty movies ",
            "author": "Hiccup",
            "parent_id": "t1_dd9r4or",
            "time": 1486150300.0,
            "id": "dd9ydcn",
            "sentiment_score": 0.7859850635004326
        },
        {
            "score": 3,
            "body": "This should be the top review",
            "author": "doctor_rockstar",
            "parent_id": "t1_ddc2tlv",
            "time": 1486436023.0,
            "id": "dder79s",
            "sentiment_score": -0.7954110527806053
        },
        {
            "score": 5,
            "body": "Sadako vs. Kayako was actually pretty good. It's available on Shudder. ",
            "author": "zrox456",
            "parent_id": "t1_dda2rk8",
            "time": 1486160976.0,
            "id": "dda3ud7",
            "sentiment_score": 0.16673511960111176
        },
        {
            "score": 7,
            "body": "Dark Water was awesome if you looked at it as a psychological drama/thriller. ",
            "author": "Chaseism",
            "parent_id": "t1_dda2rk8",
            "time": 1486168858.0,
            "id": "ddaa9tg",
            "sentiment_score": -0.24831153137714534
        },
        {
            "score": 5,
            "body": "I thought SvK was awful, one of the worst movies I saw last year. However from I can gather it's still probably better than this.",
            "author": "mi-16evil",
            "parent_id": "t1_dda2rk8",
            "time": 1486170898.0,
            "id": "ddac3ts",
            "sentiment_score": -0.9937320160049783
        },
        {
            "score": 1,
            "body": "It's a known entity.",
            "author": "holla171",
            "parent_id": "t1_dda2rk8",
            "time": 1486169640.0,
            "id": "ddaaz4v",
            "sentiment_score": -0.00907888720592176
        },
        {
            "score": 11,
            "body": "Up to 7% now. ",
            "author": "mi-16evil",
            "parent_id": "t1_ddakify",
            "time": 1486184122.0,
            "id": "ddao1je",
            "sentiment_score": 0.25355996790598434
        },
        {
            "score": 3,
            "body": "Paramount embargoed the reviews until this morning, so basically yes. ",
            "author": "gingeguy22",
            "parent_id": "t1_dd9r2a8",
            "time": 1486183258.0,
            "id": "ddanagh",
            "sentiment_score": -0.8886231746793909
        },
        {
            "score": 7,
            "body": "Haha yes! I was like \"was that really necessary?\" ",
            "author": "Nutmeg_Peach",
            "parent_id": "t1_ddarf7k",
            "time": 1486207005.0,
            "id": "ddb4vrl",
            "sentiment_score": -0.6084409527839447
        },
        {
            "score": 2,
            "body": "I just LOL'd",
            "author": "ndrw17",
            "parent_id": "t1_ddarf7k",
            "time": 1486209085.0,
            "id": "ddb673f",
            "sentiment_score": 0.23324450454459433
        },
        {
            "score": 3,
            "body": ">Track back/maybe forward who knows. Cops dicking around with an empty car instead of HELPING A MAN UPSIDE DOWN IN A CAR DIRECTLY IN FRONT OF THEM. The movie then turns to Final Destination for a second with some power poles.\n\nThis bugged me so much.",
            "author": "ScorpyOwns",
            "parent_id": "t1_ddednit",
            "time": 1486535387.0,
            "id": "ddgncnk",
            "sentiment_score": 0.3663512231721371
        },
        {
            "score": 14,
            "body": "> Firstly the dialogue was like listening to a bad audio dub of a Japanese RPG. I\n\ni mean.... now i just want to watch it even more...",
            "author": "NightwingsEscrimas",
            "parent_id": "t1_dd9jlii",
            "time": 1486119451.0,
            "id": "dd9jshi",
            "sentiment_score": 0.7257438219514769
        },
        {
            "score": 6,
            "body": ">Budget Zac Effron\n\nFuck I'm dying lmao",
            "author": "nguyenqh",
            "parent_id": "t1_dd9jlii",
            "time": 1486172692.0,
            "id": "ddadq2v",
            "sentiment_score": 0.6489710406596838
        },
        {
            "score": 3,
            "body": "> How did missing sex dungeon not not draw any interest from police? \n\nWhat?!  Could you expand on this?  Why is there a sex dungeon?  \n\nPlease tell me people were trying to have sex with Samara.",
            "author": "EnterprisingAss",
            "parent_id": "t1_dd9jlii",
            "time": 1486123524.0,
            "id": "dd9mplt",
            "sentiment_score": 0.4602851792236422
        },
        {
            "score": 3,
            "body": "Also when the boyfriend was still under the curse and he had 12 hours left, he just went to sleep instead of trying to find someone to pass it along to lol",
            "author": "BilboSwankins",
            "parent_id": "t1_dd9jlii",
            "time": 1486249550.0,
            "id": "ddbmasi",
            "sentiment_score": -0.2624369793368868
        },
        {
            "score": 1,
            "body": "My ticket was free.  I still wish I hadn't gone ",
            "author": "Hiccup",
            "parent_id": "t1_dd9jlii",
            "time": 1486150230.0,
            "id": "dd9ych8",
            "sentiment_score": -0.03748846302849196
        },
        {
            "score": 8,
            "body": "This film erases the events of The Ring Two completely. They don't even mention Rachel or Aidan, and with the erasure of that sequel, they don't have to answer the question of how Samara escaped the well. ",
            "author": "gingeguy22",
            "parent_id": "t1_ddactwv",
            "time": 1486183129.0,
            "id": "ddan6bv",
            "sentiment_score": -0.04809792418530612
        },
        {
            "score": 2,
            "body": "Yes.",
            "author": "ShelbyDallas",
            "parent_id": "t1_ddactwv",
            "time": 1486172477.0,
            "id": "ddadj1n",
            "sentiment_score": 0.23075007253476554
        },
        {
            "score": 1,
            "body": "I honestly couldn't tell how this was supposed to be a sequel to the first two movies. I know it isn't a reboot but I'm treating it like one.",
            "author": "IanMazgelis",
            "parent_id": "t1_ddactwv",
            "time": 1486222680.0,
            "id": "ddbcrkq",
            "sentiment_score": -0.4759680619779012
        },
        {
            "score": 9,
            "body": "I haven't even seen this movie and I'm crying from laughter haha, bless this post",
            "author": "breeampana",
            "parent_id": "t1_dde7k55",
            "time": 1486468373.0,
            "id": "ddfh3cx",
            "sentiment_score": 0.7419354759015262
        },
        {
            "score": 8,
            "body": "I'm so happy I got up and walked out in the first 15 minutes.  I've been feeling lousy lately and it suddenly struck me that I would rather be home on my couch watching Breaking Bad (first time!!) so I got up and off I went.\n\nTurns out that was a good call.",
            "author": "TheDentite",
            "parent_id": "t1_dde7k55",
            "time": 1486446340.0,
            "id": "ddf03js",
            "sentiment_score": 0.17443679746924512
        },
        {
            "score": 6,
            "body": "Your rage made me laugh at my desk for the first time today, thanks",
            "author": "thousandmovieproject",
            "parent_id": "t1_dde7k55",
            "time": 1486457695.0,
            "id": "ddf8wm0",
            "sentiment_score": 0.6423964934443038
        },
        {
            "score": 2,
            "body": "I was shocked when I saw the budget, what did they spend in on. The effect were really bad, the actors aren't known outside of Leonard. It's baffling.",
            "author": "austine567",
            "parent_id": "t1_dde7k55",
            "time": 1486445459.0,
            "id": "ddezctb",
            "sentiment_score": 0.8283394724008086
        },
        {
            "score": 2,
            "body": "I'd had plans to see this movie for a while. The day comes, awful snowstorm, but I go anyway. On the the home I end up going off the road (I'm fine, my car is fine) when I slid on some ice. My physical wellbeing was at stake, I could've died had I slid into oncoming traffic rather than the ditch. All for this movie.",
            "author": "miller94",
            "parent_id": "t1_dde7k55",
            "time": 1486567272.0,
            "id": "ddh96i8",
            "sentiment_score": 0.8323319895519457
        },
        {
            "score": 2,
            "body": "Lol 33 mil is insane. The most expensive movie EVER made in Europe cost about the same (40 or so mil).",
            "author": "harrymuesli",
            "parent_id": "t1_dde7k55",
            "time": 1486707817.0,
            "id": "ddjsq4m",
            "sentiment_score": 0.4996549226283842
        },
        {
            "score": 7,
            "body": "Ringer here. Watched the clip and it was silly and bizarre. Could the planes readout even display video like that? I was always under the impression she was an electro magnetic force / entity. In my mind it lined up nicely with her being able to manipulate the X-Ray machines, Televisions, phones etc. The water part only added to this for me. How pissed would your sentient radio be if you submerged it in a well full of water.\n\nEdit: Also the addition to the US version that her birthing and conception was part of a cult ritual leads me to believe she was an all powerful force. Why couldn't we just get this as a prequel with the nipple twister modern times ending showing shes still dead-alive?\n\nEdit: A word.",
            "author": "Jaredocobo",
            "parent_id": "t1_ddbkhja",
            "time": 1486252457.0,
            "id": "ddbo424",
            "sentiment_score": -0.7415566701736338
        },
        {
            "score": 2,
            "body": "You could make the case that they were just a casualty. Samara coming out of the plane's console messed with the electrical systems and caused the crash. That's how I interpreted it anyway. It was kind of a way to say that she'll get you no matter where you are and no matter who she has to go through. ",
            "author": "gingeguy22",
            "parent_id": "t1_ddbkhja",
            "time": 1486379321.0,
            "id": "dddvb0l",
            "sentiment_score": -0.30470121869784217
        },
        {
            "score": 2,
            "body": "same. saw it at an advanced screening. they had 3 \"samaras\" come out before the film started. which after the movie, was probably the only awesome thing from everything!! this movie is so bad! the acting. the plot. i told my friends already to fucking avoid it. netflix it in a few months.",
            "author": "jadakiss",
            "parent_id": "t1_ddan6jj",
            "time": 1486207552.0,
            "id": "ddb58l5",
            "sentiment_score": 0.8791504031652468
        },
        {
            "score": 3,
            "body": "What are the original pitches and rumors you know about?",
            "author": "TJ_McWeaksauce",
            "parent_id": "t1_ddbo7ff",
            "time": 1486312645.0,
            "id": "ddcqu7z",
            "sentiment_score": 0.6042718884612976
        },
        {
            "score": 9,
            "body": "kinda",
            "author": "topherthepest",
            "parent_id": "t1_dda80y2",
            "time": 1486166520.0,
            "id": "dda87zw",
            "sentiment_score": -0.9351690104626744
        },
        {
            "score": 3,
            "body": "No, it's bad bad. ",
            "author": "chicagoredditer1",
            "parent_id": "t1_dda80y2",
            "time": 1486260815.0,
            "id": "ddbu54g",
            "sentiment_score": 0.8587061429050664
        },
        {
            "score": 3,
            "body": "> Making a good sequel to the Ring shouldn't be difficult. \n\nYeah kinda is. #1 you need Gore Verbinski. No one else is going to set the mood and atmosphere anywhere near as well. #2 You need a perfectly fresh, gripping story. Impossible. You'd need writers who are working on billion dollar movies to do that, at least. \n\nI could list reasons it's impossible all night.",
            "author": "naphthoylindole",
            "parent_id": "t1_ddaoxq4",
            "time": 1486293847.0,
            "id": "ddchbti",
            "sentiment_score": 0.2622649338220382
        },
        {
            "score": 8,
            "body": "Even when the priest was holding her head down on the table, she sounded like she was reading lines directly from the script. She was REALLY bad.",
            "author": "topherthepest",
            "parent_id": "t1_ddb5v3r",
            "time": 1486229480.0,
            "id": "ddbex3u",
            "sentiment_score": 0.7065089193391465
        },
        {
            "score": 6,
            "body": "You typed all that on your phone? In the theater? Was it daylight when you were done?",
            "author": "FeckTad",
            "parent_id": "t1_ddb5v3r",
            "time": 1486212374.0,
            "id": "ddb8432",
            "sentiment_score": -0.8477703290725933
        },
        {
            "score": 2,
            "body": "I feel like this is a case of the actress' language barrier getting in the way. Matilda Lutz is Italian and this was her first English-speaking role. She may have struggled with the intentions behind some of her lines because of this. \nI agree on the score. I liked that Matthew Margeson used the original Ring themes at points (I felt it was especially effective during the climax) but the new material felt a bit bland and flat. \nI think (though I'm only guessing) that the people that are chosen are the ones that watch the tape of their own free will knowing that it will kill them? Either that or Samara has a vetting process and when you start watching if she thinks you're a good host for rebirth, she shows you the extra images. \nThis was a little different in regards to the possession aspect. I think that Samara became Julia (as in there was no Julia left, whereas with Aidan he was still there, but Samara had the wheel). \nI agree about the opening. I never got the sense of dread from this film that I got with the Ring. In regards to tension and release, instead of going from a zig to a zag, it went from one setup to another, with no real release that would leave you feeling uneasy. \nThe priest didn't know Samara could cure blindness, so I guess he figured that by blinding himself he was safe from her. \nI assumed that this was Julia's day 7 (based on the fact that in this film, before Samara comes to kill you, you get a nosebleed [Skye and the plane guy both had this happen] and Julia got one right before she found the bones. This brings me to another gripe though in that I wish this film used the time cards like the first so you knew exactly where you were. Technically we have no idea how much time passes after Julia watches the tape and can only make inferences about it. \n",
            "author": "gingeguy22",
            "parent_id": "t1_ddb5v3r",
            "time": 1486380655.0,
            "id": "dddwhgr",
            "sentiment_score": 0.5034902908854528
        },
        {
            "score": 12,
            "body": "Nope.",
            "author": "Schlock_Supreme",
            "parent_id": "t1_dd9ky74",
            "time": 1486122743.0,
            "id": "dd9m6az",
            "sentiment_score": 0.9775135409466953
        },
        {
            "score": 8,
            "body": "Not that I saw",
            "author": "Vunks",
            "parent_id": "t1_dd9ky74",
            "time": 1486121243.0,
            "id": "dd9l3gy",
            "sentiment_score": 0.6671810039084085
        },
        {
            "score": 4,
            "body": "I was literally going to comment the same thing \n\nSadly, it looks like we're not seeing anything yet ",
            "author": "Bobb_Grayy",
            "parent_id": "t1_dd9ky74",
            "time": 1486124860.0,
            "id": "dd9nln2",
            "sentiment_score": -0.8198406197020767
        },
        {
            "score": 7,
            "body": "I'm so worried about his involvement in Star Trek: Discovery.",
            "author": "mi-16evil",
            "parent_id": "t1_dda0wm0",
            "time": 1486170927.0,
            "id": "ddac4qp",
            "sentiment_score": 0.2493949486382372
        },
        {
            "score": 4,
            "body": "Oh god, I just saw that he's writing The Dark Tower...",
            "author": "Monkey_Knife_Fight",
            "parent_id": "t1_dda0wm0",
            "time": 1486164766.0,
            "id": "dda6qsn",
            "sentiment_score": -0.5661171747073392
        },
        {
            "score": 1,
            "body": "[deleted]",
            "author": "None",
            "parent_id": "t1_dda0wm0",
            "time": 1486175260.0,
            "id": "ddag1u0",
            "sentiment_score": 0.5591971819884773
        },
        {
            "score": 4,
            "body": "There's a couple possible reasons why he was in the film.\n \n1. He makes 1 mil per episode of BBT, yes and I'm sure Paramount offered him more. So it was pretty much easy money for him.\n\n2. He pretty much does comedy so maybe he wanted to try something new.\n\n3. He wants to be involved in many projects to keep him from being typecast as the guy from the big bang theory.\n\nRegardless of his reasoning, how could he have know that the film was going to be this bad? I mean if I was in his position I would of taken the opportunity. The Ring was successful both financially and critically and the Japanese films are still highly successful. Everything may have looked good on paper but in the end it was the execution that wasn't good. ",
            "author": "mkmchale",
            "parent_id": "t1_ddbgx0x",
            "time": 1486433760.0,
            "id": "ddep8td",
            "sentiment_score": 0.2912509741555984
        },
        {
            "score": 2,
            "body": "He probably wanted something to do when they arent filming the show he does act in other stuff you know. ",
            "author": "mikeweasy",
            "parent_id": "t1_ddbgx0x",
            "time": 1486303687.0,
            "id": "ddcn747",
            "sentiment_score": 0.6719833967118047
        },
        {
            "score": 3,
            "body": "Amen to this post",
            "author": "Y0ungPup",
            "parent_id": "t1_ddbtc8l",
            "time": 1486281528.0,
            "id": "ddc8vzj",
            "sentiment_score": 0.03115633805511764
        },
        {
            "score": 7,
            "body": "They're pretty decent, but they're just 'there'. It's just a thing from the older films put in because it has to be put in.",
            "author": "RedofPaw",
            "parent_id": "t1_ddavq3g",
            "time": 1486195941.0,
            "id": "ddaxdmg",
            "sentiment_score": -0.9945555011537384
        },
        {
            "score": 9,
            "body": "Seriously? I always thought they were \"too much\". I liked more of the Japanese in this matter: simpler but creepier. ",
            "author": "sumofawitch",
            "parent_id": "t1_ddavq3g",
            "time": 1486204541.0,
            "id": "ddb39yw",
            "sentiment_score": -0.3771303558177661
        },
        {
            "score": 2,
            "body": "This movie would have been so much better if they had really run with the professor idea, and turned him into something like the doctor from Human Centipede, and he's using the tape to perform experiments on unwitting participants instead of volunteers.\n\nHe could be wearing creepy Aviators the whole movie, and then at the climax when the protagonists finally trick him into watching the tape, he starts laughing maniacally and pulls off the Aviators to reveal he'd blinded himself.  Which sounds ridiculous, but the whole movie would be ridiculous so it's okay",
            "author": "TerminallyCapriSun",
            "parent_id": "t1_ddjkuob",
            "time": 1486725842.0,
            "id": "ddk6c9a",
            "sentiment_score": 0.5030526401715258
        },
        {
            "score": 1,
            "body": "Describes my experience. I was interested pretty much the whole movie except maybe one or two slow parts, but that happens in even 10/10 movies to me. Not scary or disturbing in any way like the original kind of was. There's just something that connects you to The Ring and makes it feel real, like it could happen to you or something. This definitely just felt like a movie. \n\nAnd the last scene was just wtf.",
            "author": "naphthoylindole",
            "parent_id": "t1_dd9vhem",
            "time": 1486294226.0,
            "id": "ddchkgf",
            "sentiment_score": 0.09405326283533588
        },
        {
            "score": 6,
            "body": "Books? There's books? Link?",
            "author": "clwestbr",
            "parent_id": "t1_ddaxkbn",
            "time": 1486206435.0,
            "id": "ddb4imq",
            "sentiment_score": -0.39874515744809
        },
        {
            "score": 2,
            "body": "I heard that the third book goes even further, introducing simulations and whatnot.\n\nWould you recommend the other books? I've only read (well, listened to) the first one.",
            "author": "deh_tommy",
            "parent_id": "t1_ddaxkbn",
            "time": 1486246664.0,
            "id": "ddbkp6t",
            "sentiment_score": 0.26438875691182195
        },
        {
            "score": 1,
            "body": "WTF ",
            "author": "mikeweasy",
            "parent_id": "t1_ddaxkbn",
            "time": 1486303843.0,
            "id": "ddcn9xf",
            "sentiment_score": -0.7705966598446861
        },
        {
            "score": 1,
            "body": "Yes! No one in these discussions ever seems to mention the books, and they are some of my favorite novels, ever.",
            "author": "mooninitetwo",
            "parent_id": "t1_ddaxkbn",
            "time": 1486428316.0,
            "id": "ddekkmu",
            "sentiment_score": -0.9085588364328778
        },
        {
            "score": 2,
            "body": "Her line delivery was really bad. I was seriously starting to question if she just learned her lines prior to the scenes filmed or something.\nTurns out [she's apparently from Italy](http://www.imdb.com/name/nm4436761/) and [has a pretty noticeable accent](https://www.youtube.com/watch?v=2eQJzLQlRMI)",
            "author": "Greatest_Ever_III",
            "parent_id": "t1_ddh4mqn",
            "time": 1486705298.0,
            "id": "ddjqmsf",
            "sentiment_score": 0.21498493029064702
        },
        {
            "score": 14,
            "body": "The end is in the trailer. ",
            "author": "sumofawitch",
            "parent_id": "t1_ddax17b",
            "time": 1486204181.0,
            "id": "ddb31e0",
            "sentiment_score": -0.7821753247084753
        },
        {
            "score": 2,
            "body": "It's not 'terrible' as such, but it's not great. It feels like a remake of the 2nd one in some ways, although I forget that too, so who knows. \n\nIt's... fine, but doesn't do anything special or particuarly new. Nothing is exceptional. Plenty of the effects or editing choices are shakey. It's fine. It's serviceable. It's... mediocre at best, which may be praising it too much.",
            "author": "RedofPaw",
            "parent_id": "t1_ddax17b",
            "time": 1486195897.0,
            "id": "ddaxcjn",
            "sentiment_score": -0.3705664959131738
        },
        {
            "score": 2,
            "body": "It's not as bad as anyone on here makes it seem. Reddit just likes to think they're all professionals in whatever subreddit they're in, so here they all think they're expert movie critics whose word is final on everything.\n\nExplains the story of Samara fairly well. The acting isn't nearly as bad as anyone is claiming it is. Just not GREAT overall. 6-7/10 IMO. \n\nThe Ring 2 was just utter shit. Made NO fucking sense at all, shitty directing, horrible atmosphere. This movie is MUCH better than that, but worse by quite a bit than The Ring.",
            "author": "naphthoylindole",
            "parent_id": "t1_ddax17b",
            "time": 1486294017.0,
            "id": "ddchfoa",
            "sentiment_score": 0.08521810339917502
        },
        {
            "score": 1,
            "body": "Really, the worst part for me was that the main actress was incredibly wooden.  Her delivery in every scene was super flat and disinterested.  At the end they start talking about how she didn't fear Samara and I legitimately thought they were going to reveal she was emotionless and explain why she was so flat.   ",
            "author": "HalloweenBlues",
            "parent_id": "t1_ddax17b",
            "time": 1486311899.0,
            "id": "ddcql7i",
            "sentiment_score": 0.006826789078837603
        },
        {
            "score": 5,
            "body": "Since the first movie, she wants everyone to know her story. Why she needed a body to do that is unclear, since she showed the video on every screen in the plane and killed everyone before they had seven days to feel like she did on the well.",
            "author": "senhormouse",
            "parent_id": "t1_ddbefob",
            "time": 1486247751.0,
            "id": "ddblajq",
            "sentiment_score": 0.8369424631999276
        },
        {
            "score": 2,
            "body": "Its the rules. ",
            "author": "mikeweasy",
            "parent_id": "t1_ddbefob",
            "time": 1486303707.0,
            "id": "ddcn7ha",
            "sentiment_score": 0.5000868073635858
        },
        {
            "score": 3,
            "body": "A car crash... No idea if Samara was involved. I honestly don't think so.",
            "author": "topherthepest",
            "parent_id": "t1_dd9yufl",
            "time": 1486166612.0,
            "id": "dda8auw",
            "sentiment_score": -0.8202360568963682
        },
        {
            "score": 2,
            "body": "When he found a tape I could almost hear Sheldon sheldoning there",
            "author": "sumofawitch",
            "parent_id": "t1_dd9yufl",
            "time": 1486204418.0,
            "id": "ddb370l",
            "sentiment_score": 0.11430099264542792
        },
        {
            "score": 2,
            "body": "We went in with very low expectations, so that probably helped. The opening scene was bad but only for poor execution. They had the right idea with the plane setting.\n\nAfter that things got better, and I appreciated the \"video within a video\" aspect as I felt the original video has been done to death, there just wasn't much more story to get out of it. Definitely some plot holes going on but would also give it a 5/10.",
            "author": "shanthology",
            "parent_id": "t1_ddg2ext",
            "time": 1486531025.0,
            "id": "ddgjh0e",
            "sentiment_score": -0.12248736427513274
        },
        {
            "score": 3,
            "body": "It wasn't great but it wasn't One Missed Call or the Forest or whatever.\n\nI enjoyed it *shrug*",
            "author": "Nutmeg_Peach",
            "parent_id": "t1_dd9rri8",
            "time": 1486207510.0,
            "id": "ddb57kw",
            "sentiment_score": -0.09167950085415599
        },
        {
            "score": 16,
            "body": "Yes. Easier to Copy and send, haha.",
            "author": "topherthepest",
            "parent_id": "t1_ddah5hm",
            "time": 1486177515.0,
            "id": "ddai3ot",
            "sentiment_score": 0.18607371758254243
        },
        {
            "score": 24,
            "body": "TLDR, dead girl possessed main girl, sp00ky",
            "author": "TehAlpacalypse",
            "parent_id": "t1_dd9jm0r",
            "time": 1486119436.0,
            "id": "dd9js3d",
            "sentiment_score": 0.4375421583890162
        },
        {
            "score": 4,
            "body": "> the final scene was in the trailer\n\nSo stupid.\n\nGave away the scene the whole movie was building toward. ",
            "author": "bigpig1054",
            "parent_id": "t1_dd9nwr8",
            "time": 1486132193.0,
            "id": "dd9rsff",
            "sentiment_score": -0.9400863137288782
        },
        {
            "score": 16,
            "body": "It's the first scene. Some guy has seen the tape and is on the plane at the end of the seven days. The plane crashes because, I kid you not, Samara comes out of the pilots' monitors of all places. Two years later someone buys his VCR on a yardsale and the cursed tape is stuck inside.",
            "author": "JakkuScavenger",
            "parent_id": "t1_ddabt9u",
            "time": 1486171838.0,
            "id": "ddacy9t",
            "sentiment_score": -0.6926091854935765
        },
        {
            "score": 9,
            "body": "I think it was meant to be a reference to how the first Ring movie started, right? But because this is modern-day Hollywood, we need things to be bigger and more chaotic; hence, the airplane scene.",
            "author": "CatsLikeToMeow",
            "parent_id": "t1_ddabt9u",
            "time": 1486172547.0,
            "id": "ddadlcp",
            "sentiment_score": -0.2075648845522171
        },
        {
            "score": 4,
            "body": "It doesn't and no you can't really explain it. It's just a thing they put in because they thought it would be cool. It isn't and it ends with a really awful/hokey fx shot.",
            "author": "RedofPaw",
            "parent_id": "t1_ddabt9u",
            "time": 1486196129.0,
            "id": "ddaxihm",
            "sentiment_score": -0.4541258196773308
        },
        {
            "score": 2,
            "body": "Yes, thank god I didnt pay money for it. ",
            "author": "mikeweasy",
            "parent_id": "t1_ddcjh5z",
            "time": 1486303141.0,
            "id": "ddcmwlf",
            "sentiment_score": -0.6560311272520911
        },
        {
            "score": 3,
            "body": ">I honestly liked the premise of a university professor doing research in the video on test subjects\n\nYeah, a lot of stuff in this movie kinda reminds me of the Ring Books (a bit of sci-horror tint), but everything else fall real flat.  ",
            "author": "RamaAnthony",
            "parent_id": "t1_ddcpyvn",
            "time": 1486327029.0,
            "id": "ddcv45j",
            "sentiment_score": -0.421096819808932
        },
        {
            "score": 2,
            "body": "I could put up with the SERIOUSLY wooden, flat acting because the professor research stuff was legitimately a good premise. A semi-cult revolving around something that seemed to be a legit confirmation of the potential for life after death? That's a damn good idea.\n\nThen it got derailed in focus of the leads. Dear lord did that get bad fast.",
            "author": "rjjm88",
            "parent_id": "t1_ddcpyvn",
            "time": 1486441150.0,
            "id": "ddevnms",
            "sentiment_score": 0.04724722809691895
        },
        {
            "score": 7,
            "body": "yes, everyone at my screening kept laughing whenever they brought up the \"tail\" in conversation",
            "author": "anti_body",
            "parent_id": "t1_dd9peob",
            "time": 1486128564.0,
            "id": "dd9pvq8",
            "sentiment_score": 0.40602744084146924
        },
        {
            "score": 12,
            "body": "Not going to lie, this sounds brilliantly cheesy. Good luck with furthering your fan fic.",
            "author": "Cryp6",
            "parent_id": "t1_ddflkee",
            "time": 1486479094.0,
            "id": "ddfn2gm",
            "sentiment_score": -0.9068757303041517
        },
        {
            "score": 12,
            "body": "I haven't seen Rings yet - but, I'm all up for this sequel!",
            "author": "arpanganguli",
            "parent_id": "t1_ddflkee",
            "time": 1486497510.0,
            "id": "ddftevo",
            "sentiment_score": -0.9092035974257098
        },
        {
            "score": 3,
            "body": "Given the timeline of when this movie came out, you're probably right. ",
            "author": "Rosebunse",
            "parent_id": "t1_ddar6m6",
            "time": 1486205671.0,
            "id": "ddb40ke",
            "sentiment_score": 0.9740678660309972
        },
        {
            "score": 1,
            "body": "This was actually a (very misguided) attempt by Paramount to kick start a new yearly franchise. The previous head of distribution (he was fired in October after Paramount took that 120 mil write-down for Monster Trucks) said that he wanted Rings to be the next Paranormal Activity with a movie releasing around Halloween every year.  ",
            "author": "gingeguy22",
            "parent_id": "t1_ddar6m6",
            "time": 1486381799.0,
            "id": "dddxgts",
            "sentiment_score": -0.5093588019265605
        },
        {
            "score": 3,
            "body": "[Fuck you, it's... February?](https://www.youtube.com/watch?v=2uh2YSqsFU0)",
            "author": "r0wo1",
            "parent_id": "t1_dd9ras1",
            "time": 1486135226.0,
            "id": "dd9t51j",
            "sentiment_score": -0.11510717477424581
        },
        {
            "score": 8,
            "body": "You've sold it to me!",
            "author": "BrassBallsComedy",
            "parent_id": "t1_ddcniex",
            "time": 1486335679.0,
            "id": "ddcyuqb",
            "sentiment_score": -0.6466531558863808
        },
        {
            "score": 3,
            "body": "I thought of that as well, which puts me on a different tangent; if the terminal ill person watched the video, then dies of natural causes before 7 days, would the curse die with them, or return to the person who showed them the video?",
            "author": "miller94",
            "parent_id": "t1_ddf3jfo",
            "time": 1486566952.0,
            "id": "ddh91x3",
            "sentiment_score": -0.1170765443590398
        },
        {
            "score": 4,
            "body": "I think they were in the car when Julia says \"she survived in the well for seven days...they found her body years later.\" I assumed this was referencing the first movie when Rachel finds her. Then her body was taken to Sacrament Valley.",
            "author": "carolinemathildes",
            "parent_id": "t1_ddhhd58",
            "time": 1486643616.0,
            "id": "ddiovf1",
            "sentiment_score": -0.8003605422717885
        },
        {
            "score": 3,
            "body": "Fuck you, it's February!",
            "author": "L_A_S_A_G_N_A",
            "parent_id": "t1_dddbpf6",
            "time": 1486440252.0,
            "id": "ddeuvez",
            "sentiment_score": 0.12189521105575363
        },
        {
            "score": 3,
            "body": "Just (regretfully) finished watching it an hour ago.\n\nThe cold opening (I'm assuming you are talking about the plane) was just a way to setup the origin of the tape that the professor got his hands on. It was the same VHS that the guy on plane had watched. I don't think it had any other point than to set up that small bit of back story and maybe say \"hey, look what she can do now!\" or something like that.",
            "author": "minagi",
            "parent_id": "t1_ddel86c",
            "time": 1486452875.0,
            "id": "ddf5br0",
            "sentiment_score": -0.3884668565875298
        },
        {
            "score": 2,
            "body": "I believe in test screenings one screening had just the plane scene and the other started with Gabriel and Skye buying the VCR. I guess the decided to mash them both together and add in some dialogue to make it fit. ",
            "author": "gingeguy22",
            "parent_id": "t1_ddel86c",
            "time": 1486526316.0,
            "id": "ddgf81i",
            "sentiment_score": -0.847568128530914
        },
        {
            "score": 1,
            "body": " The head of marketing and distribution at Paramount said \"time will tell\" when asked about a sequel. The total cost of the movie (with just U.S. P&A included) was 45-50 mil. So far, the movie has only made 28.2 million both in the US and in international markets (without the Sunday totals included). ",
            "author": "gingeguy22",
            "parent_id": "t1_ddd7asa",
            "time": 1486378579.0,
            "id": "dddunh7",
            "sentiment_score": 0.68682563331919
        },
        {
            "score": 2,
            "body": "Ever seen the Japanese version?\n\nKinda different, much more stylised, but I love it.",
            "author": "ChickenInASuit",
            "parent_id": "t1_ddimip5",
            "time": 1486649266.0,
            "id": "ddis27g",
            "sentiment_score": -0.37886585634466563
        },
        {
            "score": 2,
            "body": "Legitimate question, but how have the sequels ruined these movies for you? Unless they retconned something to drastically change the meaning of the original, couldn't you just ignore them?\n\nThe same question for people who say adaptations of comics, board games, etc ruin the source material.  \n\nFor instance there were tons of people upset about the female Ghostbusters before it even came out, claiming it was stupid and ruined the original Ghostbusters.\n\nDon't get me wrong, I'm a huge pop culture junkie, but I've never been so deeply attached to any form of media that an ill conceived sequel or reboot could completely ruin the previously established versions.",
            "author": "rdanks25",
            "parent_id": "t1_ddizvij",
            "time": 1486690155.0,
            "id": "ddjdazz",
            "sentiment_score": -0.3307944851569222
        },
        {
            "score": 2,
            "body": "let your kids see this, and they will definitely shut up for at least a week",
            "author": "gDisasters",
            "parent_id": "t1_ddfq4ig",
            "time": 1486619586.0,
            "id": "ddi6u43",
            "sentiment_score": -0.40548854078495533
        },
        {
            "score": 2,
            "body": "I get scared really easily with cheap jump scares. I didn't get scared once. This movie was pretty bad. 4/10",
            "author": "SACKO_",
            "parent_id": "t1_dd9m0lt",
            "time": 1486128993.0,
            "id": "dd9q4k1",
            "sentiment_score": -0.5059634517806437
        },
        {
            "score": 3,
            "body": "She referred to him as a demon, yes, but she's batshit insane and could have been speaking metaphorically.\n\nThe better question is how she got from under the church to giving birth in a hospital.",
            "author": "scarlet_twitch",
            "parent_id": "t1_ddc34lu",
            "time": 1486653473.0,
            "id": "dditxy4",
            "sentiment_score": 0.8482428029146316
        },
        {
            "score": 2,
            "body": "[Samara's father is a \"Sea Demon\" or \"Ocean Entity\"](#spoiler) \n\n[Pretty sure in Rings 2 she flat out says that her father is a Sea Demon.](#spoiler) \n\n-\n\n[The writers making it like the priest was her father is just bad writing and not respecting the original property. If you go on the Ring wikia, it says that even though Eveline is mentally unstable, she doesn't have any powers, so her saying the father is a sea demon makes sense because Samara does have powers. With the priest being the father, I guess you could say \"Oh he did some kind of demon stuff and summoned a demon\" or whatever, but that's unnecessary because Rings 2 already said her father was a sea demon, and I don't think anybody had a problem with that. I like a lot of bad movies (The Gallows, Annabelle, PA spinoff), but this movie was unwatchable. At one point, I turned to my brother and said \"What is this movie?\"](#spoiler) ",
            "author": "Y0ungPup",
            "parent_id": "t1_ddc34lu",
            "time": 1486281392.0,
            "id": "ddc8srh",
            "sentiment_score": 0.5658214152619405
        },
        {
            "score": 3,
            "body": ">people are definitely over exaggerating how bad it is.\n\nI totally agree. It wasn't *the worst* horror movie I've ever seen, but it's certainly not the best. I'm always going to be partial to the original *The Ring*, but it was a thoughtless popcorn muncher that was entertaining.",
            "author": "kirb87",
            "parent_id": "t1_ddh90vc",
            "time": 1486648338.0,
            "id": "ddirlcx",
            "sentiment_score": -0.5752172335377181
        },
        {
            "score": 3,
            "body": "The Ring 2 isn't a good movie, but it still has some pretty creepy imagery, especially if you're new to horror movies.  The thing about horror films is that we inoculate ourselves to that horror each time we watch it.  Kind of like telling the same joke over and over (and so too with the genre in general - all horror is slightly less scary for each movie you watch, just like ones taste in comedy gets pickier the more comedies you watch).  \n\nBut because of that, the reverse is also true - if you're new to horror movies, even a bad one will be effective if it's at least vaguely competent.  This is why horror fans appear to have such a broad embrace when it comes to quality",
            "author": "TerminallyCapriSun",
            "parent_id": "t1_ddihmrk",
            "time": 1486726234.0,
            "id": "ddk6m5b",
            "sentiment_score": -0.017962744578379874
        },
        {
            "score": 9,
            "body": "There was some jump scares in the first film. They were slow burners but they were there. I don't know why jump scare is a bad word now. Yes they can be cheap (end of every horror trailer), but they can also be fun (Final Destination), or truly scary (breast feeding scene in The VVitch A New-England Folktale).",
            "author": "stevenglansbergalone",
            "parent_id": "t1_dda02s0",
            "time": 1486166289.0,
            "id": "dda80uz",
            "sentiment_score": -0.519415652484561
        },
        {
            "score": 3,
            "body": "Johnny Galecki and Vincent D'Onofrio are both huge actors that make tons of money. ",
            "author": "zrox456",
            "parent_id": "t1_dda02s0",
            "time": 1486161093.0,
            "id": "dda3xcu",
            "sentiment_score": 0.2766154718026719
        },
        {
            "score": 2,
            "body": "Granted the movie probably is awful, but the sample size isn't large considering the zero percent is only based on 5 reviews.",
            "author": "CrashRiot",
            "parent_id": "t1_dda02s0",
            "time": 1486158069.0,
            "id": "dda1xyy",
            "sentiment_score": -0.9571611697031783
        },
        {
            "score": 2,
            "body": "Johnny galecki as the professor is the only thing mildly interesting in this film, and he isn't shown nearly enough and dies too soon. That ring club was fascinating and where the film should have gone.  Instead, we got an amalgamation of horror films /tropes with boring pacing, editing, tone, direction, acting, and writing.  At times it felt more like a final destination movie than a ring movie and then floated into don't breathe territory and probably 6-7 other films.  The Film became very predictable towards the end and then just felt very rushed, not that I could take much more of it.  4/10 at best (and I'm probably being generous and giving it an extra point because bye bye man was just so bad already this year) ",
            "author": "Hiccup",
            "parent_id": "t1_dd9qyv0",
            "time": 1486150724.0,
            "id": "dd9yit8",
            "sentiment_score": -0.5545689046626494
        },
        {
            "score": 2,
            "body": "What was the point of her staying behind at home because of her sick mother that plot was thrown out 10 minutes into the film.",
            "author": "Vunks",
            "parent_id": "t1_dd9qyv0",
            "time": 1486189903.0,
            "id": "ddasvon",
            "sentiment_score": 0.02528962433159987
        },
        {
            "score": 3,
            "body": "The bonus content was specifically shown to Julia to lure her to find her remains. Skye states to Gabriel that Samara was not happy with how the 7s were treating the video, and Julia happened to come along, someone who was not a part of the experiment, and Samara saw that as an opportunity. ",
            "author": "ndrw17",
            "parent_id": "t1_ddb99qd",
            "time": 1486215918.0,
            "id": "ddb9x2i",
            "sentiment_score": -0.16390570460600817
        },
        {
            "score": 3,
            "body": "Fun fact: the books that the films are based on are actually Sci-Fi Thrillers that take place in some sort of Matrix-esque world, and the Ring virus is an actual, biological virus (if I remember correctly, you contract a tumor that will kill you in seven days that goes into remission by copying and spreading said tape).",
            "author": "deh_tommy",
            "parent_id": "t1_ddb99qd",
            "time": 1486246526.0,
            "id": "ddbkmif",
            "sentiment_score": -0.21418404799229962
        },
        {
            "score": 3,
            "body": "You know the sad thing is that the short film of the same name, *Rings*, is actually way better than either this or the second film. We rented it back in the day and discovered it on the dvd to our delight, it was awesome. So sad that this sucked so much. I figured it would but...you hold out hope, you know?",
            "author": "clwestbr",
            "parent_id": "t1_ddeqlnn",
            "time": 1486464930.0,
            "id": "ddfekra",
            "sentiment_score": -0.8032779099613179
        },
        {
            "score": 3,
            "body": "Some classic horror films that you should try to watch are *The Thing* and *Rosemary's Baby*. I've seen both recently and can't recommend them enough.",
            "author": "Greatest_Ever_III",
            "parent_id": "t1_dditjiy",
            "time": 1486704986.0,
            "id": "ddjqd7l",
            "sentiment_score": 0.8290321389227244
        },
        {
            "score": 3,
            "body": "Have you seen the Witch?",
            "author": "Magnumnumnum",
            "parent_id": "t1_dditjiy",
            "time": 1486692342.0,
            "id": "ddjf95e",
            "sentiment_score": -0.1900893931907781
        },
        {
            "score": 2,
            "body": "The Taking of Deborah Logan is one of the best ones I've seen in a while.",
            "author": "pozzy119",
            "parent_id": "t1_dditjiy",
            "time": 1486655052.0,
            "id": "ddiukbm",
            "sentiment_score": -0.295018353937323
        },
        {
            "score": 3,
            "body": ">That movie was MUCH better than The Ring 2\n\n\n\nTo be fair, almost every movie is better than The Ring 2.",
            "author": "jtyti15",
            "parent_id": "t1_ddch1ib",
            "time": 1486320121.0,
            "id": "ddct3c2",
            "sentiment_score": 0.3333556641061364
        },
        {
            "score": 2,
            "body": "The only thing that really bothered me was the plane scene, other than that I thought that the movie was okay (not really good, but as not bad as everyone here makes the film out to be).",
            "author": "deh_tommy",
            "parent_id": "t1_ddch1ib",
            "time": 1486323657.0,
            "id": "ddcu3m0",
            "sentiment_score": -0.9542597537639832
        },
        {
            "score": 2,
            "body": "Eh, the end isn't necessarily supposed to be \"tied up\". She's reborn. The world goes to hell in whatever way you'd like to imagine, etc. I don't think there will be a sequel because it would ruin the mystique and would just be cringe and completely pointless in relation to what the story is actually about.\n\nI do expect a prequel, though, that ties in how Samara's mom went from being captured to giving birth in a hospital.",
            "author": "scarlet_twitch",
            "parent_id": "t1_ddch1ib",
            "time": 1486653337.0,
            "id": "dditvxl",
            "sentiment_score": -0.4717726941581184
        },
        {
            "score": 3,
            "body": "Samaras goal of being reborn was established in the Ring Two. She attempted to possess children, including Aiden. \n\nAs that didn't work, having her remains destroyed would allow her to physically be reborn within someone (Julia). They explain that's why the Priest hid the remains, so that he could stop the other people (he states twelve other people had already come looking) from inadvertently bringing her back to life. ",
            "author": "ndrw17",
            "parent_id": "t1_ddb9dhl",
            "time": 1486215727.0,
            "id": "ddb9ttn",
            "sentiment_score": 0.8980015545682425
        },
        {
            "score": 4,
            "body": "If you think this was a better movie than Suicide Squad, wow. I'm not saying Suicide Squad is great but this movie was absolute gutter trash.",
            "author": "punishedven0msnake",
            "parent_id": "t1_ddb9dhl",
            "time": 1486215160.0,
            "id": "ddb9k3x",
            "sentiment_score": -0.6213929162245535
        },
        {
            "score": 3,
            "body": "At the end of The Ring, Rachel finds Samara's body at the bottom of the well. In this one it's explained that the island she lived on refused to accept the remains, this is when her birth father (the priest) stepped in and took the remains and interred them in a crypt. However after a flood at the graveyard that the priest blamed on the earth rejecting her body, and the fact that she was showing him hallucinations (this is why he blinded himself), he took the bones from the grave and put them behind the wall in his basement. \nShe wanted rebirth so she had more power. I guess as a ghost her powers were more limited. ",
            "author": "gingeguy22",
            "parent_id": "t1_dddwonr",
            "time": 1486382381.0,
            "id": "dddxwtw",
            "sentiment_score": 0.6867357878842539
        },
        {
            "score": 2,
            "body": "That wouldn't even be possible at the theatre chain I work at. Are you sure they didn't charge you?",
            "author": "carolinemathildes",
            "parent_id": "t1_ddetr28",
            "time": 1486447556.0,
            "id": "ddf14i2",
            "sentiment_score": -0.6129164869503969
        },
        {
            "score": 3,
            "body": "What other horror films has he been in besides Sinister? Because I thought that one was quite good.",
            "author": "BuggsBee",
            "parent_id": "t1_dd9yo9p",
            "time": 1486372724.0,
            "id": "dddpvds",
            "sentiment_score": -0.9178571035250196
        },
        {
            "score": 8,
            "body": "I think he meant he can't see the tape, so she can't kill him.",
            "author": "Y0ungPup",
            "parent_id": "t1_ddb1unv",
            "time": 1486281824.0,
            "id": "ddc936i",
            "sentiment_score": 0.6796441006994396
        },
        {
            "score": 11,
            "body": "She gave him his eyesight back just to kill him.",
            "author": "Cheeseburguh",
            "parent_id": "t1_ddbmgn1",
            "time": 1486251614.0,
            "id": "ddbnjz3",
            "sentiment_score": 0.13987336294225017
        },
        {
            "score": 32,
            "body": "wait, i don't remember any scary parts. \nbtw: that hottie that called the jock's girlfriend was so hot.",
            "author": "anti_body",
            "parent_id": "t1_dd9n075",
            "time": 1486129281.0,
            "id": "dd9qaee",
            "sentiment_score": -0.7209484331422142
        },
        {
            "score": 1,
            "body": "Did you happen to catch the thread about those James Cameron pitched Aliens?",
            "author": "kellenthehun",
            "parent_id": "t1_dd9r93q",
            "time": 1486192551.0,
            "id": "ddauwqf",
            "sentiment_score": -0.4316817205957242
        },
        {
            "score": 14,
            "body": "Ya i agree but I'd rather watch a train wreck than boring uninspired dribble. At least the train wreck is entertainingly awful, full disclosure I haven't seen rings that's just how I feel about bad movies in general",
            "author": "Mexican_Nutsack",
            "parent_id": "t1_dd9y32i",
            "time": 1486171759.0,
            "id": "ddacvra",
            "sentiment_score": -0.68021723863588
        },
        {
            "score": 1,
            "body": "I think it's just a matter of opinion in the end, but a horror movie that is not scary in the least is part of my definition of incompetent. ",
            "author": "chicagoredditer1",
            "parent_id": "t1_dd9y32i",
            "time": 1486261106.0,
            "id": "ddbucz4",
            "sentiment_score": -0.730854403281685
        },
        {
            "score": 34,
            "body": "Holy shit, there's a Ring vs The Grudge movie? ",
            "author": "eojen",
            "parent_id": "t1_dd9jwvk",
            "time": 1486166300.0,
            "id": "dda816s",
            "sentiment_score": 0.4681134744438844
        },
        {
            "score": 23,
            "body": "1. Spend modest amount of money on film.  \n2. Spend larger amount on social media marketing to high school kids with disposable income.   \n3. Recoup production costs opening weekend, move on with your life. ",
            "author": "nolcat",
            "parent_id": "t1_ddadd46",
            "time": 1486219732.0,
            "id": "ddbbnad",
            "sentiment_score": -0.08522321902499486
        },
        {
            "score": 5,
            "body": "I don't think it was meant to, which is why they delayed it 3 times.",
            "author": "Y0ungPup",
            "parent_id": "t1_ddadd46",
            "time": 1486282069.0,
            "id": "ddc99b5",
            "sentiment_score": -0.07240155093998779
        },
        {
            "score": 33,
            "body": "I also like reading horror movies. Not a big fan of watching them generally because, for me, either they are good and therefore scary and unpleasant to watch (and then keep me up at night), or they are bad and a waste of time to watch.",
            "author": "blazeofgloreee",
            "parent_id": "t1_ddaahza",
            "time": 1486178076.0,
            "id": "ddaim0p",
            "sentiment_score": -0.19387591003650817
        },
        {
            "score": 61,
            "body": "You know what's sad? The idea that she'd have to solve the mystery on her own and save herself is kind of interesting and if executed well, could have made for a compelling movie. ",
            "author": "IAmMrMiracle",
            "parent_id": "t1_dda50rn",
            "time": 1486165971.0,
            "id": "dda7r1b",
            "sentiment_score": -0.8472291694080036
        },
        {
            "score": 10,
            "body": "They just had to, somehow, put something inside a wall.",
            "author": "ozzyfox",
            "parent_id": "t1_dda50rn",
            "time": 1486185007.0,
            "id": "ddaot1r",
            "sentiment_score": 0.9000978534608948
        },
        {
            "score": 1,
            "body": "Thanks!! Perfect summary!",
            "author": "bustedbeatbox",
            "parent_id": "t1_dda50rn",
            "time": 1486165751.0,
            "id": "dda7kau",
            "sentiment_score": -0.42664321972926667
        },
        {
            "score": 6,
            "body": "The real question is why Samara randomly chosen to communicate in Brail. ",
            "author": "ndrw17",
            "parent_id": "t1_ddb310u",
            "time": 1486210033.0,
            "id": "ddb6rsm",
            "sentiment_score": -0.32281495458026277
        },
        {
            "score": 58,
            "body": "I think jump scares are most effective when they're used to kickstart a horror sequence. For example The Conjuring 2 uses this method numerous times (the nun coming out of the mirror that follows with Lorraine's vision, the man in the water that follows with the girl's possession etc) and it works because the following scene rides on the tension generated by the 'jump'. \n\nOn the other hand, a jump scare would feel shitty if it's just a fake out (hand on the shoulder - turns out it's just her boyfriend) cos then the tension dissipates and the whole scare feels cheap due to the lack of payoff. ",
            "author": "chancehugs",
            "parent_id": "t1_dd9kcec",
            "time": 1486145506.0,
            "id": "dd9ws7h",
            "sentiment_score": 0.2529260784188443
        },
        {
            "score": 7,
            "body": "The Witch was a little too slow burn for me but I can at least I appreciate what they set out to do  and goddamn did they pull it off ",
            "author": "xjayroox",
            "parent_id": "t1_dd9kcec",
            "time": 1486165177.0,
            "id": "dda72zb",
            "sentiment_score": 0.7347558389562212
        },
        {
            "score": 7,
            "body": "make SURE you don't watch the shitty remake that just came out. Make sure you watch the French version",
            "author": "poland626",
            "parent_id": "t1_ddaouv3",
            "time": 1486187484.0,
            "id": "ddaqwgn",
            "sentiment_score": -0.7990639493719047
        },
        {
            "score": 2,
            "body": "Martrys fucked me up for a while.  Don't watch this on a comedown...",
            "author": "lurkerer",
            "parent_id": "t1_ddaouv3",
            "time": 1486196471.0,
            "id": "ddaxr8w",
            "sentiment_score": -0.5025371012645303
        },
        {
            "score": 1,
            "body": "I've seen Martyrs twice, and that's enough for me. I'll never watch it again, but it's one of the best ever.",
            "author": "OceanCyclone",
            "parent_id": "t1_ddaouv3",
            "time": 1486191764.0,
            "id": "ddaubls",
            "sentiment_score": 0.23898961733482316
        },
        {
            "score": 1,
            "body": "Just a warning, Martyrs is pretty full on. I hated it's gratuity but make your own mind of course!",
            "author": "falkous",
            "parent_id": "t1_ddaouv3",
            "time": 1486227649.0,
            "id": "ddbedu8",
            "sentiment_score": 0.33995800598951664
        },
        {
            "score": 1,
            "body": "If it were easy everyone would do it.",
            "author": "Morbidius",
            "parent_id": "t1_dd9m1x5",
            "time": 1486177189.0,
            "id": "ddaht5a",
            "sentiment_score": -0.4404009515258309
        },
        {
            "score": 5,
            "body": "THIS IS WHAT I WAS SAYING!\n\nThe whole time I was thinking this, and one time I leaned over to my girlfriend and said, \"This movie has the dialogue of a shitty video game\".  Not saying that RE is shitty but still.",
            "author": "ScorpyOwns",
            "parent_id": "t1_ddcqmum",
            "time": 1486515079.0,
            "id": "ddg4z90",
            "sentiment_score": -0.8909052261961963
        },
        {
            "score": 22,
            "body": "ENDLESS TRASH!!! Still looking forward to The Inside starting Brian Cox as Red Herring.",
            "author": "TotallyJawsome2",
            "parent_id": "t1_ddaigcx",
            "time": 1486178441.0,
            "id": "ddaixu5",
            "sentiment_score": 0.12825844993472812
        },
        {
            "score": 1,
            "body": "*February now. ",
            "author": "Digitalstardust",
            "parent_id": "t1_ddaigcx",
            "time": 1486254867.0,
            "id": "ddbprcy",
            "sentiment_score": 0.6721293512098034
        },
        {
            "score": 20,
            "body": "[ENDLESS TRASH!](https://www.youtube.com/watch?v=Ut5sk0RUlS4)",
            "author": "1ronspider",
            "parent_id": "t1_dda9iwx",
            "time": 1486169496.0,
            "id": "ddaaue7",
            "sentiment_score": -0.523839739132854
        },
        {
            "score": 3,
            "body": "A very enjoyable 3/10.",
            "author": "GusFringus",
            "parent_id": "t1_ddae9ni",
            "time": 1486253101.0,
            "id": "ddbojg8",
            "sentiment_score": 0.02955464744239089
        },
        {
            "score": 45,
            "body": "The real killer is that you die of boredom in ~~142~~ 102 minutes.\n\nEdit: The boredom kills you faster than I though.",
            "author": "sh1ft",
            "parent_id": "t1_dd9rlgx",
            "time": 1486173735.0,
            "id": "ddaenz3",
            "sentiment_score": -0.38591643301401435
        },
        {
            "score": 11,
            "body": "The Visit was a great horror comedy. The Witch was one of my favorites of 2016. ",
            "author": "eojen",
            "parent_id": "t1_dd9q8qt",
            "time": 1486166498.0,
            "id": "dda87ce",
            "sentiment_score": -0.26363670590242405
        },
        {
            "score": 33,
            "body": "It Follows was great.\n\nWe also had Don't Breathe. ",
            "author": "StrangeSemiticLatin2",
            "parent_id": "t1_dd9q8qt",
            "time": 1486141822.0,
            "id": "dd9vl4w",
            "sentiment_score": 0.42558748643665867
        },
        {
            "score": 3,
            "body": "If you are open to foreign films (with subtitles) try The Wailing (2016)",
            "author": "SeekerP",
            "parent_id": "t1_dd9q8qt",
            "time": 1486152674.0,
            "id": "dd9z9vx",
            "sentiment_score": -0.8472443223051571
        },
        {
            "score": 4,
            "body": "Going back a bit further, I thought Oculus was decent",
            "author": "gtpm28",
            "parent_id": "t1_dd9q8qt",
            "time": 1486170277.0,
            "id": "ddabjy8",
            "sentiment_score": 0.05415109932157036
        },
        {
            "score": 2,
            "body": "10 Cloverfield Lane isn't really a horror movie though, it's a thriller. I would argue that thrillers are becoming the new \"good horror movie,\" since we have 10CL, Don't Breathe and the recent Split movie now as great representations of the genre in recent years.",
            "author": "FalcoVet101",
            "parent_id": "t1_dd9q8qt",
            "time": 1486225913.0,
            "id": "ddbdugg",
            "sentiment_score": -0.14797928785844827
        },
        {
            "score": 24,
            "body": "The acting in Bye Bye Man was so disgustingly bad. I honestly feel like a high school drama class could put on a better performance. But I'm going to see Rings tonight so I'll let you know if it's even worse lol.\n\nEdit: it was.",
            "author": "Zeyz",
            "parent_id": "t1_dda36yl",
            "time": 1486191660.0,
            "id": "ddau8sc",
            "sentiment_score": 0.9237397578538933
        },
        {
            "score": 3,
            "body": "Bye Bye Man was way more fun (and a hell of a lot shorter too). ",
            "author": "Schlock_Supreme",
            "parent_id": "t1_dda36yl",
            "time": 1486193551.0,
            "id": "ddavnj5",
            "sentiment_score": -0.4867202933520851
        },
        {
            "score": 5,
            "body": "Thanks! I'll check it out.",
            "author": "JacobCrim88",
            "parent_id": "t1_dda3ud7",
            "time": 1486161194.0,
            "id": "dda3zzd",
            "sentiment_score": -0.21694935465054455
        },
        {
            "score": 1,
            "body": "Dark Water was very faithful to the original movie.",
            "author": "JakkuScavenger",
            "parent_id": "t1_ddaa9tg",
            "time": 1486173239.0,
            "id": "ddae7ud",
            "sentiment_score": -0.6093981244963342
        },
        {
            "score": 2,
            "body": "It was a great anime.",
            "author": "maradagian",
            "parent_id": "t1_ddac3ts",
            "time": 1486172190.0,
            "id": "ddad9m4",
            "sentiment_score": 0.8384833278299315
        },
        {
            "score": 1,
            "body": "But is it worse than this disgusting blatant cash grab of movie? No.",
            "author": "Basketsky",
            "parent_id": "t1_ddac3ts",
            "time": 1486171305.0,
            "id": "ddach06",
            "sentiment_score": 0.5193486801703215
        },
        {
            "score": 6,
            "body": "It was hilariously bad at points",
            "author": "TehAlpacalypse",
            "parent_id": "t1_dd9jshi",
            "time": 1486119568.0,
            "id": "dd9jvi6",
            "sentiment_score": 0.4698721130993111
        },
        {
            "score": 4,
            "body": "It wasn't a sex dungeon... more like a nightclub filled with a weird Samara Morgan hipster fan club. It was supposed to be a select few who were being studied, but it felt sooo weird.",
            "author": "topherthepest",
            "parent_id": "t1_dd9mplt",
            "time": 1486126479.0,
            "id": "dd9omtr",
            "sentiment_score": 0.17553424764188486
        },
        {
            "score": 10,
            "body": "That's incorrect. The film references both the Ring and the Ring Two. Samaras mother's name was established listed as Evelyn in the Ring Two, which was the same in this film, not to mention the scene where Julia is in the car flipping through Gabriel's clippings which show the pictures that Rachel finds in the basement in the Ring Two. \n\nThe events of The Ring are also shown on the wall of clippings in Gabriel's apartment, some which state that a body was found under a cabin at Shelter Mountain Inn and the body was being sent to be buried. \n\nThey also had the comment in the beginning where the man says a chick from Seattle gave him the tape, which is where the original took place. ",
            "author": "ndrw17",
            "parent_id": "t1_ddan6bv",
            "time": 1486209400.0,
            "id": "ddb6e3f",
            "sentiment_score": 0.04024541403020776
        },
        {
            "score": 1,
            "body": "The Ring 2 is an incoherent mess that barely feels like it is in the same universe as the first. This franchise has been horrible at maintaining any sort of coherence.\n\n",
            "author": "NeoNoireWerewolf",
            "parent_id": "t1_ddbcrkq",
            "time": 1486225299.0,
            "id": "ddbdnhc",
            "sentiment_score": 0.3551282647214806
        },
        {
            "score": 2,
            "body": "You'd be in for a much better cinematic experience watching the AMC TV Series Breaking Bad at home on your couch compared to this \"movie\" released internationally in many theaters. ",
            "author": "PNWRoamer",
            "parent_id": "t1_ddf03js",
            "time": 1486459520.0,
            "id": "ddfabk4",
            "sentiment_score": -0.2848124954804332
        },
        {
            "score": 1,
            "body": "Did Samara ever leave behind casualties or collateral damage, though? I thought she just haunted those that were cursed.",
            "author": "deh_tommy",
            "parent_id": "t1_dddvb0l",
            "time": 1486383708.0,
            "id": "dddyvfs",
            "sentiment_score": 0.3939892406461727
        },
        {
            "score": 2,
            "body": "Did they actually come out from the screen?",
            "author": "deh_tommy",
            "parent_id": "t1_ddb58l5",
            "time": 1486246804.0,
            "id": "ddbkrts",
            "sentiment_score": -0.43254967506934916
        },
        {
            "score": 1,
            "body": "I know early rumors suggested we were getting a prequel to The Ring because originally The Ring Two was going to be part prequel/part sequel but Dreamworks execs made Ehren Kruger pull out all the prequel stuff during development so that they could milk the cash cow and make the second film a pure sequel and the third film a prequel (this is the reason Daveigh Chase and the original director of The Ring Two dropped out). However when The Ring Two failed critically they didn't want to risk a third film and it was shelved. When talks started up again about a third film everyone assumed they were going with the prequel idea until the director stated that it was a sequel.",
            "author": "gingeguy22",
            "parent_id": "t1_ddcqu7z",
            "time": 1486379049.0,
            "id": "dddv24s",
            "sentiment_score": 0.4206362959169152
        },
        {
            "score": 1,
            "body": "Hire me. I'd do it for $20k and the ideas I have would be SO much more appealing to The Ring fans. Boom - just saved millions of dollars.",
            "author": "Ser_Humpsalot",
            "parent_id": "t1_ddchbti",
            "time": 1486402632.0,
            "id": "dde7iqm",
            "sentiment_score": -0.5013352353035774
        },
        {
            "score": 6,
            "body": "Lol I saw it this morning and sat in the lobby and typed it afterwards while the thoughts were still fresh. Just saved it to post later (also posted on IMDB). ",
            "author": "ndrw17",
            "parent_id": "t1_ddb8432",
            "time": 1486213409.0,
            "id": "ddb8nx1",
            "sentiment_score": 0.525481622888095
        },
        {
            "score": 6,
            "body": "Thanks",
            "author": "Czechmix",
            "parent_id": "t1_dd9l3gy",
            "time": 1486122246.0,
            "id": "dd9ltqi",
            "sentiment_score": -0.4480956092749966
        },
        {
            "score": 4,
            "body": "He won an Oscar for writing A Beautiful Mind",
            "author": "Spidey10",
            "parent_id": "t1_dda6qsn",
            "time": 1486165902.0,
            "id": "dda7ov7",
            "sentiment_score": -0.29761478378775585
        },
        {
            "score": 2,
            "body": "Apparently the director - Nikolaj Arcel rewrote the Akiva Goldsman draft. He's notable for being the writer behind the original Swedish adaptation of The Girl with the Dragon Tattoo.",
            "author": "JakkuScavenger",
            "parent_id": "t1_dda6qsn",
            "time": 1486173663.0,
            "id": "ddaelnq",
            "sentiment_score": -0.49328931337040727
        },
        {
            "score": 1,
            "body": "I mean he did win an Oscar. That gets you far in the world even with such a shit track record.",
            "author": "mi-16evil",
            "parent_id": "t1_ddag1u0",
            "time": 1486181366.0,
            "id": "ddallje",
            "sentiment_score": 0.43727699107172935
        },
        {
            "score": 3,
            "body": "None of them was as well done as the opening sequence in the first one?",
            "author": "Krettlecorn13",
            "parent_id": "t1_ddaxdmg",
            "time": 1486196056.0,
            "id": "ddaxgmt",
            "sentiment_score": 0.46942192282208617
        },
        {
            "score": 9,
            "body": "The way it was done in the first was great imo. The whole \"I found her in the closet\" scene was perfectly set up. It was a nice change from the Japanese original. I've had nightmares about finding someone I know with a face distorted like that. But to each their own. I can see where you're coming from.",
            "author": "Krettlecorn13",
            "parent_id": "t1_ddb39yw",
            "time": 1486205705.0,
            "id": "ddb41ei",
            "sentiment_score": 0.42098126468881314
        },
        {
            "score": 2,
            "body": "> he's using the tape to perform experiments on unwitting participants instead of volunteers.\n\nThis sounds amazing and way better than Rings. ",
            "author": "warsage",
            "parent_id": "t1_ddk6c9a",
            "time": 1486778719.0,
            "id": "ddkyzos",
            "sentiment_score": -0.34803241485858516
        },
        {
            "score": 8,
            "body": "The original book is part of a trilogy. Ring, Spiral and Loop by Koji Suzuki. There's a manga too.",
            "author": "DiogenesTheHound",
            "parent_id": "t1_ddb4imq",
            "time": 1486221108.0,
            "id": "ddbc6ms",
            "sentiment_score": -0.25077200958388435
        },
        {
            "score": 3,
            "body": "I burned through all three this past year, and here's my general take. No narrative spoilers, just some touching on some surface analysis of genre conventions. \n\nRing is my favorite of the three, and I genuinely feel that it's a standout in the horror genre. It works fantastically as a standalone, and leaves the story in a good spot. Specifically, I think it works well because it's a genre piece. It doesn't go too far outside the box, but works cleverly within the confines of horror, and does great work with existing horror tropes. I don't have to sing too many praises here, if you've already read it, though I could go on and on about how much I love this book. \n\nSpiral is in some ways an equally good read, but also gets into weird territory when you compare it to Ring. In a lot of ways, it's something more of meta-fiction than a work of horror. It starts playing with a sci-fi horror blend, and goes in some pretty unexpected directions. To that end, it's an equally great read in some ways, but also can come across as compromising what made the first book fantastic. Spiral essentially takes the idea of the Ring narrative, and questions its validity as a narrative, both in universe and out of universe from the reader's perspective. If you're going to read Spiral, I would argue that you *have* to read Loop. \n\nLoop does something really interesting, in that where Spiral questions Ring, Loop questions everything you know about the narrative so far. It takes the entire story in a different direction, and treads way more into sci-fi. In a lot of ways I would even argue that it's essentially a sci-fi reading of the horror genre. It pokes holes in horror conventions, only to fill those holes with sci-fi tropes. It's a fantastic read from a literary perspective, in that I have to appreciate what it does for the trilogy overall, but depending on what you're looking for also suffers in the same way that Spiral suffers - it shatters the horror narrative, and leaves Ring as a very different text. This leads to some excellent moments, but also to some frustration, if you truly love what gets set up in the first book. \n\nTL;DR - I recommend all three, but if you're going to read Spiral, you pretty much have to read Loop in order to get a full appreciation for what's happening to the books as a whole. ",
            "author": "KataCraen",
            "parent_id": "t1_ddbkp6t",
            "time": 1486342359.0,
            "id": "ddd33gc",
            "sentiment_score": 0.14596955634139674
        },
        {
            "score": 3,
            "body": "You mean the mirror scene?\n\nEdit: If so, then I fucking called it. I saw another movie with my sister two days ago and they showed the trailer for *Rings*. I said to my sister that if the girl is touching her then we know she fucking dies and they spoiled it.",
            "author": "FizzleMateriel",
            "parent_id": "t1_ddb31e0",
            "time": 1486213664.0,
            "id": "ddb8sor",
            "sentiment_score": 0.2061933394932416
        },
        {
            "score": 8,
            "body": "She didn't \"show\" everyone the video. The only image people saw was of the well. I'd imagine the shock is seeing a girl crawl out of a video monitor was enough to cause the pilot to accidentally crash the plane. \n\nI dont think she specifically killed everyone. ",
            "author": "ndrw17",
            "parent_id": "t1_ddblajq",
            "time": 1486262109.0,
            "id": "ddbv3r4",
            "sentiment_score": -0.3155701693991735
        },
        {
            "score": 3,
            "body": "IF you watch the video, you have 7 days. She can still kill you if you don't watch it apparently - she killed the priest for some reason. \n\nBut now that she was back, what good would sending the video do? It's not like people could die from watching it cause she was right there now. ",
            "author": "vvsj",
            "parent_id": "t1_ddblajq",
            "time": 1486252822.0,
            "id": "ddbocu4",
            "sentiment_score": 0.8628478889181341
        },
        {
            "score": 4,
            "body": "It started to feel like Final Destination in a couple of places. ",
            "author": "RedofPaw",
            "parent_id": "t1_dda8auw",
            "time": 1486196173.0,
            "id": "ddaxjni",
            "sentiment_score": 0.6038542765566364
        },
        {
            "score": 5,
            "body": "Yeah, it seemed she did. I was hoping he would die in a totally unrelated way, but...",
            "author": "sumofawitch",
            "parent_id": "t1_dda8auw",
            "time": 1486204355.0,
            "id": "ddb35i8",
            "sentiment_score": -0.09872830026977497
        },
        {
            "score": 1,
            "body": "Yeah the One Missed Call and Shutter remakes were pretty bad. The originals are very good however. ",
            "author": "zrox456",
            "parent_id": "t1_ddb57kw",
            "time": 1486216790.0,
            "id": "ddbabz2",
            "sentiment_score": 0.3473850355354664
        },
        {
            "score": 6,
            "body": "Does the movie show the Fallout of that happening? Or are we just left to wonder?",
            "author": "bluscoutnoob",
            "parent_id": "t1_ddai3ot",
            "time": 1486179831.0,
            "id": "ddak719",
            "sentiment_score": -0.4094050564591165
        },
        {
            "score": 8,
            "body": "thats the exact same shit that happened in the japanese ring vs grudge movie too. cmon people think of something else!",
            "author": "leopald18",
            "parent_id": "t1_dd9js3d",
            "time": 1486119591.0,
            "id": "dd9jw4d",
            "sentiment_score": -0.3849842332932969
        },
        {
            "score": 4,
            "body": "Isn't that literally what they showed happening in the trailer? ",
            "author": "mardfet",
            "parent_id": "t1_dd9js3d",
            "time": 1486119934.0,
            "id": "dd9k52u",
            "sentiment_score": 0.5502664765913226
        },
        {
            "score": 11,
            "body": "I almost don't believe you because that sounds dumb as hell ",
            "author": "BansheeJam",
            "parent_id": "t1_ddacy9t",
            "time": 1486173431.0,
            "id": "ddaee63",
            "sentiment_score": 0.10500260804535144
        },
        {
            "score": 9,
            "body": "Jesus Christ, the scariest and most shocking part of the first ring was when she came out of the TV AT THE FUCKING CLIMAX!!!! So in their attempt to reboot the series they just go and throw it out at the very beginning taking away almost any tension? motherfuckers, why do I get my hopes up for horror sequels?",
            "author": "sellyourselfshort",
            "parent_id": "t1_ddacy9t",
            "time": 1486186322.0,
            "id": "ddapxgc",
            "sentiment_score": -0.05318212707885506
        },
        {
            "score": 4,
            "body": "But seriously, she should have killed only that guy. She didn't have to come from the pilot's monitor!\n\nMan, the more I think, the more I get frustrated. And I even wasn't expecting much about this. ",
            "author": "sumofawitch",
            "parent_id": "t1_ddacy9t",
            "time": 1486204128.0,
            "id": "ddb306h",
            "sentiment_score": 0.8811032825093326
        },
        {
            "score": 5,
            "body": "Wish I could say the same, 11.50 down the drain.",
            "author": "austine567",
            "parent_id": "t1_ddcmwlf",
            "time": 1486303449.0,
            "id": "ddcn2ox",
            "sentiment_score": 0.12143153686500185
        },
        {
            "score": 8,
            "body": "WHERE'S MY TAIL GABRIEL",
            "author": "jdog90000",
            "parent_id": "t1_dd9pvq8",
            "time": 1486130292.0,
            "id": "dd9qu2w",
            "sentiment_score": -0.28523194246827765
        },
        {
            "score": 4,
            "body": "I keep seeing \"tail\" what does it mean?",
            "author": "soybrain",
            "parent_id": "t1_dd9pvq8",
            "time": 1486131113.0,
            "id": "dd9r99i",
            "sentiment_score": -0.5655370609037031
        },
        {
            "score": 1,
            "body": "I thought this was that Japanese Ringu vs. Grudge movie ... nope, haha.  Has anyone seen that btw, that looked kinda silly in a fun way?",
            "author": "CaptainDAAVE",
            "parent_id": "t1_dd9q4k1",
            "time": 1486191323.0,
            "id": "ddatzkl",
            "sentiment_score": 0.46480897066258353
        },
        {
            "score": 2,
            "body": "That sucks that they retconned it like that. ",
            "author": "mikeweasy",
            "parent_id": "t1_ddc8srh",
            "time": 1486303242.0,
            "id": "ddcmyk2",
            "sentiment_score": -0.09679941827727823
        },
        {
            "score": 6,
            "body": "> I don't know why jump scare is a bad word now. \n\nIt's just a bad word because so many horror movies rely on crappy jump scares. There's nothing inherently wrong with jump scares... just something wrong with movies that either (a) don't earn the scare, or (b) overly rely on them.",
            "author": "supes1",
            "parent_id": "t1_dda80uz",
            "time": 1486171322.0,
            "id": "ddachig",
            "sentiment_score": -0.08296323093043223
        },
        {
            "score": 3,
            "body": "Well, jump scares can be effective if used properly, like in the Conjuring films, where most of the jump scares are real things that would scare you, like an actual ghost coming up behind you, not a bottle falling on the floor or a cat jumping from somewher or a friend grabbing you by the shoulder.",
            "author": "CatsLikeToMeow",
            "parent_id": "t1_dda80uz",
            "time": 1486172788.0,
            "id": "ddadt5u",
            "sentiment_score": -0.34872633779047746
        },
        {
            "score": 1,
            "body": "It's like the CGI argument, when Hollywood thinks they can cover up a bad movie with CGI or jump scares its going to get a bad rep. By contrast, James Wan uses jump scares to ENHANCE a good horror movie, not to create it.",
            "author": "DTbindz",
            "parent_id": "t1_dda80uz",
            "time": 1486358671.0,
            "id": "dddf84b",
            "sentiment_score": -0.22408335855568318
        },
        {
            "score": 1,
            "body": "That makes sense. Could set up a cool narrative of the struggle between her and the 7s. If this were part of a trilogy to that end I could forgive much of this movie lmao",
            "author": "diddles_giraffes",
            "parent_id": "t1_ddb9x2i",
            "time": 1486216431.0,
            "id": "ddba5yq",
            "sentiment_score": 0.5505403706906677
        },
        {
            "score": 1,
            "body": "I don't remember anything about a tumor in the first two books, but in the third book one of the characters got \"cloned\" into the real world and brought back some kind of super cancer from the matrix.  \n\nThe whole Samara thing was basically an easteregg by one of the developers of the simulation. ",
            "author": "Oraex",
            "parent_id": "t1_ddbkmif",
            "time": 1486274404.0,
            "id": "ddc3xc9",
            "sentiment_score": 0.2926014113552273
        },
        {
            "score": 2,
            "body": "Nope. Although I may as well say, The Visit and The Conjuring were probably the \"scariest\" horror movies I've seen, while still being entertaining. I put scariest in quotations because I don't really get scared by horror movies, but those two at least put me on edge.",
            "author": "darklord0211",
            "parent_id": "t1_ddjf95e",
            "time": 1486695709.0,
            "id": "ddji9nb",
            "sentiment_score": -0.5553428901926358
        },
        {
            "score": 1,
            "body": "I'd say it was mediocre bordering on terrible but not an utter dumpster fire. I was hoping that it'd be a so bad it's good/funny deal. Me and my friends were just w/e about everything.",
            "author": "legochemgrad",
            "parent_id": "t1_ddcu3m0",
            "time": 1486435004.0,
            "id": "ddeqbl9",
            "sentiment_score": -0.6258135624691279
        },
        {
            "score": 3,
            "body": "> Eh, the end isn't necessarily supposed to be \"tied up\"\n\nYeah no shit... because that's how it was written. You can just as easily write in any other ending in the world. \n\nI kind of hope the series just dies. I'm not saying a prequel that's extremely well directed and written is a bad thing, but odds are it'd be really shit. I prefer to keep The Ring (which I think deserves much better reviews than it gets) and The Ring 2, but the latter just as a reminder to stop this insane shit and let it die.",
            "author": "naphthoylindole",
            "parent_id": "t1_dditvxl",
            "time": 1486653427.0,
            "id": "dditx9l",
            "sentiment_score": 0.9313554887269342
        },
        {
            "score": 1,
            "body": "thanks bro.   did u catch what the flood was about? i heard them say someones body flooded away but i didnt catch who or how it was relevant",
            "author": "cheshire_ranch",
            "parent_id": "t1_ddb9ttn",
            "time": 1486227443.0,
            "id": "ddbebk2",
            "sentiment_score": 0.2782599800865393
        },
        {
            "score": 1,
            "body": "~~Having not seen The Ring 2, weren't the remains put to rest in the place where she died?~~",
            "author": "deh_tommy",
            "parent_id": "t1_ddb9ttn",
            "time": 1486246351.0,
            "id": "ddbkj84",
            "sentiment_score": 0.8047374232478506
        },
        {
            "score": 6,
            "body": "ss was the worst piece of money grabbing shit ive ever seen. I say that as a huge dc fan who was massively disappointed.. im telling u right now, id watch this movie again before i watch ss again (i loved bvs directors cut btw)",
            "author": "cheshire_ranch",
            "parent_id": "t1_ddb9k3x",
            "time": 1486215328.0,
            "id": "ddb9myr",
            "sentiment_score": -0.6384837601100215
        },
        {
            "score": 2,
            "body": "The Cell",
            "author": "mdeezel",
            "parent_id": "t1_dddpvds",
            "time": 1486414002.0,
            "id": "ddeb8pz",
            "sentiment_score": -0.09994587115205444
        },
        {
            "score": 2,
            "body": "Most of Sinister is Ethan Hawke watching snuff films and then getting the shit scared out of him by his kids. And then D'onfrio as webcam consultant",
            "author": "KershawTheCloser",
            "parent_id": "t1_dddpvds",
            "time": 1486661918.0,
            "id": "ddiwyeb",
            "sentiment_score": 0.4769277805048293
        },
        {
            "score": 4,
            "body": "Well, that makes sense. ",
            "author": "sumofawitch",
            "parent_id": "t1_ddc936i",
            "time": 1486330405.0,
            "id": "ddcwc6c",
            "sentiment_score": 0.44699975542287973
        },
        {
            "score": 12,
            "body": "Is she the second coming of Jesus the miracle worker?",
            "author": "madmacaron",
            "parent_id": "t1_ddbnjz3",
            "time": 1486255340.0,
            "id": "ddbq3kb",
            "sentiment_score": 0.30581057088526675
        },
        {
            "score": 1,
            "body": "[deleted]",
            "author": "None",
            "parent_id": "t1_ddacvra",
            "time": 1486187035.0,
            "id": "ddaqitz",
            "sentiment_score": -0.37636782007910763
        },
        {
            "score": 27,
            "body": "It's really, *really* dumb.",
            "author": "Ikea_Man",
            "parent_id": "t1_dda816s",
            "time": 1486168986.0,
            "id": "ddaadva",
            "sentiment_score": 0.8020781337845966
        },
        {
            "score": 68,
            "body": "Not only is there a Ring Vs Grudge movie, they did a promo in Asia where they threw the first pitch at a baseball game. It's [un-fucking believably funny](https://www.youtube.com/watch?v=FCMAU4m2lEA)",
            "author": "poland626",
            "parent_id": "t1_dda816s",
            "time": 1486187177.0,
            "id": "ddaqn3v",
            "sentiment_score": 0.34082321750840383
        },
        {
            "score": 4,
            "body": "They could try to make a good film though",
            "author": "bloodflart",
            "parent_id": "t1_ddbbnad",
            "time": 1486241199.0,
            "id": "ddbiats",
            "sentiment_score": -0.30564151191970934
        },
        {
            "score": 3,
            "body": "I used to be one of those high school kids with disposable income. Nowadays I have to be very selective with the films I go see.",
            "author": "BuggsBee",
            "parent_id": "t1_ddbbnad",
            "time": 1486373237.0,
            "id": "dddqa15",
            "sentiment_score": 0.3822917851728862
        },
        {
            "score": 19,
            "body": "The ones I find unpleasant to watch are ones like the one discussed here (Rings) because apparently it is just cheap jump scares.\n\nI love horror moves like \"It Follows\" because it scares you throw a constant sense of dread and tense atmosphere.\n\nBut honestly, most horror movies nowadays suck. It's always been kind of a shitty genre.",
            "author": "Ikea_Man",
            "parent_id": "t1_ddaim0p",
            "time": 1486178200.0,
            "id": "ddaiq3p",
            "sentiment_score": 0.3279542976733094
        },
        {
            "score": 59,
            "body": "But isn't that literally just the plot of the first one?",
            "author": "MotherDucker95",
            "parent_id": "t1_dda7r1b",
            "time": 1486177601.0,
            "id": "ddai6e7",
            "sentiment_score": 0.9089411734116333
        },
        {
            "score": 12,
            "body": "Yeah I feel the majority of the film's core mystery was a nice echo of the first film that kind of did it's own thing without spitting too much on the original. The ending just seemed to fumble a bit with trying things up and instead made it an obligatory set up for something else entirely. It seems to be getting a lot of hate in here, but I was pleasantly surprised.",
            "author": "BIG_PY",
            "parent_id": "t1_dda7r1b",
            "time": 1486166140.0,
            "id": "dda7waq",
            "sentiment_score": 0.41319380216864854
        },
        {
            "score": 3,
            "body": "Objectively, it was a bad movie. \n\nSubjectively, as a fan of the series the underlying plot was awesome. The priest was a great character, just executed poorly. The final \"summoning\" of Samara was so badass but only lasted for a second. \n\nWasn't a fan of the complete disregard for The Ring 2, they could have easily tied them together, but I enjoyed the movie overall. ",
            "author": "hugesmurfboner",
            "parent_id": "t1_dda7r1b",
            "time": 1486210901.0,
            "id": "ddb7ady",
            "sentiment_score": 0.7045295162645961
        },
        {
            "score": 4,
            "body": "[Someone's living in the walls!](https://youtu.be/tSEqVqmYhrk)  ",
            "author": "Pluwo4",
            "parent_id": "t1_ddaot1r",
            "time": 1486204151.0,
            "id": "ddb30q4",
            "sentiment_score": -0.7998736587749917
        },
        {
            "score": 11,
            "body": "She wrote it in brail so her father could read and try to stop her.\n\nGreat plan 10/10",
            "author": "senhormouse",
            "parent_id": "t1_ddb6rsm",
            "time": 1486249692.0,
            "id": "ddbmdsi",
            "sentiment_score": -0.6529019791565918
        },
        {
            "score": 37,
            "body": "James Wan is always careful about his jump scares. He doesn't use them as cheap tricks, they genuinely move the film along and serve a purpose. ",
            "author": "Dan_IAm",
            "parent_id": "t1_dd9ws7h",
            "time": 1486158026.0,
            "id": "dda1x0q",
            "sentiment_score": -0.5253164317506611
        },
        {
            "score": 7,
            "body": "Last Shift also does jumpscares well. Sometimes they're used to start a horror sequence, and there's a couple times they come in the middle of a scary/tense sequence that keeps going after the jump scare.",
            "author": "TheConqueror74",
            "parent_id": "t1_dd9ws7h",
            "time": 1486166311.0,
            "id": "dda81jr",
            "sentiment_score": 0.2236631442991266
        },
        {
            "score": 2,
            "body": "Good save, I had already pulled up the info for the remake thinking it was the original lol. I'll be checking out the French version for sure. ",
            "author": "Wint3riscoming",
            "parent_id": "t1_ddaqwgn",
            "time": 1486188012.0,
            "id": "ddarc6h",
            "sentiment_score": 0.5649892130521095
        },
        {
            "score": 1,
            "body": "Was curious what ya'll were talking about but then you lost me at \"French\".\n\nIf this is anything like Inside or Haute Tension I will avoid it like the plague. Both of those French horror movies get touted on the intranets so much but they were both some of the absolute WORST movies I have ever had the displeasure of watching.\n\nIs Martyrs similar to those movies?",
            "author": "LostprophetFLCL",
            "parent_id": "t1_ddaqwgn",
            "time": 1486202467.0,
            "id": "ddb1wkp",
            "sentiment_score": 0.729186429211548
        },
        {
            "score": 1,
            "body": "I'm not sure why you're getting downvoted... Martyrs was easily one of the worst films of 2016. And to keep up with this trend... they are remaking Suspiria.",
            "author": "20_Antzy_Pantzy_15",
            "parent_id": "t1_ddaqwgn",
            "time": 1486215021.0,
            "id": "ddb9hmo",
            "sentiment_score": -0.718689948345165
        },
        {
            "score": 1,
            "body": "Damn y'all have me hyped, I love movies like that. ",
            "author": "Wint3riscoming",
            "parent_id": "t1_ddaubls",
            "time": 1486197245.0,
            "id": "ddaybct",
            "sentiment_score": -0.14178804599114025
        },
        {
            "score": 13,
            "body": "do you mean: \"SCRATCH SCRATCH, WHO's THAT RATCH? (2017)\" ?",
            "author": "nelsonfeelsgoodman",
            "parent_id": "t1_ddaixu5",
            "time": 1486178961.0,
            "id": "ddajeo3",
            "sentiment_score": -0.23068808596875945
        },
        {
            "score": 2,
            "body": "I remember coming out of the theater thinking that it was a big old bag of fun entertainment. I told everyone I enjoyed it, but I also said laughingly it was not a good movie. Not a bad way to kill two hours :)",
            "author": "Elzar3000",
            "parent_id": "t1_ddbojg8",
            "time": 1486388816.0,
            "id": "dde22q6",
            "sentiment_score": 0.35370707587160166
        },
        {
            "score": 7,
            "body": "This movie better not be two hours and twenty two minutes. ",
            "author": "Danton87",
            "parent_id": "t1_ddaenz3",
            "time": 1486191191.0,
            "id": "ddatvx1",
            "sentiment_score": -0.46449346733459573
        },
        {
            "score": 10,
            "body": "The rapping kid was just too fucking much.",
            "author": "dimidunnit",
            "parent_id": "t1_dda87ce",
            "time": 1486170425.0,
            "id": "ddaboln",
            "sentiment_score": 0.07937091997284207
        },
        {
            "score": 6,
            "body": "Thanks. I haven't watched it yet but apparently Train to Busan is good, too.",
            "author": "dimidunnit",
            "parent_id": "t1_dd9z9vx",
            "time": 1486153548.0,
            "id": "dd9zn8i",
            "sentiment_score": 0.4822795920629035
        },
        {
            "score": 2,
            "body": "I am still shocked that a movie about an evil mirror wasn't complete horseshit.\n\nThat movie didn't really scare me too much, but it definitely was unsettling and was surprisingly interesting. Was not expecting the concept to work at all.",
            "author": "LostprophetFLCL",
            "parent_id": "t1_ddabjy8",
            "time": 1486202147.0,
            "id": "ddb1owu",
            "sentiment_score": -0.3636611513912382
        },
        {
            "score": 1,
            "body": "I guess. I'd argue it's nominally horror if it involves supernatural elements, which both movies do (apparently, since I haven't watched Split yet).",
            "author": "dimidunnit",
            "parent_id": "t1_ddbdugg",
            "time": 1486227192.0,
            "id": "ddbe8uv",
            "sentiment_score": -0.6757028080688965
        },
        {
            "score": 1,
            "body": "It was pretty ham fisted compared to the original. It also used the Ring remakes \"she found the body and solved the haunting....but not really\" cliche which was not part of the original. ",
            "author": "Ovidhalia",
            "parent_id": "t1_ddae7ud",
            "time": 1486174273.0,
            "id": "ddaf5gw",
            "sentiment_score": -0.03254677996210842
        },
        {
            "score": 1,
            "body": "Faithful in story, abysmal in atmosphere and dread. ",
            "author": "chicagoredditer1",
            "parent_id": "t1_ddae7ud",
            "time": 1486260722.0,
            "id": "ddbu2la",
            "sentiment_score": 0.9271319632725787
        },
        {
            "score": 3,
            "body": "Being studied by who? For what?",
            "author": "EnterprisingAss",
            "parent_id": "t1_dd9omtr",
            "time": 1486151174.0,
            "id": "dd9yov3",
            "sentiment_score": -0.9282685501080237
        },
        {
            "score": 3,
            "body": "My apologies. I read several accounts online of the movie erasing The Ring Two from its continuity (but keeping Evelyn's name) and I read an interview with the director where he states Rachel isn't mentioned (but I guess he meant that she isn't directly mentioned by name and its more a nod to those with a close eye)\n\nHowever, having seen it tonight, I agree that yes, they do match up. Many people were interpreting the \"She tried to kill the baby\" comment by the priest as Evelyn having Samara in captivity. Whereas if you watch closely, it's implied she escaped at 8 1/2 months pregnant and he meant she was trying to kill the baby in the womb while she was imprisoned. ",
            "author": "gingeguy22",
            "parent_id": "t1_ddb6e3f",
            "time": 1486215639.0,
            "id": "ddb9sco",
            "sentiment_score": 0.9851358605788629
        },
        {
            "score": 2,
            "body": "In The Ring and The Ring Two the first kills involved someone else either in the area (Becca when Katie died) or in the room (Emily when Jake died) and both were pretty traumatized but didn't die. (But Becca was institutionalized). They never explicitly say that Samara killed all the people, just that the plane crashed. You could make the case that either the pilots were traumatized, or Samara inadvertently screwed up the electrical system when she came out of the cockpit to kill him (so basically a whole plane's worth of collateral damage yeah).  ",
            "author": "gingeguy22",
            "parent_id": "t1_dddyvfs",
            "time": 1486384680.0,
            "id": "dddzjl9",
            "sentiment_score": 0.07627169984616944
        },
        {
            "score": 2,
            "body": "no. they turned off the lights like if the movie was about to start and people started screaming and slowing turning the lights back on. it was pretty cool. they started contorting and walking between the isles ",
            "author": "jadakiss",
            "parent_id": "t1_ddbkrts",
            "time": 1486262932.0,
            "id": "ddbvpyj",
            "sentiment_score": -0.2529638427974472
        },
        {
            "score": 1,
            "body": "Bravo",
            "author": "FeckTad",
            "parent_id": "t1_ddb8nx1",
            "time": 1486214252.0,
            "id": "ddb93pv",
            "sentiment_score": -0.07763300731941625
        },
        {
            "score": 3,
            "body": "He's hit-and-miss.",
            "author": "JakkuScavenger",
            "parent_id": "t1_dda7ov7",
            "time": 1486173282.0,
            "id": "ddae9bf",
            "sentiment_score": 0.5119486128912203
        },
        {
            "score": 2,
            "body": "Very true, but his writing has been inconsistent.  He's had some good films ( A Beautiful Mind, The Client, etc.), but he's had several truly awful films (Rings, Batman and Robin, Lost in Space, The 5th Wave,...).",
            "author": "Monkey_Knife_Fight",
            "parent_id": "t1_dda7ov7",
            "time": 1486176851.0,
            "id": "ddahi7y",
            "sentiment_score": -0.5485563097994199
        },
        {
            "score": 5,
            "body": "They're fine. ",
            "author": "RedofPaw",
            "parent_id": "t1_ddaxgmt",
            "time": 1486196254.0,
            "id": "ddaxlpo",
            "sentiment_score": -0.9133312454969742
        },
        {
            "score": 1,
            "body": "They're okay. IMO one of the faces you can tell was done with CGI because the actor probably didn't want to sit for a life casting session so they could make the dummy. The other face though is pretty well done and you see it twice. ",
            "author": "gingeguy22",
            "parent_id": "t1_ddaxgmt",
            "time": 1486381065.0,
            "id": "dddwv4o",
            "sentiment_score": 0.5215919472858321
        },
        {
            "score": 5,
            "body": "Looking them up now, thanks!",
            "author": "clwestbr",
            "parent_id": "t1_ddbc6ms",
            "time": 1486246563.0,
            "id": "ddbknaj",
            "sentiment_score": 0.1375357658034282
        },
        {
            "score": 2,
            "body": "Birthday is also worth checking out. Three short stories about the Ring universe (Lemon Heart is especially good, and spawned one of the better Ring films, Ring 0: Birthday).\n\nBut I 100% agree with your take on the books. They are some of my favorites, ever.",
            "author": "mooninitetwo",
            "parent_id": "t1_ddd33gc",
            "time": 1486428507.0,
            "id": "ddekqfk",
            "sentiment_score": 0.8125881605329464
        },
        {
            "score": 3,
            "body": "Yep. The very last scene. ",
            "author": "sumofawitch",
            "parent_id": "t1_ddb8sor",
            "time": 1486235914.0,
            "id": "ddbgpa8",
            "sentiment_score": -0.9519311914634006
        },
        {
            "score": 2,
            "body": "This is not the mirror scene you're thinking of. The scene where Samara shows up behind her in the mirror and then grabs her was just shot for the trailers. In the movie during this scene, she just pops up behind her. \nThe scene u/sumofawitch is referring to was in the commercials and international trailers but was missing from both US trailers (though they do spoil 2 other shots from the last scene). ",
            "author": "gingeguy22",
            "parent_id": "t1_ddb8sor",
            "time": 1486380902.0,
            "id": "dddwpur",
            "sentiment_score": -0.5032303755960881
        },
        {
            "score": 1,
            "body": "You're right.",
            "author": "senhormouse",
            "parent_id": "t1_ddbv3r4",
            "time": 1486362843.0,
            "id": "dddia7o",
            "sentiment_score": 0.08397929187088571
        },
        {
            "score": 2,
            "body": "Pretty sure the priest blinded himself after he saw it so he couldn't see her coming out of a TV or whatever.",
            "author": "naphthoylindole",
            "parent_id": "t1_ddbocu4",
            "time": 1486294396.0,
            "id": "ddchoee",
            "sentiment_score": 0.3402627867878074
        },
        {
            "score": 1,
            "body": "I assumed that the confrontation was happening on day 7 for Julia. Because Julia did what Samara wanted and found the bones, she killed the priest because she didn't need him anymore and spared Julia because she knew she would be the vessel for her rebirth. ",
            "author": "gingeguy22",
            "parent_id": "t1_ddbocu4",
            "time": 1486379474.0,
            "id": "dddvf8z",
            "sentiment_score": -0.5273563154183492
        },
        {
            "score": 9,
            "body": "It's kept very contained in an experimental way near the begining, but when Samara is reborn at the end, she takes over the computer and sends it to everyone.",
            "author": "topherthepest",
            "parent_id": "t1_ddak719",
            "time": 1486181151.0,
            "id": "ddalep0",
            "sentiment_score": -0.4416715789212211
        },
        {
            "score": 6,
            "body": "No.  It's setting up another film unfortunately.",
            "author": "Only_a_dog",
            "parent_id": "t1_ddak719",
            "time": 1486188350.0,
            "id": "ddarm6h",
            "sentiment_score": 0.870270614491107
        },
        {
            "score": 4,
            "body": "It's basically the last thing in the movie. So... yeah. Great job, trailer.",
            "author": "RedofPaw",
            "parent_id": "t1_ddak719",
            "time": 1486196054.0,
            "id": "ddaxgls",
            "sentiment_score": 0.5677190036935511
        },
        {
            "score": 6,
            "body": ".....there was a ring vs grudge movie?",
            "author": "muffinopolist",
            "parent_id": "t1_dd9jw4d",
            "time": 1486126494.0,
            "id": "dd9on68",
            "sentiment_score": 0.9057897770906265
        },
        {
            "score": 2,
            "body": "What is that movie called?",
            "author": "dimidunnit",
            "parent_id": "t1_dd9jw4d",
            "time": 1486132493.0,
            "id": "dd9rxk9",
            "sentiment_score": 0.8185072790799197
        },
        {
            "score": 11,
            "body": "Yes, you're correct. The clip from the trailer where she wipes the shower steam off the mirror. That's the ending. ",
            "author": "Cheeseburguh",
            "parent_id": "t1_dd9k52u",
            "time": 1486127702.0,
            "id": "dd9pdjp",
            "sentiment_score": -0.27199791727742784
        },
        {
            "score": 3,
            "body": "No, you're probably referring to Samara coming up behind Julia and grabbing her while she's looking in the mirror. But if they did show it, I never saw it. Regardless, very dumb ending.",
            "author": "nitrouspillow",
            "parent_id": "t1_dd9k52u",
            "time": 1486120175.0,
            "id": "dd9kbbi",
            "sentiment_score": 0.06709767817846601
        },
        {
            "score": 2,
            "body": "I have no idea I got my ticket for free from a friend I knew nothing going in",
            "author": "TehAlpacalypse",
            "parent_id": "t1_dd9k52u",
            "time": 1486120063.0,
            "id": "dd9k8dq",
            "sentiment_score": 0.1518588960661973
        },
        {
            "score": 13,
            "body": "That's not everything. The guy who buys that VCR, that's not the main character. The movie basically has two prologues before it even introduces us to the main character. And, IMO, they were both unnecessary! ",
            "author": "JakkuScavenger",
            "parent_id": "t1_ddaee63",
            "time": 1486173871.0,
            "id": "ddaesdy",
            "sentiment_score": -0.7847313060195895
        },
        {
            "score": 5,
            "body": "To be fair, I think that The Ring has become such a big phenomenon that the twist at the end wouldn't really work anymore as a surprise (and with how iconic that scene is).",
            "author": "deh_tommy",
            "parent_id": "t1_ddapxgc",
            "time": 1486247046.0,
            "id": "ddbkwmt",
            "sentiment_score": -0.5302052879008745
        },
        {
            "score": 2,
            "body": "it would spoil the film for you, so if you don't mind you can PM",
            "author": "anti_body",
            "parent_id": "t1_dd9r99i",
            "time": 1486135334.0,
            "id": "dd9t6nl",
            "sentiment_score": -0.22765554999292048
        },
        {
            "score": 1,
            "body": "Someone you pass the curse onto when showing your copy of the tape and so forth.",
            "author": "discoparty",
            "parent_id": "t1_dd9r99i",
            "time": 1486135206.0,
            "id": "dd9t4r5",
            "sentiment_score": -0.5066120757586541
        },
        {
            "score": 3,
            "body": "It's the use of *false* jump scares that have ruined them.  Oh it's just a cat or it's a friend or whatever.  \n  \nIt's just loud music to startle you, nothing actually scary.  If the jump scare is actually scary, like the girl in the closet in the first Ring, they work fine.",
            "author": "DiscoHippo",
            "parent_id": "t1_ddachig",
            "time": 1486175965.0,
            "id": "ddagovv",
            "sentiment_score": -0.8973343984640334
        },
        {
            "score": 1,
            "body": "I would say so many horror movies are just plain crap, with or without jumpscares. It is the genre with the most and least innovation. Once someone does something different it will be lauded and the director may go on and rule Hollywood. Gore Verbinski (The Ring to Pirates of the Caribbean), Peter Jackson (Brain Dead to Lord of the Rings), Sam Rami (Evil Dead to Spiderman, Steven Spielberg (Duel, Jaws to everything), Francis Ford Coppola, Roman Polanski, James Cameron, etc., etc.\n\nBut then anytime you do get a truly great movie, it is inevitably followed by a bunch of imitators. Blair Witch led to a bunch of found footage movies, The Ring led to a bunch of J Horror remakes, Evil Dead lead to a bunch of splatter movies, Hostel led to a bunch of torture porn. Halloween led to a bunch of slasher movies and then Scream reignited that genre. About a decade after Scream it lead to a bunch of horror movies that deconstruct horror movies (Final Girls, House of the Devil, Behind the Mask: The Rise of Leslie Vernon, Scream Queens, Buffy).\n\nSaying that horror uses just a bunch of lazy jump scares is a lazy way to describe horror. Horror movies are simultaneously going to have the dregs and most creative films out there because they are relatively cheap with high profit margins. It is a genre that a lot of great and terrible directors will cut their teeth on.",
            "author": "stevenglansbergalone",
            "parent_id": "t1_ddachig",
            "time": 1486172336.0,
            "id": "ddadegi",
            "sentiment_score": 0.6577872351395588
        },
        {
            "score": 4,
            "body": "Hopefully, I will never forget when Silent Hill: Revelations tried to get a scare with a Pop Tart jumping from the toaster.",
            "author": "deh_tommy",
            "parent_id": "t1_ddadt5u",
            "time": 1486247445.0,
            "id": "ddbl4kt",
            "sentiment_score": 0.6093229342005695
        },
        {
            "score": 1,
            "body": "I think I'm confusing the 'tumour' with Smallpox, though I could just be grossly misremembering things.",
            "author": "deh_tommy",
            "parent_id": "t1_ddc3xc9",
            "time": 1486276110.0,
            "id": "ddc54r4",
            "sentiment_score": -0.9358004834698186
        },
        {
            "score": 3,
            "body": "You may want to watch Sinister. Made me scared along with the movies you've listed. Although I find the ending a bit cheesy, it was pretty scary, watching at night and alone.",
            "author": "ArleiG",
            "parent_id": "t1_ddji9nb",
            "time": 1486718460.0,
            "id": "ddk0wps",
            "sentiment_score": -0.752847894734767
        },
        {
            "score": 2,
            "body": "They attempted to bury her bones in the lot of the Church but the spirit caused a flood, practically ruining the church and causing the bodies to be displaced, hence why they then chose to put them in the different tombs (Samaras being unmarked). ",
            "author": "ndrw17",
            "parent_id": "t1_ddbebk2",
            "time": 1486262429.0,
            "id": "ddbvcaj",
            "sentiment_score": -0.06562697683676433
        },
        {
            "score": 2,
            "body": "No. At the end of the first one, Rachel finds her remains in the well and says she gave them to the police to get buried next week. \n\nIn Rings, there are newspaper clippings stating that her remains were sent back to Moesko Island but the residents refused to allow her to be buried there, so they then somehow ended up in the town where she was actually from. \n\nNot quite sure how they figured that out now that I'm thinking about it. ",
            "author": "ndrw17",
            "parent_id": "t1_ddbkj84",
            "time": 1486262292.0,
            "id": "ddbv8m8",
            "sentiment_score": -0.8492088142581518
        },
        {
            "score": 5,
            "body": "I will never understand the hate for this movie. It was a procedural cop movie with a little sci-fi mixed in with some neat visuals. It seems like ever since Nostalgia Critic got a hold of it people bash it left and right.",
            "author": "vampfredthefrog",
            "parent_id": "t1_ddeb8pz",
            "time": 1486445211.0,
            "id": "ddez551",
            "sentiment_score": 0.5936613775940758
        },
        {
            "score": 4,
            "body": "Is that not what was meant in the movie? I haven't seen the film, that just seemed blindingly obvious as the reason why he would feel safe.",
            "author": "DaystarEld",
            "parent_id": "t1_ddcwc6c",
            "time": 1486534976.0,
            "id": "ddgn00z",
            "sentiment_score": 0.37711585486333843
        },
        {
            "score": 1,
            "body": "I was curious as to what people thought of the movie?",
            "author": "Mexican_Nutsack",
            "parent_id": "t1_ddaqitz",
            "time": 1486190294.0,
            "id": "ddat6qe",
            "sentiment_score": 0.11270539995472184
        },
        {
            "score": 6,
            "body": "The funniest part is the fact that this movie exists",
            "author": "yomama629",
            "parent_id": "t1_ddaqn3v",
            "time": 1486438824.0,
            "id": "ddetmnt",
            "sentiment_score": 0.3238857715837
        },
        {
            "score": 6,
            "body": "Oh, Japan. You crazy.",
            "author": "hoodie92",
            "parent_id": "t1_ddaqn3v",
            "time": 1486235235.0,
            "id": "ddbgies",
            "sentiment_score": -0.4593494174072501
        },
        {
            "score": 4,
            "body": "its not that funny",
            "author": "maxypooh15",
            "parent_id": "t1_ddaqn3v",
            "time": 1486226766.0,
            "id": "ddbe43h",
            "sentiment_score": 0.38109159614355215
        },
        {
            "score": 2,
            "body": "That takes more time, money and effort though, from rewrites of the script to reshoots of the scenes to hiring better actors.",
            "author": "DaystarEld",
            "parent_id": "t1_ddbiats",
            "time": 1486535124.0,
            "id": "ddgn4k9",
            "sentiment_score": 0.8865381383158759
        },
        {
            "score": 15,
            "body": "My problem is I am usually intrigued by the ideas involved in horror movies, but I don't enjoy being scared by them (generally speaking). There are exceptions, I really liked [REC] and the old Evil Dead movies (which are kinda comedies I guess), etc. I still wan to see It Follows and The Witch as well.\n\nBut I dont' want to watch them by myself, and my wife is bigger chicken than I am!",
            "author": "blazeofgloreee",
            "parent_id": "t1_ddaiq3p",
            "time": 1486178592.0,
            "id": "ddaj2s3",
            "sentiment_score": 0.9310327634892404
        },
        {
            "score": 1,
            "body": "I loved it follows! Honestly the music was one of the bes things about it. ",
            "author": "MrDeeds117",
            "parent_id": "t1_ddaiq3p",
            "time": 1486182838.0,
            "id": "ddamx1x",
            "sentiment_score": 0.09177465417279684
        },
        {
            "score": 18,
            "body": "The first one had the mom doing it because her son was gonna die, but yeah it'd basically be the same movie.\n\nI'm honestly somewhat thankful to this movie for reminding me how good The Ring is.",
            "author": "IanMazgelis",
            "parent_id": "t1_ddai6e7",
            "time": 1486222505.0,
            "id": "ddbcpax",
            "sentiment_score": 0.15855806159458385
        },
        {
            "score": 1,
            "body": "Really? I only saw the first one years ago so I hardly remember what was the plot. ",
            "author": "IAmMrMiracle",
            "parent_id": "t1_ddai6e7",
            "time": 1486180463.0,
            "id": "ddaks54",
            "sentiment_score": 0.6242677589019061
        },
        {
            "score": 15,
            "body": "He is a master of jump scares. The way Wan builds up his scares is just something else. The portion of the first Conjuring movie where the mom gets trapped in the basement and you get that wardrobe scene might be the scariest segment of a movie I have ever seen.",
            "author": "LostprophetFLCL",
            "parent_id": "t1_dda1x0q",
            "time": 1486203079.0,
            "id": "ddb2bar",
            "sentiment_score": 0.8094649114235306
        },
        {
            "score": 1,
            "body": "Martyrs is way better than either of those films. I didn't like Inside, thought Haute Tension was okay if dumb, but loooooved Martyrs. So take that how you will. ",
            "author": "Tyranabolicsaurus",
            "parent_id": "t1_ddb1wkp",
            "time": 1486218620.0,
            "id": "ddbb67f",
            "sentiment_score": -0.8842004535811481
        },
        {
            "score": 5,
            "body": "OLD LADY IN THE WALL",
            "author": "Peetrius",
            "parent_id": "t1_ddajeo3",
            "time": 1486253807.0,
            "id": "ddbp0qe",
            "sentiment_score": -0.34099807994773523
        },
        {
            "score": 3,
            "body": "It just feels like it.",
            "author": "TheTrueRory",
            "parent_id": "t1_ddatvx1",
            "time": 1486215376.0,
            "id": "ddb9nsz",
            "sentiment_score": -0.8427546147290328
        },
        {
            "score": 2,
            "body": "Didn't try that but the Wailing is probably my favorite movie of 2016. It's not as much of a horror as something like The Ring. It's very story driven and the first half has quite a bit of humor, but I really love it. ",
            "author": "SeekerP",
            "parent_id": "t1_dd9zn8i",
            "time": 1486153743.0,
            "id": "dd9zq90",
            "sentiment_score": -0.49388658079838255
        },
        {
            "score": 1,
            "body": "Part of the reason Oculus worked is because they tried to tackle it in a rational manner. Smart characters in horror movies are hard to come by.",
            "author": "Tyle55",
            "parent_id": "t1_ddb1owu",
            "time": 1486208724.0,
            "id": "ddb5yyi",
            "sentiment_score": 0.8790287020897976
        },
        {
            "score": 8,
            "body": "His Batman & Robin script is legendary. I can't imagine coming up with all those ice puns. It would probably make me go mad.",
            "author": "BradyDowd",
            "parent_id": "t1_ddae9bf",
            "time": 1486174379.0,
            "id": "ddaf8y3",
            "sentiment_score": -0.8982768940478807
        },
        {
            "score": 5,
            "body": "Alright cool. That scene from the first is one of my favorites from a horror movie.",
            "author": "Krettlecorn13",
            "parent_id": "t1_ddaxlpo",
            "time": 1486196616.0,
            "id": "ddaxuz7",
            "sentiment_score": -0.28811707912943496
        },
        {
            "score": 2,
            "body": "I have all the ring mangas! They are pretty good! You may be able to find them at a BAM or any bookstore that sells mangas or look on Amazon.",
            "author": "mkmchale",
            "parent_id": "t1_ddbknaj",
            "time": 1486319908.0,
            "id": "ddct13h",
            "sentiment_score": -0.5245029535143539
        },
        {
            "score": 2,
            "body": "I went looking for Birthday at one point, but couldn't find it, so I've ended up putting it off. I did, however, end up reading through his short story collection \"Death and the Flower,\" which had a couple standouts. Have you happened to read his Dark Water collection? That's also on my short list. ",
            "author": "KataCraen",
            "parent_id": "t1_ddekqfk",
            "time": 1486429310.0,
            "id": "ddelenz",
            "sentiment_score": -0.779277987281682
        },
        {
            "score": 6,
            "body": "yeah but then she came back at the end, healed his blindness even though he never watched the tape, and when he saw her, she killed him...\n\ni feel like she could have done that at any time. ",
            "author": "vvsj",
            "parent_id": "t1_ddchoee",
            "time": 1486294438.0,
            "id": "ddchpf8",
            "sentiment_score": -0.6246190978936623
        },
        {
            "score": 2,
            "body": "Why? I thought she had no control over the distribution of the tape, and relied on other people's copies to get her victims?",
            "author": "deh_tommy",
            "parent_id": "t1_ddalep0",
            "time": 1486246892.0,
            "id": "ddbktly",
            "sentiment_score": -0.484523754680217
        },
        {
            "score": 2,
            "body": "To be fair, it felt like something that would happen halfway through. Especially since it goes right before the plane clip which is a scene at the beginning of the movie.",
            "author": "bluscoutnoob",
            "parent_id": "t1_ddaxgls",
            "time": 1486198310.0,
            "id": "ddaz21b",
            "sentiment_score": -0.5733203221392609
        },
        {
            "score": 9,
            "body": "Just came out on U.S. streaming (Shudder I think) earlier this week called Sadako v. Kayako",
            "author": "Xroad1",
            "parent_id": "t1_dd9on68",
            "time": 1486128877.0,
            "id": "dd9q27m",
            "sentiment_score": 0.2595504345648001
        },
        {
            "score": 2,
            "body": "If you can even call it that, as the actual confrontation is only a few minutes long.",
            "author": "TildenJack",
            "parent_id": "t1_dd9on68",
            "time": 1486144672.0,
            "id": "dd9wio8",
            "sentiment_score": -0.3886580983931738
        },
        {
            "score": 2,
            "body": "Don't let the snobs here detract you from giving it a shot.  It's a hilarious camp fest.  It just ramps up the camp notch by notch until the ending where it tears the knob off.  It was hilarious and I adored it.",
            "author": "Jigsaw-Complex",
            "parent_id": "t1_dd9on68",
            "time": 1486164226.0,
            "id": "dda6awx",
            "sentiment_score": 0.45084853452867635
        },
        {
            "score": 3,
            "body": "Sadako v. Kayako",
            "author": "leopald18",
            "parent_id": "t1_dd9rxk9",
            "time": 1486139183.0,
            "id": "dd9uo5h",
            "sentiment_score": -0.5068156162805326
        },
        {
            "score": 4,
            "body": "There is also a scene from the trailer where she wipes the mirror and her image is replaces with Samara. Didn't watch it but I'm pretty sure thats the ending right there.",
            "author": "simpl3y",
            "parent_id": "t1_dd9kbbi",
            "time": 1486135390.0,
            "id": "dd9t7gw",
            "sentiment_score": 0.8180165744675552
        },
        {
            "score": 2,
            "body": "Not person you were replying to, but I'm also curious. Mind PMing me too?",
            "author": "nalivera",
            "parent_id": "t1_dd9t6nl",
            "time": 1486136599.0,
            "id": "dd9tp13",
            "sentiment_score": 0.2289569259344324
        },
        {
            "score": 2,
            "body": "The priest was keeping tabs on Samara. He says something along the lines of \"after the people of her island refused to accept her body, [I] stepped in and offered to take the bones to give her a proper burial\" It's during the scene where Holt and Julia first visit him. ",
            "author": "gingeguy22",
            "parent_id": "t1_ddbv8m8",
            "time": 1486379701.0,
            "id": "dddvm18",
            "sentiment_score": -0.28093756812789317
        },
        {
            "score": 8,
            "body": "Yeah, I'm in the same boat. I find myself looking up plots for them more often than not. I'm trying to get better at steeling myself against them, though.\n\nI need to watch *The Witch* too, I keep hearing it's great.",
            "author": "Ikea_Man",
            "parent_id": "t1_ddaj2s3",
            "time": 1486178778.0,
            "id": "ddaj8qw",
            "sentiment_score": 0.5025056728263708
        },
        {
            "score": 2,
            "body": "Go ahead and watch The VVitch. It's not super scary, seriously it's just a good movie. ",
            "author": "inb4zombies",
            "parent_id": "t1_ddaj2s3",
            "time": 1486224869.0,
            "id": "ddbdifu",
            "sentiment_score": 0.9271315394817077
        },
        {
            "score": 12,
            "body": "yea it was her solving it alone when her son watched it in another room one day",
            "author": "poland626",
            "parent_id": "t1_ddaks54",
            "time": 1486187423.0,
            "id": "ddaqumj",
            "sentiment_score": 0.4185141070947098
        },
        {
            "score": 3,
            "body": "Also that scene in Insidious where the medium/psychic lady is describing her vision. The movie wasn't as good as The Conjuring but that scene was great. ",
            "author": "Dan_IAm",
            "parent_id": "t1_ddb2bar",
            "time": 1486207606.0,
            "id": "ddb59uo",
            "sentiment_score": 0.7190269028978842
        },
        {
            "score": 2,
            "body": "Agreed, which is why I defend jump scares because if they're done well, I love them and think they're a lot of fun, like in Insidious, where the guy is walking outside of the window, and then is all of a sudden inside. A jump scare can make a scary scene, even scarier.",
            "author": "Y0ungPup",
            "parent_id": "t1_ddb2bar",
            "time": 1486281996.0,
            "id": "ddc97g8",
            "sentiment_score": 0.7735892100061532
        },
        {
            "score": 1,
            "body": "I need somebody to explain to me what is great about The Wailing, because I watched it with a friend a couple months ago and we both found it to be an utterly boring waste of our time. I can't think of a positive thing to say about it.",
            "author": "carolinemathildes",
            "parent_id": "t1_dd9zq90",
            "time": 1486356010.0,
            "id": "dddd7m9",
            "sentiment_score": 0.6649532649055596
        },
        {
            "score": 3,
            "body": "What is crazy is that he still got work after Batman & Robin, and not just any work, the dude wrote an Oscar winning drama.",
            "author": "NeoNoireWerewolf",
            "parent_id": "t1_ddaf8y3",
            "time": 1486225680.0,
            "id": "ddbdrvf",
            "sentiment_score": -0.24696267768046276
        },
        {
            "score": 2,
            "body": "So that explains this movie",
            "author": "diddles_giraffes",
            "parent_id": "t1_ddaf8y3",
            "time": 1486214750.0,
            "id": "ddb9ct9",
            "sentiment_score": -0.41202233871277527
        },
        {
            "score": 3,
            "body": "\"..I saw her face.\"\n\n***LOUD SCREECH***\n\nMe: OH FUCK THAT",
            "author": "Ser_Humpsalot",
            "parent_id": "t1_ddaxuz7",
            "time": 1486402410.0,
            "id": "dde7gd3",
            "sentiment_score": -0.5074352226531709
        },
        {
            "score": 2,
            "body": "I bought the first novel. Manga has never been my thing (the art style has never appealed to me so the amount of mangas I enjoy is quite limited) but I think I might give these a try if the novel turns out well. ",
            "author": "clwestbr",
            "parent_id": "t1_ddct13h",
            "time": 1486335919.0,
            "id": "ddcyzjr",
            "sentiment_score": -0.8108049190186069
        },
        {
            "score": 2,
            "body": "I think I've read all of Suzuki's books that have been translated into English. Birthday wasn't *great*, but worth it alone for the Lemon Heart story because it gives a TON of backstory on Sadako and is actually more of a romantic tragedy than anything. But if you can't find it, the Ring 0: Birthday movie was a pretty faithful adaptation with both REALLY scary and heartbreaking moments. I was able to buy both the book and movie on Amazon some years ago.\n\n Hopefully sometime soon the rest of the Ring-related books will be translated. I think there are two other books that came out within the last 5 years or so, but neither are available in English yet.",
            "author": "mooninitetwo",
            "parent_id": "t1_ddelenz",
            "time": 1486521714.0,
            "id": "ddgb1v9",
            "sentiment_score": 0.7644228766483858
        },
        {
            "score": 2,
            "body": "But I don't think he had any TVs in his house or whatever that building was he was in, so there was nothing for her to come out of until Julia came with her phone.",
            "author": "naphthoylindole",
            "parent_id": "t1_ddchpf8",
            "time": 1486295161.0,
            "id": "ddci6d9",
            "sentiment_score": -0.6650222736125457
        },
        {
            "score": 2,
            "body": "Wait to you need to be able to see Samara for her to kill you?",
            "author": "Ser_Humpsalot",
            "parent_id": "t1_ddchpf8",
            "time": 1486401140.0,
            "id": "dde72fm",
            "sentiment_score": -0.9785708659153634
        },
        {
            "score": 2,
            "body": "rebirth!",
            "author": "CIearMind",
            "parent_id": "t1_ddbktly",
            "time": 1486344178.0,
            "id": "ddd4eec",
            "sentiment_score": -0.21305942303046255
        },
        {
            "score": 7,
            "body": "> Sadako v. Kayako\n\nI'm disappointed that it wasn't an uplifting movie about their daily lives learning to get along.",
            "author": "nalivera",
            "parent_id": "t1_dd9q27m",
            "time": 1486136859.0,
            "id": "dd9tsom",
            "sentiment_score": 0.487303044831902
        },
        {
            "score": 3,
            "body": "Oh, that right there definitely is the ending! I never saw that, but that's disappointing.",
            "author": "nitrouspillow",
            "parent_id": "t1_dd9t7gw",
            "time": 1486170277.0,
            "id": "ddabjyo",
            "sentiment_score": -0.3808518411843884
        },
        {
            "score": 14,
            "body": "This is a spoiler-friendly thread, what is with people asking for PM's? \n\nA tail is someone that you pass the curse onto to prolong your survivability. It is what a college professor came up with to extend his life after watching the tape. He had a system in place that essentially allowed him to continuously extend his time, baiting college students to watch the tape in some crazy (but actually very interesting) underground campus club.",
            "author": "Cheeseburguh",
            "parent_id": "t1_dd9tp13",
            "time": 1486137532.0,
            "id": "dd9u20a",
            "sentiment_score": -0.8656551916413462
        },
        {
            "score": 1,
            "body": "I don't know what to say, I (and my friend + brother I watched it with) was enthralled by pretty much the entire movie. I suppose people just have different tastes. \n\nWhat's some of your favorite movies btw? Maybe we just don't have the same taste.",
            "author": "SeekerP",
            "parent_id": "t1_dddd7m9",
            "time": 1486356925.0,
            "id": "ddddwnc",
            "sentiment_score": 0.5452524794915612
        },
        {
            "score": 2,
            "body": "That's what the guy in the movie said.",
            "author": "vvsj",
            "parent_id": "t1_dde72fm",
            "time": 1486423148.0,
            "id": "ddeghz5",
            "sentiment_score": -0.5641661362792474
        },
        {
            "score": 1,
            "body": "Kayako has an Instagram that kinda has that.",
            "author": "bluscoutnoob",
            "parent_id": "t1_dd9tsom",
            "time": 1486168959.0,
            "id": "ddaad01",
            "sentiment_score": 0.5360871148378181
        },
        {
            "score": 6,
            "body": "What do you mean, \"prolong your survivability?\" In the first two, once you'd passed the tape on, you were safe.  \n\nWhat was the professor doing?",
            "author": "EnterprisingAss",
            "parent_id": "t1_dd9u20a",
            "time": 1486151103.0,
            "id": "dd9ynwd",
            "sentiment_score": -0.1756129587534343
        },
        {
            "score": 5,
            "body": "So  ... it's \"It Follows\" ?",
            "author": "zombiereign",
            "parent_id": "t1_dd9u20a",
            "time": 1486149034.0,
            "id": "dd9xxqr",
            "sentiment_score": 0.5155767659998414
        },
        {
            "score": 1,
            "body": "The person I replied to mentioned PMs  ¯\\\\_(ツ)_/¯\n\nThanks for explaining! ",
            "author": "nalivera",
            "parent_id": "t1_dd9u20a",
            "time": 1486138150.0,
            "id": "dd9uaf0",
            "sentiment_score": -0.5273119084930318
        },
        {
            "score": 1,
            "body": "Of all time, The Social Network, Zodiac, The Prestige are towards the top. Recently, Hell or High Water, Lion, Green Room, Manchester by the Sea.",
            "author": "carolinemathildes",
            "parent_id": "t1_ddddwnc",
            "time": 1486357449.0,
            "id": "dddeawp",
            "sentiment_score": -0.3480437225568527
        },
        {
            "score": 2,
            "body": "He was trying to find proof of a soul.",
            "author": "Vunks",
            "parent_id": "t1_dd9ynwd",
            "time": 1486190138.0,
            "id": "ddat2a8",
            "sentiment_score": 0.2643299329334792
        },
        {
            "score": 1,
            "body": "Surprised to see so many people saying this plot sounds interesting when it is the exact thing the characters in It Follows were doing.",
            "author": "NeoNoireWerewolf",
            "parent_id": "t1_dd9xxqr",
            "time": 1486226139.0,
            "id": "ddbdx2r",
            "sentiment_score": 0.20361119157348195
        },
        {
            "score": 1,
            "body": "I also really like the Social Network, Zodiac and The Prestige lol. I dunno what to say then, I find it equally perplexing that you couldn't find a good thing to say about The Wailing. I really really liked it (enjoyed it more than Zodiac for example).",
            "author": "SeekerP",
            "parent_id": "t1_dddeawp",
            "time": 1486357841.0,
            "id": "dddeljp",
            "sentiment_score": 0.6729911570558571
        },
        {
            "score": 2,
            "body": "That's also different to how the Ring virus worked in the first two films.",
            "author": "deh_tommy",
            "parent_id": "t1_ddbdx2r",
            "time": 1486247822.0,
            "id": "ddblbxr",
            "sentiment_score": -0.8706298360078066
        }
    ]
]