"name":"5rrasx","children":[{"displayText":"Cheeseburguh","name":"dd9pgje","children":[],"n_leaves":0,"body":"Priest: Samara can't hurt me cuz I'm blind lol\n\nSamara: bet","author":"Cheeseburguh","parent_id":"t3_5rrasx","score":229,"sentiment":0.44501272152788407},{"displayText":"Nooker","name":"dda9tyi","children":[],"n_leaves":0,"body":"Rotten tomatoes should make it 00% for its score cause a 0% is just a ring.","author":"Nooker","parent_id":"t3_5rrasx","score":113,"sentiment":-0.2637746577580118},{"displayText":"kurunner","name":"dd9lmvm","children":[],"n_leaves":0,"body":"Literally 95% jump scares in this film. Add to the fact that the ending is in the trailer (the mirror wipe that shows she's possessed), no wonder this thing was delayed for so long; they must have known it was awful.","author":"kurunner","parent_id":"t3_5rrasx","score":210,"sentiment":-0.585714815925358},{"displayText":"IanMazgelis","name":"dd9jkee","children":[],"n_leaves":0,"body":"Very interesting that the studio decided that they didn't want reviews being released before the movie, or even while the movie is out.","author":"IanMazgelis","parent_id":"t3_5rrasx","score":96,"sentiment":-0.5192490569524129},{"displayText":"enemyjake","name":"dd9qxif","children":[],"n_leaves":0,"body":"I wish they would've just stuck with the professor and his experiment's storyline. I was actually interested to see so many people watching the tape and what they would do to defend themselves. But then, they decide to go through with a half-assed plot that led to a shitty version of Don't Breathe. God, this movie is bad. ","author":"enemyjake","parent_id":"t3_5rrasx","score":95,"sentiment":0.31902087971176574},{"displayText":"Schlock_Supreme","name":"dd9j6qo","children":[],"n_leaves":0,"body":"*The Bye Bye Man* was at least fun in its ineptitude. This movie was just plain terrible AND boring to boot.","author":"Schlock_Supreme","parent_id":"t3_5rrasx","score":237,"sentiment":0.7175680731414262},{"displayText":"jdog90000","name":"dd9m0gm","children":[],"n_leaves":0,"body":"Holy shit. I'm not really a movie critic and I have pretty low standards when it comes to movies. This was fucking terrible. Scariest part of the movie was a dog barking and an umbrella opening. Also the dialogue was horrendous, and the main actress was just plain bad. They really managed to make an all around bad movie.","author":"jdog90000","parent_id":"t3_5rrasx","score":133,"sentiment":-0.9501059765271809},{"displayText":"bustedbeatbox","name":"dd9rujr","children":[],"n_leaves":0,"body":"Can someone who has seen it post a full spoiler plot recap?","author":"bustedbeatbox","parent_id":"t3_5rrasx","score":70,"sentiment":-0.686107557678735},{"displayText":"OceanCyclone","name":"dd9jprx","children":[],"n_leaves":0,"body":"Lame and forgettable.\n\nI can make you jump if I hide around a corner. It doesn't take talent. Horror should be about the transformative power of fear through cinema. I personally like my horror to take me to the edge whereby I come dangerously close to not liking the film.\n\nMartyrs and The Witch being great examples. Genuinely unsettling and unnerving. This is just trash.","author":"OceanCyclone","parent_id":"t3_5rrasx","score":180,"sentiment":0.374979685958448},{"displayText":"santablazer","name":"ddajxj9","children":[],"n_leaves":0,"body":"This has nothing to do with this awful movie, but when I watched the first one, I was like 10 and dial up Internet was still around. Anyway, I watched the first one for the first time on dvd and turned on the internet so nobody could call me. I thought I was so smart for doing that. I was a stupid kid. ","author":"santablazer","parent_id":"t3_5rrasx","score":42,"sentiment":-0.18249288270930908},{"displayText":"Pyrocube98","name":"ddaqol1","children":[],"n_leaves":0,"body":"  I felt during the second half of the movie the main girl just had a habit of saying what was happening. \"This is the church from the video\", \"Those are the birds from the video\", and \"That woman is the woman from the video\". It just really start aggravating me the entire last half.","author":"Pyrocube98","parent_id":"t3_5rrasx","score":42,"sentiment":-0.5906374464406741},{"displayText":"MandalorianLord","name":"dda6new","children":[],"n_leaves":0,"body":"Monster Trucks, xXx 3, Resident Evil, The Bye Bye Man and now this. I truly hate myself for having paid actual money to watch these films. ","author":"MandalorianLord","parent_id":"t3_5rrasx","score":81,"sentiment":-0.40019106290528783},{"displayText":"Correa24","name":"dd9lk5w","children":[],"n_leaves":0,"body":"I don't care for watching the movie, somebody spoil it for me in PM or comment, so I can somehow convince my girlfriend not to watch this. ","author":"Correa24","parent_id":"t3_5rrasx","score":64,"sentiment":-0.8430407952812407},{"displayText":"mouse_cunt","name":"dd9lfuh","children":[],"n_leaves":0,"body":"Critics: The horror genre is dying\n\nMe: No it's not! There are-\n\nRings: yes it is\n\nMe: No, but-\n\nRings: yes it is\n\nHonestly, where to even begin. This is fucking terrible. The cold open is kind of fun in an incredibly stupid way, but everything else is just not very good. It hints at doing something interesting early on with a weird ass Ring Club where everyone's watched the tape and it looks like one of those mission control rooms in spy movies and there are clocks on the wall counting down everyone's time until they die...but then immediately drops it and opts instead to copy and paste every major horror movie that's come out in the last few years.\n\nOuija, Don't Breathe, Final Destination, Insidious...they're all in this movie. Which wouldn't be too bad if the movie was scary or well-written or something. Hell, I'd even settle for actors who aren't terrible. Nope.","author":"mouse_cunt","parent_id":"t3_5rrasx","score":50,"sentiment":-0.8549585253695648},{"displayText":"lqtely","name":"dd9r4or","children":[],"n_leaves":0,"body":"Worst film of the year and it's only February.","author":"lqtely","parent_id":"t3_5rrasx","score":53,"sentiment":0.8296524873446243},{"displayText":"nitrouspillow","name":"dd9jht5","children":[],"n_leaves":0,"body":"Pretty mediocre movie. There isn't much to say about it other than it's fairly typical in my opinion, there were a couple of decent jump scares but nothing too crazy. I forgot I was watching *Rings* and thought that I might have been watching *Don't Breathe* again when Julia was in the blind guy's house. :P\n\nI'd pass on this one if you're looking for a good scare.","author":"nitrouspillow","parent_id":"t3_5rrasx","score":28,"sentiment":-0.21505823412294878},{"displayText":"topherthepest","name":"dd9oggm","children":[],"n_leaves":0,"body":"\"Well what is it... Chicken... or Steak?\"\n\"Ha... you're funny.\"\nI laughed REALLY hard at that cheesy line.","author":"topherthepest","parent_id":"t3_5rrasx","score":27,"sentiment":0.19423135864882557},{"displayText":"rdz1986","name":"ddc2tlv","children":[],"n_leaves":0,"body":"Rings makes Ring 2 look like The Ring.","author":"rdz1986","parent_id":"t3_5rrasx","score":28,"sentiment":0.28776929140765994},{"displayText":"JacobCrim88","name":"dda2rk8","children":[],"n_leaves":0,"body":"I can't believe this movie got made. I love the first one and feel like it's the *only* decent J-Horror remake. But it a came out so long ago. Is there really anyone who wants to see another Ring film after all the shitty sequels?\n\nJust give me: Sadako vs. Kayako (which I'm sure sucks too, but come on!)","author":"JacobCrim88","parent_id":"t3_5rrasx","score":25,"sentiment":-0.17688725860308918},{"displayText":"Penisgang","name":"ddakify","children":[],"n_leaves":0,"body":"a 0% DAMN","author":"Penisgang","parent_id":"t3_5rrasx","score":22,"sentiment":-0.21273005850524251},{"displayText":"None","name":"dd9r2a8","children":[],"n_leaves":0,"body":"Not being screened for critics so they can capitalize on the success of the first one before people find out they wasted their money? Lol","author":"None","parent_id":"t3_5rrasx","score":19,"sentiment":-0.39479011365932326},{"displayText":"Only_a_dog","name":"ddarf7k","children":[],"n_leaves":0,"body":"The scariest part of this film was when someone opened their umbrella quickly in the direction of the camera.","author":"Only_a_dog","parent_id":"t3_5rrasx","score":21,"sentiment":0.04356253492755191},{"displayText":"ivtecdoyou","name":"ddednit","children":[],"n_leaves":0,"body":"I'm late on this post, but I would love to commiserate with my friends here at /r/movies about all the TERRIBLE that was in this movie:\n\n* The cold open was the airplane scene. The dude was a TRUE DICK for getting on that plane knowing he was going to die. The fact that it led to Big Bang boy finding a VCR at a swap meet was straight up crazy town. \n\n* These people are supposed to be 18 in this... \n\n* For real, who thought that the dialogue in the bedroom scene between the 'couple' was a good idea? Followed shortly by the \"I'll miss your smell\" and having the dude take his shirt off??? WTF?\n\n* Could this be the craziest/stupidest person ever in a horror movie? (the girlfriend) She texts/calls and gets no response, okay makes sense to worry. She gets a Skype from a girl IN HIS BEDROOM, so she drives up to try and stalk him and then DIGS THROUGH HIS PERSONAL PROPERTY. \n\n* The previous part also contains maybe the worst dialogue delivery since \"The Room\", along the lines of 'I just had the weirdest conversation of my life with a girl that called me' something like that, so bad.\n\n* Ok, I've stalked him to find out something isn't right. I've discovered that he is part of some strange killer VHS tape plot. WHAT DO I DO??? I watch the video tape and will sacrifice myself because I'm 18 and am in love with this cringe machine. \n\n* Umbrella opening jump scare\n\n* Fast forward to Vincent D'onofrio chewing scenery, while explaining 100% of the stuff you don't get because of bad movie making (Oh, he's blind? Oh, I totally wonder where they are taking THAT piece of business.)\n\n* Track back/maybe forward who knows. Cops dicking around with an empty car instead of HELPING A MAN UPSIDE DOWN IN A CAR DIRECTLY IN FRONT OF THEM. The movie then turns to Final Destination for a second with some power poles.\n\n* Fast forward to \"Don't Breathe\" lite for about 10 minutes and SAMARA IS FREED SO YOU CAN BE FRIENDS NOW HOORAY! \n\n* Oh wait, your possessed now and they showed it all in the trailers and now Samara can magically imbue your Mac with RAM to be able to process thousands of simultaneous emails/uploads. Also those SICK instant email responses, cuz millennials get on those email chains quick right?\n\nI've seen every major horror release of the past 5 years, and in my opinion this was the worst one. Bye Bye Man was a close 2nd. ","author":"ivtecdoyou","parent_id":"t3_5rrasx","score":20,"sentiment":-0.9319598876291628},{"displayText":"TehAlpacalypse","name":"dd9jlii","children":[],"n_leaves":0,"body":"I just got out of the showing at the Atlanta Regal.\n\nI had no idea what to expect since I got the tickets for free from a co-worker so I was able to go in with no expectations.\n\nWow this movie was bad. I have to say it was probably in the bottom 25% of movies I've seen.\n\nFirstly the dialogue was like listening to a bad audio dub of a Japanese RPG. I was outright laughing at multiple points and so were other people. People would randomly come up to the main characters and introduce themselves while characters are doing illegal things with zero explanation.\n\nThe acting was terrible. Budget Zac Effron and Kristen Stewart were bad, and the fact that these obviously mid/upper 20's people were supposed to be college freshmen brought me out of the movie completely.\n\nThe writing in general was bad. *Spoilers*\n\nWhy did the people in the study not just send the video to their friends like at the end? How did 12 people get chosen enough to find the priest but somehow people havent started to put two and two together? How did missing sex dungeon not not draw any interest from police? How has no one heard about this professors sketchy ass research lab? When I did a psych study for the university there was so much oversight it boggles my mind no one thinks twice.\n\nReally the only redeeming quality was that I recognized locations on my college campus a ton. Probably a 3.5/10 from me, would not recommend unless you're a big series fan or your ticket is free. ","author":"TehAlpacalypse","parent_id":"t3_5rrasx","score":16,"sentiment":-0.1580769043038266},{"displayText":"JakkuScavenger","name":"ddactwv","children":[],"n_leaves":0,"body":"Wasn't there a completely different backstory for Samara's mother in The Ring Two?","author":"JakkuScavenger","parent_id":"t3_5rrasx","score":17,"sentiment":0.25022153498035626},{"displayText":"NotTheBees_ARGH","name":"ddbmw0d","children":[],"n_leaves":0,"body":"The very first scene of the movie is shockingly and hilariously bad. When he starts talking abou the tape out of nowhere people in my theater just burst out laughing. What a terrible movie","author":"NotTheBees_ARGH","parent_id":"t3_5rrasx","score":18,"sentiment":-0.01975920609245807},{"displayText":"blankvisual","name":"dde7k55","children":[],"n_leaves":0,"body":"A true masterpiece, I'M FUCKING KIDDING.\n\n\nI AM FUCKING FURIOUS I ACTUALLY MOVED MY PHYSICAL BODY INTO MY CAR, DROVE TO THE THEATER AND SAT DOWN FOR TWO FUCKING HOURS AND SAW THIS MOVIE. \n\nThis movie was STRAIGHT GARBAGE. DO NOT SEE THIS MOVIE WHATEVER YOU DO. \n\nTHERE IS A FUCKING JUMPSCARE, I KID YOU NOT, OF AN UM-FUCKING-BRELLA OPENING. I AM NOT KIDDING. I REPEAT, I AM NOT KIDDING. \n\nTHE SCARIEST FUCKING THING ABOUT THIS MOVIE, IS KNOWING THAT 33 MILLION DOLLARS WAS SPENT TO MAKE THIS FUCKING GARBAGE. WHERE DID THE FUCKING MONEY GO? SERIOUSLY, IT'S FUCKING DISTURBING. WHERE DID IT GO? WHERE DID IT GO?\n\nHoly mother fucker, this might be in top 5 worst movies I've EVER SEEN. HOLY SHIT.","author":"blankvisual","parent_id":"t3_5rrasx","score":46,"sentiment":-0.05071233156739696},{"displayText":"deh_tommy","name":"ddbkhja","children":[],"n_leaves":0,"body":"I don't know why, but I just burst out laughing at the moment when [Samara attacks the airplane. I'm open to new interpretations and whatnot, but when and how could she have possibly gained the power to hijack all those monitors? In fact, what's the point of copying the video and passing that around if she can just show said video to anyone within the vicinity of a cursed person? Why even kill all those people on the plane if she was only after that one passenger?](#spoiler)\n\nDid anyone else find the scene to be funny?","author":"deh_tommy","parent_id":"t3_5rrasx","score":16,"sentiment":0.28251123227319397},{"displayText":"mrmcspicy","name":"ddan6jj","children":[],"n_leaves":0,"body":"Okay so saw an Advance Screening yesterday so i'm glad I didn't spend any money on this trash. Such a disappointment from the classic original Ring. Horrible slow paced, laughable acting, nothing but cheap jump scares, no tension or creepiness, the plot twist was okay but not worth the stupid character decisions, cringeworthy dialogue/characters, and plot holes. The CGI was godawful and the whole concept of the movie was goddamn stupid: \"There's a movie....INSIDE THE MOVIE??!!!??\"","author":"mrmcspicy","parent_id":"t3_5rrasx","score":14,"sentiment":-0.10243873291458261},{"displayText":"Verreaux","name":"ddbf1z3","children":[],"n_leaves":0,"body":"So this is basically Don't Breathe 2:  Elect-ring Boogaloo.","author":"Verreaux","parent_id":"t3_5rrasx","score":13,"sentiment":-0.15022920645032634},{"displayText":"Jaredocobo","name":"ddbo7ff","children":[],"n_leaves":0,"body":"As someone who has been patiently awaiting the return of Samara this is very upsetting. The original pitches and rumors for the sequel sounded infinitely better than what we were served. Once I saw the two month delay I new bad times were ahead.  Samara deserves better #imwithher. ","author":"Jaredocobo","parent_id":"t3_5rrasx","score":14,"sentiment":-0.6202840114056771},{"displayText":"winterd","name":"dda80y2","children":[],"n_leaves":0,"body":"Is it at least funny-bad?","author":"winterd","parent_id":"t3_5rrasx","score":12,"sentiment":-0.2103528493670821},{"displayText":"ev6464","name":"ddaoxq4","children":[],"n_leaves":0,"body":"How the hell do they keep fucking this up? Making a good sequel to the Ring shouldn't be difficult. ","author":"ev6464","parent_id":"t3_5rrasx","score":13,"sentiment":0.34466728710022165},{"displayText":"ndrw17","name":"ddb5v3r","children":[],"n_leaves":0,"body":"Typing this on my phone, while still in the theater building, just finished the film, so here are my immediate thoughts. \n\n\nThe casting was terrible. While the boyfriend didn't distract me very much, neither did Gabriel, the Priest and Julia were horrid. The actress playing Julia suffered from the bad actress sy drone of feeling stoff, unable to express emotions other than a blank face, and (as used by another member here) felt like she was reading from queue cards. \n\nI did like that they reused some of the original score, however, it didn't properly blend into the new one, which wasn't that great. I wished they would have also kept more of the blue filter as used in the original instead of the grimey green for this one. \n\nThe 7 Club was a much better plot point for a sequel than the direction this one ultimately took. They introduced this whole idea of Samaras father, which ultimately falls apart during the third act by numerous plot holes. \n\nI actually found the tape within a tape thing interesting, and it was well executed. However, the idea that Samara was simply trying to be reborn into this world through someone's body is a little ambiguous (and was already done in Part 2). The Priest states that 11 other people got close to finding her body, but this begs the question as to why Julia was chosen versus anyone else watching the tape. \n\nAlso, am I suppose to infer that Samaras bones being cremated was suppose to allow her to actively possess someone? She was pretty damn close to getting Aiden (I mean, she basically did). And before anyone says this disregards 2, it doesn't. Not only did they use the same name for the mother, they also showed the same photographs that Evelyn had stored in the suitcase in Part 2. It's clearly part of the time line. \n\nHowever, the timeline is still all *beep* up. They never explain what happened to Evelyn, although the idea that she wanted to kill Samara remained, as in 2. \n\nThe opening was far too rushed and not at all suspenseful. The original was great because it focuses more on suspense and the discovery aspect than it does jump scares. And while sure, Rachel had the nightmare, and the vision in the well towards the end, she was not plagued by cheap visions to help advance the plot. Literally, that was the entire decide used to advance the story. Instead of them really digging to find stuff, they would go \"Let's go to this town, where I will have a random vision while I'm awake so that I can tell the audience what happened back in the day, instead of using a well driven story and clues as in the original.\" \n\nSkye (don't even get me started on her, I still don't understand why anyone casts her after Scream 4), states that things are getting worse, the visions more intense, and that Samara is getting pissed about the 7 club. Nice way to introduce something into the plot that never gets explored. \n\nAlso slightly confused by the climax. Julia and the tape time frame becomes meaningless. Also, if Samara had the power to restore eyesight, then what was the purpose of having him be blind in the first place? \n\nIt was established she can only kill you after 7 days once you watch the tape. Now she can appear whenever to kill you? \n\n\n\n\nOverall, the film is watchable. While I don't hate 2 like everyone else (it is still no where near on par with the first), I would would say this falls slightly beneath that. This film could have excelled it they focused on the more interesting story of the Seven Club, and properly structured the father storyline without leaving gaping plot holes. Not to mention better tension, less cheap jump scares, and a cast who can act. \n\n\n\nSay what you want about The Ring Two, but at least they casted solid actors.","author":"ndrw17","parent_id":"t3_5rrasx","score":12,"sentiment":0.21232363836171086},{"displayText":"Czechmix","name":"dd9ky74","children":[],"n_leaves":0,"body":"For those who have seen it -- is there a trailer to *IT* attached?","author":"Czechmix","parent_id":"t3_5rrasx","score":11,"sentiment":0.2185148020769041},{"displayText":"spacednlost","name":"dda0wm0","children":[],"n_leaves":0,"body":"Akiva Goldsman<shudder>","author":"spacednlost","parent_id":"t3_5rrasx","score":10,"sentiment":-0.9513400365663249},{"displayText":"PeterLeroy","name":"ddbgx0x","children":[],"n_leaves":0,"body":"Can someone explain to me how can Johnny Galecki, a guy earning 1 million per BBT episode, get involve in such a movie ? I mean, is that contractual ? I find it really intriguing. \n\n","author":"PeterLeroy","parent_id":"t3_5rrasx","score":12,"sentiment":0.9800725460884556},{"displayText":"thefairlygoodgatsby","name":"ddbtc8l","children":[],"n_leaves":0,"body":"This one was awful. They just took the most recognizable imagery from the first Ring movie and tried to make a sequel with no consideration for what actually made the first one great. The atmosphere and tone felt completely off. There was 0 real tension or mystery. The plot was dumb, the lead actress was horrible, and it just felt like a giant insult to the original film.","author":"thefairlygoodgatsby","parent_id":"t3_5rrasx","score":20,"sentiment":-0.17429520713115143},{"displayText":"Krettlecorn13","name":"ddavq3g","children":[],"n_leaves":0,"body":"Are the faces of the victims at least creepy? That's was one of the best parts of the first Ring. Really left an image in your head.","author":"Krettlecorn13","parent_id":"t3_5rrasx","score":11,"sentiment":-0.4671030983918285},{"displayText":"Ouxington","name":"ddjkuob","children":[],"n_leaves":0,"body":"This is what bugs me about Hollywood.  The Ring worked because it had an adult woman, that was an investigative journalist trying to unravel Samara's video.  In Rings we get two 18 year old morons that flit from plot point to plot point based mostly on lucky guesses a book with all the answers they were literally handed.  And this is fine if you are trying to start a new franchise but all of the people that watched and liked The Ring are in their 30's and 40's now, we are the ones excited to see a continuation of the mythos. Rings could have been a great movie if they had focused on the Professor and made it a story about him using science to test Samara and her boundaries instead of 2 empty-headed jerkbait kids.  ","author":"Ouxington","parent_id":"t3_5rrasx","score":10,"sentiment":-0.0655230102396751},{"displayText":"ILikeBigButtss","name":"dd9poze","children":[],"n_leaves":0,"body":"I saw this movie for free and I still demand a refund. I will never get those 1.5 hours of my life back.\n\nThe writing was awful. I'm not sure why the scene on the airplane was included. I didn't give a damn about Julia or Mr. Cardboard cutout. Some of the special effects were straight out of baby's first 3d modeling class. Let's not even mention the ending. Just all around awful.","author":"ILikeBigButtss","parent_id":"t3_5rrasx","score":25,"sentiment":-0.4436909071877988},{"displayText":"haunthorror","name":"dd9vhem","children":[],"n_leaves":0,"body":"I would give it a 5/10 I was never bored and was interested to see where it goes, but I never had a moment where I was scared or really on edge.  I also did not like the last scene.  Dont hate myself for watching it but have no need to see it again.  ","author":"haunthorror","parent_id":"t3_5rrasx","score":9,"sentiment":0.6202044922179084},{"displayText":"fantasyfeasts","name":"ddaxkbn","children":[],"n_leaves":0,"body":"I highly recommend reading the books. This movie takes the mutation idea from the books and does nothing with it; the 2nd book in the series just goes full bore into that concept.","author":"fantasyfeasts","parent_id":"t3_5rrasx","score":8,"sentiment":-0.608720525703764},{"displayText":"fuckthemodlice","name":"ddh4mqn","children":[],"n_leaves":0,"body":"The main girl's acting was distractingly bad. ","author":"fuckthemodlice","parent_id":"t3_5rrasx","score":10,"sentiment":-0.8442674784756201},{"displayText":"Doro1234","name":"ddax17b","children":[],"n_leaves":0,"body":"7% on RT? What happened? I had no intention of seeing the movie before but if someone can tell me in great spoilerific detail why its terrible, that would be nice!","author":"Doro1234","parent_id":"t3_5rrasx","score":9,"sentiment":-0.8640217862870083},{"displayText":"vvsj","name":"ddbefob","children":[],"n_leaves":0,"body":"What was the point of Samara sending everyone the video tape online now that she was already in a host body on Earth and could wreak havoc that way?","author":"vvsj","parent_id":"t3_5rrasx","score":7,"sentiment":-0.5519095549092217},{"displayText":"Rudarnik","name":"ddc4ct7","children":[],"n_leaves":0,"body":"Just came home after watching it. As a horror movie lover i'm not really impressed. Here is my spoiler free opinion.\n\nThe movie has too many \"filler\" scenes trying to explain the story which is not even that hard to figure out at the first sentence they say. The atmosphere isnt dark and scary its just walking from one scene to another with the ocassional jump scare which i hate. If a horror movie has to have jump scares to scare you its a bad written movie. Movies like conjuring kept me on my toes for 2 hours. \n\nIts an ok movie. They tried to polish up the see tape die story a bit which actually had some potential but was not very well written. A solid 5/10.\n\n","author":"Rudarnik","parent_id":"t3_5rrasx","score":7,"sentiment":-0.2893586824610974},{"displayText":"JJCXV","name":"dd9yufl","children":[],"n_leaves":0,"body":"So how does Leonard get killed then?","author":"JJCXV","parent_id":"t3_5rrasx","score":7,"sentiment":-0.31008976562009005},{"displayText":"mathpipebomb","name":"ddg2ext","children":[],"n_leaves":0,"body":"Watched Rings last night. It wasn't as bad as people say it is, it was pretty darn average. \n\nIt felt like the film was rushed with too many plot holes. \n\nBefore the film, i knew it wouldn't live up to the hype. Difference between The Ring films and Rings was there wasn't much plot holes in the original films - and that's good. \n\nOriginal films had the chance to develop their character, develop the story-line (not in a rushed way). Yes i know it was the first film of Rings, but they could have left some plot holes for the second film. \n\n5/10. ","author":"mathpipebomb","parent_id":"t3_5rrasx","score":7,"sentiment":-0.6540311642623329},{"displayText":"deepintheupsidedown","name":"ddbe78r","children":[],"n_leaves":0,"body":"Yay!!! This looks like a fun soft reboot!!!\n\n>Rotten Tomatoes: 7%\n\nThat's not good.\n\n>Metacritic: 19/100\n\nThat's not good either.\n\n>After Credits Scene?: No\n\nHey, that's neutral!\n\n>Typing this on my phone, while still in the theater\n\nTHAT'S NOT GOOD AT ALL! CAN'T EVEN WAIT FOR THE MOVIE TO END TO TRASH IT CUZ IT'S *JUST THAT BAD*?!? YIIIIKES!!!","author":"deepintheupsidedown","parent_id":"t3_5rrasx","score":18,"sentiment":-0.3536983886365894},{"displayText":"zrox456","name":"dd9rri8","children":[],"n_leaves":0,"body":"I actually really enjoyed this movie. I'm a huge fan of the Ring and Ringu films so I guess I'm pretty biased, I went to see a Ring movie and that's basically what I got. I enjoy that it went a more unique route than the previous 2 American films went and I even enjoyed the end of it even if it has been done before. \n\nIn comparison to normal movies yeah its bad, but I enjoy these movies so I was happy. \n\n[The area under the church for some reason creeped the hell out of me, I really would hate to be there at all, let alone in the middle of the night.](#spoiler)\n","author":"zrox456","parent_id":"t3_5rrasx","score":14,"sentiment":0.7443173965133163},{"displayText":"bluscoutnoob","name":"ddah5hm","children":[],"n_leaves":0,"body":"For those who have seen it, there's a shot in the trailer that suggests the movie leaks onto the Internet. Does this actually happen?","author":"bluscoutnoob","parent_id":"t3_5rrasx","score":12,"sentiment":0.7258788007477279},{"displayText":"sevenw1nters","name":"ddati2f","children":[],"n_leaves":0,"body":"I had a special history with the Rings franchise because I remember The Ring being the first horror movie I ever watched as a kid that really scared me.\n\nJohnny Galecki and Vincent D'Onofrio I thought did an excellent job in their roles. Unfortunately the main couple that were clearly late 20-somethings cast at college freshmen weren't quite as inspiring. \n\nI thought the movie felt more like a psychological mystery with a darker twist than an actual horror film. Meaning I was never really scared while watching the film, for a part of the movie even Samara could be considered on the good team which makes it hard to be scared in that scenario. The film felt more like a reboot than a sequel as well. There were a few plot points I found intriguing, mostly I liked the ending, some might call it cliche but I didn't see it coming and it had the right feeling of how a horror movie should end imo.\n\nOverall I would say the movie was decent. I don't think it lived up to the reputation the first movie has and by no means am I saying everyone should go out and see it but I certainly don't think it deserves the 1/10 and 2/10 reviews it seems to be getting. It was a serviceable film and wasn't any worse than most of the horror movies that have came out recently. I think a 6/10 or 7/10 is a fair score.\n\n","author":"sevenw1nters","parent_id":"t3_5rrasx","score":12,"sentiment":-0.16293061313972568},{"displayText":"mardfet","name":"dd9jm0r","children":[],"n_leaves":0,"body":"What is the ending? I keep hearing people talk about how terrible it is. ","author":"mardfet","parent_id":"t3_5rrasx","score":6,"sentiment":-0.2859516195747571},{"displayText":"topherthepest","name":"dd9nwr8","children":[],"n_leaves":0,"body":"Jessica Ablish was monotone for EVERY one of her lines. I rolled my eyes every time she spoke. I will say the movie has a slightly creative way of being unique, and for a lot of it, I did feel callbacks to the first movie... but the bad acting and the fact that the final scene was in the trailer... I say pretty forgettable movie.","author":"topherthepest","parent_id":"t3_5rrasx","score":7,"sentiment":-0.8907304748077662},{"displayText":"BansheeJam","name":"ddabt9u","children":[],"n_leaves":0,"body":"Can someone put the airplane scene into context? I feel like that would have to be  the last scene of the movie and if its not, how does it fit into the rest of it?","author":"BansheeJam","parent_id":"t3_5rrasx","score":7,"sentiment":-0.07723101159035828},{"displayText":"Rosebunse","name":"ddb11oa","children":[],"n_leaves":0,"body":"7% on Rotten Tomatoes? Ouch.","author":"Rosebunse","parent_id":"t3_5rrasx","score":7,"sentiment":-0.24966057167419264},{"displayText":"austine567","name":"ddcjh5z","children":[],"n_leaves":0,"body":"This movie was somehow worse than I was expecting and I wasn't expecting much. Bad Story, bad acting, nothing scary, bunch of filler, not worth watching imo","author":"austine567","parent_id":"t3_5rrasx","score":6,"sentiment":-0.678185104180169},{"displayText":"SargeantM","name":"ddcpyvn","children":[],"n_leaves":0,"body":"I honestly liked the premise of a university professor doing research in the video on test subjects. But the movie went downhill after the lead actress decides to investigate.  What a snoozefest.  ","author":"SargeantM","parent_id":"t3_5rrasx","score":5,"sentiment":0.49649341743060216},{"displayText":"GotNoChill","name":"dddcxfd","children":[],"n_leaves":0,"body":"This movie pulled a suicide squad. Half the cool scenes in the trailer aren't even in the movie lmao this is trash ","author":"GotNoChill","parent_id":"t3_5rrasx","score":6,"sentiment":0.8874295046674148},{"displayText":"Vunks","name":"dd9jxgv","children":[],"n_leaves":0,"body":"This is an unrepentant pile of shit. The acting in this movie was the scariest part.","author":"Vunks","parent_id":"t3_5rrasx","score":15,"sentiment":0.15921576268637128},{"displayText":"discoparty","name":"dd9peob","children":[],"n_leaves":0,"body":"Very predictable and boring\n\n\nEveryone laughed when the 7th floor secret \"lounge\" was shown. That seemed interesting at first as a different take on the story, then it went off to reboot the first movie.","author":"discoparty","parent_id":"t3_5rrasx","score":10,"sentiment":-0.5272698372232087},{"displayText":"CaptainWalton","name":"ddflkee","children":[],"n_leaves":0,"body":"I know this wasn't a great movie, but I have a fantastic idea for a sequel. It would be called Rings: The Samara Cycle. \n\nThe film takes place ten years after the events of Rings. In the space of time between the two films, a lot has happened to reshape the world. The video went viral, causing thousands of people to perish. But on the plus side, humanity has figured out the mystery of the video and thus found a way to beat it. Building off of Professor Burke's \"tail\" experiment, we have figured out a way to perpetually exploit this system, creating a continuous loop of tails, or a cycle as it is called. To put it simply, Person A copies the file and shows Person B who copies the file and shows Person C who copies it and shows Person A. Thus creating a circle... a ring. \n\nIn this world, everyone knows about the tape mythos but it's a very taboo topic. It's gained a disturbing underground cult following. Weirdos will go to clubs (just like Club 7 in the Rings film) just to watch the tape and see how close they can get to the deadline without dying. Some people get off on it, like a fetish. Other people do it for the rush, like dumbass college kids. There are also people called Cyclers, who make it their job to find tails for a price. They work under the table and are hard to track down. \n\nThe conflict of the film arises when the whole world loses Internet and becomes crippled. Don't ask how. Just picture one giant server out in rural Idaho that has all the Internet on a big cloud, and it shuts down. The point is, the world no longer has Internet. Maybe it was a virus that Samara made. I'm going for a post-apocalyptic vibe. So now the world is in a state of panic. If you watched the tape and didn't pass it off, you're screwed. So the whole world is scrambling to find the long lost hard copies, which are incredibly valuable and circling around the black market. \n\nThe film follows a hacker named Grady (codename: Demagogue), who is trying to track down a hard copy, not for altruistic purposes, but simply to make a shameless profit. Somewhere along the way, he teams up with a 10-year-old girl named Beth, who is a jaded spunky orphan who reminds Grady a lot of himself. They go searching for this tape around the area where the servers crashed in Idaho. \n\nLong story short, it turns out that Beth is Julia and Holt's daughter from after the events of Rings took place. She is the new Samara (the \"rebirth\"). Julia and Holt died after giving birth to her (because she's evil) so Beth grows up as an orphan. \n\nI realize there's some plot holes I need to fill in, but you get basic idea. Oh, and also, it's very important that the film doesn't take itself too seriously. The tone should be similar to Hackers or some other shlocky sci-fi movie from the 1990s. Feel free to help me continue writing this masterpiece. We can start a Google Doc. ","author":"CaptainWalton","parent_id":"t3_5rrasx","score":23,"sentiment":-0.17035004100868822},{"displayText":"StasisNation","name":"ddar6m6","children":[],"n_leaves":0,"body":"Haven't seen the movie yet, probably going to just cause i hate my eyeballs.\n\nThis movie sounds like the IP ownership was about to expire so the owners are just making one more cash grab. Kinda like how FOX keeps putting out brain-meltingly bad Fantastic 4 movies just to keep the rights to it. Does anyone know if that's the case for this?","author":"StasisNation","parent_id":"t3_5rrasx","score":10,"sentiment":0.19811083197403967},{"displayText":"llames","name":"dd9ras1","children":[],"n_leaves":0,"body":"I laughed out loud at work when I read the plot synopsis, that: \"there is a “movie within the movie”\". \nThen everyone looked at me weird, I haven't read anything so ridiculous and destined for terrible. ","author":"llames","parent_id":"t3_5rrasx","score":5,"sentiment":0.2189719349418877},{"displayText":"bigpig1054","name":"dd9rnqy","children":[],"n_leaves":0,"body":"It was too bland, too cookie cutter.\n\nThere was only one scene with a feeling of sustained dread or tension (when she's in the priests house at the end). The rest is just jump scares after jump scare in between scenes of boring plot development.\n\nI expected nothing and I'm still let down. ","author":"bigpig1054","parent_id":"t3_5rrasx","score":5,"sentiment":-0.11132142625585151},{"displayText":"NotTheBees_ARGH","name":"dda849a","children":[],"n_leaves":0,"body":"I remember Ring","author":"NotTheBees_ARGH","parent_id":"t3_5rrasx","score":5,"sentiment":0.04946659097598416},{"displayText":"GlamourTits","name":"ddcniex","children":[],"n_leaves":0,"body":"The lead actress sucked, she sounded like she was having an orgasm through the entire movie.","author":"GlamourTits","parent_id":"t3_5rrasx","score":5,"sentiment":0.7684571348076488},{"displayText":"remora2626","name":"ddf3jfo","children":[],"n_leaves":0,"body":"did anyone else catch perhaps a subtle in-joke or found it coincidental that gabriel used the elevator and julia's seemed to be out of service (before the key) - bbt reference?  i was waiting for someone to *knock knock knock, gabriel?  knock knock knock, gabriel?...*\n\nalso, i know it ruins the canon/whole point of story, but since it's near garbage anyway, why doesn't anyone who needs a tail visit terminally ill patients, \"vegetables\" as well?  some of those people would be glad to end their suffering earlier.  well, besides the final seven days of...","author":"remora2626","parent_id":"t3_5rrasx","score":6,"sentiment":-0.4081574746299337},{"displayText":"dipperdipperpines19","name":"ddhhd58","children":[],"n_leaves":0,"body":"The film felt rushed, there was really no good character setup, development or backgrounds. There were lots of plot holes and questions I had one of them: How was Samara's body/skeleton in the closet if Rachel finds her body in the well at the end of the first movie? And the scares weren't even scary the hair pull out of throat was done before and all the jump scares were so cheap I barely jumped, also the main leads acting is so horrible, especially when she's solving parts of the puzzle \"you were pregnant\" \"your samaras mother\" \"you were kept down here\" \"that bird, it was the bird from the video\" thanks for telling us we couldn't figure that out on our own.","author":"dipperdipperpines19","parent_id":"t3_5rrasx","score":5,"sentiment":0.8888554494165306},{"displayText":"SACKO_","name":"dd9qgsc","children":[],"n_leaves":0,"body":"I've seen shitty horror movies on Netflix that were better than this movie. ","author":"SACKO_","parent_id":"t3_5rrasx","score":10,"sentiment":-0.421243959531161},{"displayText":"NiceRepostBROoO","name":"dddbpf6","children":[],"n_leaves":0,"body":"ENDLESS TRASH!!!!","author":"NiceRepostBROoO","parent_id":"t3_5rrasx","score":8,"sentiment":0.4926244229977641},{"displayText":"jiodjflak","name":"ddel86c","children":[],"n_leaves":0,"body":"Worst acting I've seen in a movie that actually made it to theaters.  And what was the purpose of the cold open?  It had nothing to do with the rest of the movie.","author":"jiodjflak","parent_id":"t3_5rrasx","score":9,"sentiment":0.9751394265794027},{"displayText":"makeshiftpatriot","name":"dd9jgzm","children":[],"n_leaves":0,"body":"So it's... Infinite Jest? ","author":"makeshiftpatriot","parent_id":"t3_5rrasx","score":3,"sentiment":-0.27638157496017524},{"displayText":"The_Frisky_Firefly","name":"dd9opp7","children":[],"n_leaves":0,"body":"(Slightly attractive ) Bella and Edward try to solve the ring case","author":"The_Frisky_Firefly","parent_id":"t3_5rrasx","score":5,"sentiment":-0.06863704617829414},{"displayText":"sumofawitch","name":"ddb1yih","children":[],"n_leaves":0,"body":"I really love Vincent D'Onofrio, he's an awesome actor. Even his voice was different as the Kingpin. \n\nBut he does make some terrible movie choices. What a hell have I just watched?","author":"sumofawitch","parent_id":"t3_5rrasx","score":5,"sentiment":0.47120440505647054},{"displayText":"ThatSithOverThere","name":"ddcboxz","children":[],"n_leaves":0,"body":"Vincent D'Onofrio was good, and the ending does set up an interesting idea for a sequel. Aside from that, it was just another bland jumpscare fest with poor performances and a serious case of Fuck You Editing in the 3rd act.","author":"ThatSithOverThere","parent_id":"t3_5rrasx","score":4,"sentiment":0.034143340781187526},{"displayText":"RamaAnthony","name":"ddcv64z","children":[],"n_leaves":0,"body":"Welp, they could have just  try to recreate the atmosphere that made the American Ring good.\n\nOr faithfully adapt the book for a hard-reboot. The story of the book is more relevant than ever, it's a shame they missed the chance. I mean this one already borrowed the elements from the book : the tape 'mutated' into different forms, Samara being a rape victim, and rebirth of Samara / Sadako with a human vessel. ","author":"RamaAnthony","parent_id":"t3_5rrasx","score":4,"sentiment":0.9886697017134627},{"displayText":"its_the_green_che","name":"ddd7asa","children":[],"n_leaves":0,"body":"There's definetly going to be a sequel. So Samara was reborn as Julia? Or born into Julia or whatever. I didn't know how to put it. \nIt wasn't a terrible movie but it wasn't great. The plane scene did make me laugh though. \nSo technically the creepy priest pervert was right and Julia should've listened. At the beginning she said she didn't want anyone to die because of her..she just doesn't know what kind of hell she's unleashed now. \nIt went different as expected certainly. I thought Julia would get pregnant and Samara would be reborn as the baby or whatever. \nBut what is Samara's motive exactly? Why did she need a human host?","author":"its_the_green_che","parent_id":"t3_5rrasx","score":3,"sentiment":0.923679589516547},{"displayText":"Futurames","name":"ddimip5","children":[],"n_leaves":0,"body":"So was this movie supposed to be a fresh start from the other movies? Because the plot involving Samsara's parents was completely different than what we learned in the first two. \n\nIt's a shame, the first one is one of my favorite movies.","author":"Futurames","parent_id":"t3_5rrasx","score":4,"sentiment":-0.12423710196967974},{"displayText":"jonsnow312","name":"ddizvij","children":[],"n_leaves":0,"body":"Blair Witch and The Ring were my 2 favorite horror movies as a \"tween\". PLEASE STOP RUINING MY MOVIES","author":"jonsnow312","parent_id":"t3_5rrasx","score":3,"sentiment":-0.31756158825481684},{"displayText":"_YerDa","name":"ddjlrr2","children":[],"n_leaves":0,"body":"Of all the things that scared me in this film it was when they put an umbrella up outside of the church, great horror","author":"_YerDa","parent_id":"t3_5rrasx","score":3,"sentiment":-0.6170343472852993},{"displayText":"yellowbus12","name":"ddfq4ig","children":[],"n_leaves":0,"body":"Watch this if you're trying to fix your sleep schedule. It did for me!","author":"yellowbus12","parent_id":"t3_5rrasx","score":6,"sentiment":-0.04600998963551506},{"displayText":"AvantAveGarde","name":"ddi37w7","children":[],"n_leaves":0,"body":"Typical remake garbage, somehow managed to do worse than the original (not) surprisingly, if you're on the fence about this movie, just give it a pass.","author":"AvantAveGarde","parent_id":"t3_5rrasx","score":7,"sentiment":0.7595797714242305},{"displayText":"DragonFireDon","name":"dd9m0lt","children":[],"n_leaves":0,"body":"Guess it won't scare me based on all the crappy reviews.","author":"DragonFireDon","parent_id":"t3_5rrasx","score":3,"sentiment":-0.7703572649530297},{"displayText":"dragonman8001","name":"ddc34lu","children":[],"n_leaves":0,"body":"So someone tell me if i'm remembering right. Didn't Samara's mom in the Ring 2 imply that her father was some kind of otherworldly being?\n\nAm I remembering wrong? Because when the priest was revealed to be father I went what?\n\n","author":"dragonman8001","parent_id":"t3_5rrasx","score":3,"sentiment":-0.81222789860608},{"displayText":"CovetedBody","name":"ddh90vc","children":[],"n_leaves":0,"body":"Wouldn't say it's the worst thing I've ever scene. Pretty much all jump scares, though it did have like some Final Destination/Don't Breathe segments which I thought was a nice change of pace. It's obviously in the eye of the beholder but people are definitely over exaggerating how bad it is. ","author":"CovetedBody","parent_id":"t3_5rrasx","score":3,"sentiment":-0.6968843706001804},{"displayText":"Shockz0rz","name":"ddihmrk","children":[],"n_leaves":0,"body":"Huh, I didn't even realize they were making a Ring sequel/reboot/thing. Shame that it apparently sucked; I loved the first two.\n\nActually, come to think of it, I'm seeing Ring Two get a lot of hate. Which just seems odd to me because I remember it being amazingly terrifying, though I was much younger when I last saw it. Maybe I should give them both a rewatch...maybe go and watch the Japanese original, too.","author":"Shockz0rz","parent_id":"t3_5rrasx","score":3,"sentiment":0.7641700812380954},{"displayText":"ImMakinTrees","name":"dda02s0","children":[],"n_leaves":0,"body":"This movie was not screened for critics and now has a 0% on rottentomatoes, which means absolutely no one should see it. Another creative horror story milked into a money grab POS. \"Hey remember that good horror movie from 2000? Remember how the sequel didn't work out so well? What if we made another, but just didn't try this time and filled it with jump scares and hired the cheapest actors we could find?\" Even the original wasn't really \"original.\"","author":"ImMakinTrees","parent_id":"t3_5rrasx","score":6,"sentiment":0.5522425144870486},{"displayText":"toastedbreadcrumb","name":"dd9qyv0","children":[],"n_leaves":0,"body":"Thought it was going to go somewhere interesting with the whole \"Tails\" thing, but nope, that went out the window pretty quick. What was even the point of that?\n\nThe acting is pretty flat. Half the time, the main character just kind of points things out in her lines.\n\nDidn't expect the movie to be any good, but I didn't really expect it to be this bad either.","author":"toastedbreadcrumb","parent_id":"t3_5rrasx","score":5,"sentiment":-0.8103055617544188},{"displayText":"diddles_giraffes","name":"ddb99qd","children":[],"n_leaves":0,"body":"It was a solid 5/10 for me through the middle. Then I stopped caring and we got a good performance from big D, redeemed it up to a 6. Honestly, I loved the idea that Johnny Gilecki wanted to science that shit. It's just a nice progression from the original that made sense and *would have* been really cool, had they not dropped the plotline without even explaining the experiment. \n\nMain theme was set up well and I'm glad they never really spelled this out like a lot of movies do. The story of Orpheus is an example of unconditional love. She was Orpheus in that she followed him into hell and watched the video, not out of curiosity or thrill seeking, but to save him. *Maybe* that's at least a decent explanation why she unlocked the bonus content? Whatever. From there they follow the plot of the original and by the middle it's clear that this is not a good movie. Point is, that love and empathy led to Samara taking revenge on who she wanted and spawning within Julia. \"We paid a high price for the charity we gave\" or something along those lines. \n\nOverall, some good ideas that got half-baked thrown together with some lazy writing. I thought the acting was at least on the upper end for horror and the effects were pretty good.","author":"diddles_giraffes","parent_id":"t3_5rrasx","score":5,"sentiment":-0.22583180958214144},{"displayText":"anti_body","name":"dd9pv2t","children":[],"n_leaves":0,"body":"this was really bad. i went for a prescreening at paramount studios and left 40 minutes into the film because i was bored to death. it's pretty much a high school drama with the VHS tag thrown in because it's a ring movie.","author":"anti_body","parent_id":"t3_5rrasx","score":5,"sentiment":-0.3746599533064241},{"displayText":"fatchobanispliff","name":"ddai1u8","children":[],"n_leaves":0,"body":"Goddamn it looks like it sucks","author":"fatchobanispliff","parent_id":"t3_5rrasx","score":4,"sentiment":0.45044818468935177},{"displayText":"gclem16","name":"ddbcsx7","children":[],"n_leaves":0,"body":"Just got back from and I will say I was excited for the movie I'll admit so I had expectations. The movie was ok that's it. It wasn't bad and definetly not boring(but it did drag at times) it wasn't great either. 6 maybe 5 out of 10 for me. A few notes I actually enjoyed Johnny Galecki's character. Also really liked Vincent D'Onofrio's as well. The main actress wasn't really bad but I really hated her character very very much. The main actor was just generic to me that's about it. The overall plot was enjoyable. I really did like the twist that was the priest. The last scene of the movie was kind of predictable but I did really like it. Samara Morgan still does creep me out I'll admit that. The jump scares sucked. Overall the film isn't winning any awards any time soon. I wouldn't necessarily recommend it to anyone. If you do see yourself watching it. I think it's a big time waster movie. There are some good scenes in it and some bad scenes it. I think it's good enough for a one time watch. ","author":"gclem16","parent_id":"t3_5rrasx","score":4,"sentiment":-0.3517995484905194},{"displayText":"April040715","name":"ddeqlnn","children":[],"n_leaves":0,"body":"This movie was trash.. the only good thing I got out of going to the theater was nachos.. what a waste of money. ","author":"April040715","parent_id":"t3_5rrasx","score":5,"sentiment":-0.7026446858228108},{"displayText":"Greatest_Ever_III","name":"ddjpsy5","children":[],"n_leaves":0,"body":"Is it just me or were a lot of scenes from the trailer not in the film itself?","author":"Greatest_Ever_III","parent_id":"t3_5rrasx","score":4,"sentiment":-0.08777509430773733},{"displayText":"9Virtues","name":"ddb4mvq","children":[],"n_leaves":0,"body":"Might be the most boring horror movie ever","author":"9Virtues","parent_id":"t3_5rrasx","score":2,"sentiment":0.39309235844969503},{"displayText":"darklord0211","name":"dditjiy","children":[],"n_leaves":0,"body":"Honestly, are there really any good horror movies that are actually scary? I always thought you were supposed to give horrors a pass because their main point is to make you jumpy and nervous, not to impress you.\n\nEdit: Thanks for all the suggestions, I really didn't expect so many.","author":"darklord0211","parent_id":"t3_5rrasx","score":2,"sentiment":-0.8243436456226831},{"displayText":"mori-arty","name":"ddjph3i","children":[],"n_leaves":0,"body":"I felt like it deviated rather far from the first film and some parts were a little strange but the colour scheme was really nice to watch","author":"mori-arty","parent_id":"t3_5rrasx","score":2,"sentiment":-0.7690305310676138},{"displayText":"naphthoylindole","name":"ddch1ib","children":[],"n_leaves":0,"body":"Wow, I wasn't expecting much based on how much everyone was shitting on it. That movie was MUCH better than The Ring 2, it had the core of a great story (I'll admit some fine details were fucking weird), the actors weren't nearly as bad as everyone was making them out to be either. \n\nThey needed to tie the end up though. Stop leaving it open for new movies. The Ring should have at most had 2 movies.\n\nI personally give it 7/10. I feel like a lot of people shitting on it are 14 year olds who weren't even alive when The Ring came out.","author":"naphthoylindole","parent_id":"t3_5rrasx","score":7,"sentiment":-0.30698416840868226},{"displayText":"cheshire_ranch","name":"ddb9dhl","children":[],"n_leaves":0,"body":"not a bad film overall.. once the twist with the preist came about I really got into it.. preists always scare the shit outta me and that arc was great(i love vincent d so thats probably why as well). . but id recommend waiting for dollar movies or redbox. i had a cinemark gift card lol. i give this about a 5.8/10.. definitely not a zero , and not the worse movie ive seen in the last year.. that still goes to suicide squad lol\n\nthis movie would be a solid 6.5 if it just ended on a good note.. why would samara take over julia if shes finally free? and julia helped her kill the priest too.. wtf?preparing for more ring movies really soured the ending of what I thought was a decent flick","author":"cheshire_ranch","parent_id":"t3_5rrasx","score":4,"sentiment":0.6617270110717852},{"displayText":"shaneo632","name":"ddbks99","children":[],"n_leaves":0,"body":"I really wish they'd just made it a stealth remake of It Follows and focused more on the idea of passing the video onto the next person, and that if they don't, then Samara goes back down the line and starts killing all the people who copied it.","author":"shaneo632","parent_id":"t3_5rrasx","score":4,"sentiment":-0.44745164758691724},{"displayText":"dragonman8001","name":"ddcbzun","children":[],"n_leaves":0,"body":"[So is pedo priest kinda the good guy? He's a scumbag racist but him killing the other 11 people who came to try and free Samara pretty much stopped her from spreading her curse to the masses. He was a piece of shit but he was pretty much in the right](#spoiler)","author":"dragonman8001","parent_id":"t3_5rrasx","score":3,"sentiment":0.22171758199199898},{"displayText":"BruteeRex","name":"dddwonr","children":[],"n_leaves":0,"body":"I'm so confused. \n\nWasn't Samantha's body in the well (ring 1)?\n\nSamantha was already a ghost, why would she need rebirth? Does that mean she's free to walk the earth? ","author":"BruteeRex","parent_id":"t3_5rrasx","score":2,"sentiment":0.5117389984402094},{"displayText":"BigZ7337","name":"ddb0gic","children":[],"n_leaves":0,"body":"The movie was better than it had any right to be, but it didn't try to do anything new. I actually enjoyed the mystery aspect of the film, but it kind of failed as a scary movie, as it wasn't scary at all and was filled with cheap fake jump scares. If you want to see my full review you can check it out here: https://www.youtube.com/watch?v=JstAEbfzXwI","author":"BigZ7337","parent_id":"t3_5rrasx","score":2,"sentiment":0.5703612255384187},{"displayText":"snowdog_93","name":"ddbbmvo","children":[],"n_leaves":0,"body":"I'm definitely in the minority here but I think it was a pretty solid movie. Everyone finding it boring must not be a big fan of horror movies because I was pretty much glued to the screen the entire time. Maybe I just have low standards, and maybe it was just nostalgia, but I liked it a lot (except for the ending).","author":"snowdog_93","parent_id":"t3_5rrasx","score":2,"sentiment":0.9573696630577999},{"displayText":"aaspradlin","name":"ddetr28","children":[],"n_leaves":0,"body":"When I saw this on Friday with some friends, the theater forgot to charge my card and just gave me tickets. So, SO glad I didn't pay to see this. ","author":"aaspradlin","parent_id":"t3_5rrasx","score":2,"sentiment":-0.3202316105166174},{"displayText":"TheEternalServant","name":"ddfqbvo","children":[],"n_leaves":0,"body":"Anyone else pretending that this movie never happened? It had too many plot holes and inconsistencies to be considered a \"sequel\". ","author":"TheEternalServant","parent_id":"t3_5rrasx","score":2,"sentiment":-0.7746949227718545},{"displayText":"MontanaSD","name":"ddemls1","children":[],"n_leaves":0,"body":"Holy crap I forgot this movie came out and was mildly excited for it. Now I see it's the trainwreck of the decade and glad I didn't get to it.","author":"MontanaSD","parent_id":"t3_5rrasx","score":2,"sentiment":0.24201928550335228}],"n_leaves":0,"title":"Official Discussion: Rings [SPOILERS]","body":"#Please remember this is a spoiler friendly zone. You don't have to use spoiler tags in this thread. If you haven't seen the film LEAVE NOW. If you want to see the opinions of redditors check the poll below. Also any comments that clearly show the commenter has not seen the film IT WILL BE REMOVED.\n\n---------\n\n#Poll\n\n**If you've seen the film, please rate it [at this poll](http://www.polljunkie.com/poll/qjzykp/rings-rmovies-poll).**\n\n**If you haven't seen the film but would like to see the result of the poll, [click here](http://www.polljunkie.com/poll/kppjwo/rings-rmovies-poll/view).**\n\n---------\n\n**Summary:** A young woman becomes worried about her boyfriend when he explores a dark subculture surrounding a mysterious videotape said to kill the watcher seven days after he has viewed it. She sacrifices herself to save her boyfriend and in doing so makes a horrifying discovery: there is a “movie within the movie” that no one has ever seen before... \n\n**Director:** \t\tF. Javier Gutiérrez\n\n**Writesr:** David Loucka, Jacob Aaron Estes, Akiva Goldsman\n\n**Cast:**\n\n* Matilda Lutz as Julia\n* Alex Roe as Holt\n* Johnny Galecki as Gabriel\n* Vincent D'Onofrio as Burke\n* Aimee Teegarden as Skye\n* Bonnie Morgan as Samara\n* Chuck David Willis as Blue\n* Patrick R. Walker as Jamal\n* Zach Roerig as Carter\n* Laura Wiggins as Faith\n* Lizzie Brocheré as Kelly\n* Karen Ceesay as Flight Attendant\n* Dave Blamy as First Officer\n* Michael E. Sanders as Pilot\n* Randall Taylor as Holt's Father\n* Drew Grey as Sam\n* Kayli Carter as Evelyn\n* Jill Jane Clements as Karen Styx\n* Adam Fristoe as Chris\n\n**Rotten Tomatoes:** [7%](https://www.rottentomatoes.com/m/rings_2017)\n\n**Metacritic:** [19/100](http://www.metacritic.com/movie/rings)\n\n**After Credits Scene?:** No","score":224}