[
    {
        "submission_score": 253,
        "submission_title": "Official Discussion: Jackie [SPOILERS]",
        "submission_text": "#Please remember this is a spoiler friendly zone. You don't have to use spoiler tags in this thread. If you haven't seen the film LEAVE NOW. If you want to see the opinions of redditors check the poll below.\n\n---------\n\n#Poll\n\n**If you've seen the film, please rate it [at this poll](http://www.polljunkie.com/poll/fyjaop/jackie-rmovies-poll).**\n\n**If you haven't seen the film but would like to see the result of the poll, [click here](http://www.polljunkie.com/poll/oraqqy/jackie-rmovies-poll/view).**\n\n---------\n\n**Summary:** Framed around Theodore H. White's Life magazine interview with Jackie Kennedy after John F Kennedy's assassination, the film takes a look at how Jackie dealt with the death of JFK and preparing his funeral to insure his legacy (and her own). \n\n**Director:** \tPablo Larraín\n\n**Writers:** Noah Oppenheim\n\n**Cast:**\n\n* Natalie Portman as Jackie Kennedy\n* Peter Sarsgaard as Robert F. Kennedy\n* Caspar Phillipson as John F. Kennedy\n* John Carroll Lynch as Lyndon B. Johnson\n* Greta Gerwig as Nancy Tuckerman\n* Billy Crudup as Theodore H. White\n* John Hurt as Father Richard McSorley\n* Max Casella as Jack Valenti\n* Beth Grant as Lady Bird Johnson\n* Richard E. Grant as William Walton\n* Julie Judd as Ethel Kennedy\n* Brody and Aiden Weinberg as John F. Kennedy Jr.\n* Sunnie Pelant as Caroline Kennedy\n* Sara Verhagen as Mary Barelli Gallagher\n* Georgie Glen as Rose Kennedy\n* Rebecca Compton as Nellie Connally\n* David Caves as Clint Hill\n\n**Rotten Tomatoes:** [88%](https://www.rottentomatoes.com/m/jackie_2016/)\n\n**Metacritic:** [81/100](http://www.metacritic.com/movie/jackie)\n\n**After Credits Scene?:** No"
    },
    [
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 105,
            "body": "After a long run of biopics like Imitation Game, Theory of Everything and so on, this movie felt very refreshing. Natalie of course was fantastic and some of the shots lingered in my head long after the movie (especially the one with the car driving away after assassination). And that score damn....jarring as hell and perfect for this film. ",
            "name": "dbsb3rk",
            "author": "rey1294",
            "time": 1483105470.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 169,
            "body": "Natalie Portman has such a balance between being fragile or falling apart in one scene to then demanding respect and being like a Queen. She gives such a powerful performance in this movie.\n\nAlso it was funny seeing her and Sarsgaard act in such a different movie and at such different stages of their careers since Garden State. I really enjoyed watching them.",
            "name": "dbs6kj3",
            "author": "JasperFeelingsworth",
            "time": 1483097848.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 62,
            "body": "This is easily one of the most well made movies of the year. Every part of the film just exudes an air of masterwork. The costumes, the sets, the makeup, the score, the performances, the screenplay, the directing. It feels like every single thing was planned out and executed the way it was planned. \n\nThis is one of the most fascinating films, too. I love how it doesn't just present the events that happened. It knows we know what happened. It focuses solely on the reactions and the emotions of these events. \n\nNatalie Portman pulls off another great performance, on the same level of Black Swan, if not exceeding it. The way she plays the different Jackies, like Jackie the First Lady, Jackie the Wife, Jackie the Mother, Jackie the Widow, and Jackie the Queen. I will be so delighted if she wins another Oscar this year.\n\nLastly, that score is indescribably great. That single, slow, grating pitch shift does wonders for the tone of the film. If the Oscars were good and just, this would win all the awards. ",
            "name": "dbuf3la",
            "author": "jacdeswilliams",
            "time": 1483245861.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 46,
            "body": "Incredibly complex performance by Portman. Gloomy cinematography with a haunting score. The screenplay wasn't the best unfortunately but it made for an engaging experience nonetheless. ",
            "name": "dbs7aw4",
            "author": "lqtely",
            "time": 1483098929.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 82,
            "body": "I really loved this movie, this is not your ordinary bio-pic by any means and shouldn't be confused for Oscar-bait. Pablo Larrain is such a unique filmmaker, and I can't wait to catch up on the rest of his filmography after seeing this. I just watched his film *Tony Manero,* and I certainly have never seen a filmmaker quite like him. \n\nThis movie is haunting and horrific, and is captured in such a beautiful way. Natalie Portman and Peter Sarsgaard give great performances as two people trying to keep their castle from crumbling beneath their feet. Levi's score works perfectly for this and adds another layer to this already emotionally twisted story. \n\nWhile it's an emotionally strenuous film, I can't wait to see it again.\n\n[Also here's a great clip of Aronofsky talking about picking Larrain to direct this project.](https://www.youtube.com/watch?v=dkyBkWf80SA) \n\n*edit: just rewatched the clip. It's not that great of a clip. More like an okay clip about Aronofsky picking Larrain, but I will leave it here.*",
            "name": "dbs6kwd",
            "author": "Bad_Badger",
            "time": 1483097862.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 34,
            "body": "The scene on the plane where she's in the mirror and sobbing while trying to clean the blood off her face hit me so hard, it went way beyond feeling like I was watching a biopic and more like a movie about grief and shocking, unexpected tragedy. It was an incredible performance by Portman, and between that, the direction, cinematography, and score, it's one of those movies that I keep thinking about days after watching. Top 5 of the year for sure.",
            "name": "dbsdpwz",
            "author": "roderickjaynes",
            "time": 1483111101.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 193,
            "body": "I honestly don't understand the comments about the movie just being average, I thought it was incredible, all around. Beyond Portman's great performances, I applaud the movie's creepy atmosphere, and its unique visual style regarding the grainy film stock. I thought it was unique, in terms of how Pablo Larrain turned what could have easily been a run of the mill biopic into something that more resembles \"There Will Be Blood\".",
            "name": "dbs79kp",
            "author": "comicsarenotdead",
            "time": 1483098872.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 33,
            "body": "As everyone has said, the score to *Jackie* is incredible. The close up scene where she is wiping blood from her face was one of the more powerful scenes in any film this year. Absolutely loved this movie.",
            "name": "dbsvpi3",
            "author": "chillcollinz",
            "time": 1483149260.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 25,
            "body": "**Making people feel her pain through vibration..**\n\nOne thing Jackie Kennedy did that I think is so fascinating and incredible is she made people feel her pain through literal physical vibration.\n\nOne thing you'll notice if you watch historical footage of the presidents funeral march are the drums. They're really loud, that was Jackie Kennedy's orders, for them to beat the drums as hard as they could. \n\nThe other was Air Force One and the other planes, she planned for them to fly as low as possible which they did. Like the drums beating over and over again, with everyone feeling their vibrations - the planes had a similar effect. \n\nShe wanted everyone there to feel her pain. Her wearing the blood soaked dress, everything was a projection of the emptiness that was left behind after Kennedy died.\n\nBut in the end when he was being buried played a band a somber song, one final tribute to the president. \n\nI just find that really amazing. ",
            "name": "dbxvre6",
            "author": "TacoBenderz",
            "time": 1483473036.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 23,
            "body": "I love when Biopics can perfectly recreate a piece from an era. The White House tour looked and sounded great, it was copied wonderfully.",
            "name": "dbtlfpi",
            "author": "DirectorVinall",
            "time": 1483185681.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 52,
            "body": "Movie was fine, but that soundtrack was so amazing. Mica Levi is quickly becoming one of my favorite composers out there.",
            "name": "dbs5h6s",
            "author": "Trionout",
            "time": 1483096236.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 15,
            "body": "I thought it was okay. I wouldn't even say above average. I know I'm in the minority on this one. I didn't feel like her character was that fleshed out, I didn't feel like it told an important story (within the scope of the film), I thought Natalie Portman had a good, not great performance, and I certainly didn't enjoy the directing. Maybe I should view it a second time, but I just don't feel the need to. I am disappointed that I wasn't blown away like most. ",
            "name": "dc2ecur",
            "author": "billsfan13",
            "time": 1483710756.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 28,
            "body": "Peter Sarsgaard is a great actor but wow he didn't even try a Kennedy accent. Ive seen actors on made for TV movies play a better Bobby Kennedy. ",
            "name": "dbt2mfe",
            "author": "fromtheill",
            "time": 1483158181.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 15,
            "body": "Spoilers? I don't think so",
            "name": "dbthjwm",
            "author": "PhyllisDietrichson",
            "time": 1483179695.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 14,
            "body": "I got goosebumps watching Jackie and John dance near the end. He looked *exactly* like him. It was almost eerie. ",
            "name": "dbsde7e",
            "author": "zeppelin1023",
            "time": 1483110314.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 14,
            "body": "Glad to see I'm not the only crazy one who didn't like this at all.\n\nFound the script, directing, pacing, editing, etc all terrible. I ultimately did not see the point in this film even existing.\n\nThey could have done a lot more with Jackie. I just found the film incredibly pretentious.",
            "name": "dcsvuoc",
            "author": "lonelysoap",
            "time": 1485219810.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 23,
            "body": "I enjoyed this film and felt it was well done. Natalie Portman's performance was remarkable, but I felt the film itself was good, not great. The pacing felt a little off at times and the dialogue was inconsistent. ",
            "name": "dbt6t68",
            "author": "gonesoon7",
            "time": 1483163811.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 32,
            "body": "I thought this film was very fascinating. I'll start by saying Pablo Larrain is the master of capturing the look of a time period. With this and No, I hope he does a lot more films about historical figures. I love the way it explored the iconography of Jackie and the way legacy is so often constructed rather than earned. Portman gives one of the best performances of the year and easily the best one of her career. The score is unreal. I will see any film Mica Levi scores from now on. While I wasn't quite in love with the Terrence Malick style editing or having three different frame narratives this film was extremely unique and the kind of oddball biopic I want to see more of.  ",
            "name": "dbs5kso",
            "author": "mi-16evil",
            "time": 1483096382.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 32,
            "body": "Saw this on Christmas Eve. One of my favorite films of the year. I didn't know Noah Oppenheim had it in him to write something this good and this different from most biopics. I loved how Pablo Larrain and Stephane Fontaine made the film look like it came from the 1960's and I also loved how they recreated the time period. The score by Mica Levi works beautifully and the performances are all great. The MVP, of course, is Natalie Portman as Jackie Kennedy. I'd say she gives her best performance here (yes, better than Black Swan). A haunting, powerful, and stunning piece of work.",
            "name": "dbs763z",
            "author": "JohnTyler-Flounder",
            "time": 1483098725.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 38,
            "body": "I don't plan on seeing this in theaters but my grandmother gave me a review that made me laugh my ass off and I have to share. She saw it with a bunch of other older women in their late 80s who are all bit hard of hearing. She says that \"there was too much whispering and hushed tones\" and, get ready for this mental image, \"We all had to cup our hands around our ears the entire movie to hear what Natalie Portman was saying.\"",
            "name": "dbsq4n7",
            "author": "randalflagg",
            "time": 1483141888.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 8,
            "body": "Incredible performance by Natalie Portman here.  She absolutely nailed Jackie's voice.  It was perfect, and the amount of work she surely did to perfect it is admirable.  \n\nThis is a movie where I wasn't looking at Natalie Portman; I was looking and listening to Jackie Kennedy.",
            "name": "dbxp35d",
            "author": "StarDestinyGuy",
            "time": 1483454373.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 10,
            "body": " Cynical, self-indulgent, trite, formulaic and ultimately empty. \n\n  The trailer for Hidden Figures that played prior to the feature moved me more than Jackie did.",
            "name": "dc2ajam",
            "author": "kennys_logins",
            "time": 1483704768.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 10,
            "body": "(This is my favorite movie of the year and I am so sad that so many people were underwhelmed. I don't think many are going to see this bc it's so late, but I've attached a bigger thing (bc no one wants to read 900 words on reddit))\n\n[There have been movies before Jackie, and there will be movies after Jackie. But don’t let it be forgot(ie), that for one brief, shining moment there was a Jackie.](http://sternreviews.com/reviews/jackie-review-we-are-undeserving-of-this-glorious-film/)\n\nWow. I wasn't expecting this.\n\nA program of various conversations and moments, nonlinear, interweaved. A marvelous construction with a magical performance by Natalie Portman. I cried, yo.\n\nThis is everything cinema deserves to be.\n\nI think I found my new Carol, y'all.",
            "name": "dc3r1kg",
            "author": "SternReviews",
            "time": 1483785596.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 9,
            "body": "The music and the cinematography was sensational. The assassination scenes were so tragic and beautiful. ",
            "name": "dbs8z9d",
            "author": "PairofDoctors",
            "time": 1483101616.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 8,
            "body": "Good movie.  I thought it was interesting how it's hard to categorize.  It wasn't conventionally melodramatic enough to be an Oscar bait movie.  It was more of an arthouse character/mood piece, yet it also wasn't experimental enough to win critical claim with the arthouse crowd (besides the score and Portman's performance).  Anyway, after the movie I couldn't stop thinking about Jackie's situation, how she behaved, what must have been on her mind, dealing with a tragedy, etc.",
            "name": "dbtf8gd",
            "author": "ChooseCorrectAnswer",
            "time": 1483176199.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 7,
            "body": "I feel like I'm taking crazy pills. That was the worst movie since Sausage Party. The dialogue was laughable, the pacing sluggish and almost every scene incredibly awkward. I usually love Billy Crudup but his reporter was the worst thing. You could predict every movement of his face and eyes because his acting just followed the terrible drivel of a script. Bah.",
            "name": "dciko3r",
            "author": "Dipper_Pines",
            "time": 1484634418.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 32,
            "body": "Natalie Portman's performance is titanic. Like an \"all-time\" performance. It'll be looked back as one of the best regardless of whether or not she wins an oscar for it.",
            "name": "dbse433",
            "author": "raven_needles",
            "time": 1483112090.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 8,
            "body": "It kind of bummed me out that a movie about Jackie focused only on her time in the White House and planning the funeral of JFK. \n\nThey barely touched on her past. I feel like I barely got to know her. If you're making a movie about someone, do you really want to just define that character by their spouse? ",
            "name": "dcp6u8l",
            "author": "Eddo_Kenedo",
            "time": 1484994673.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 8,
            "body": "Bleh. Was on a roll of good movies, having loved *La La Land*, *Manchester by the Sea*, and *Moonlight*. Heard great things about this one...  \n  \nBut I strongly disliked it. I didn't feel moved, I barely felt sympathy for any character, I didn't learn anything new historically, I wasn't in suspense... When the movie finally seems to reveal what it's trying to say, all I could think was \"Well duh... you've been making this point very clearly for an hour now.\" I literally cannot remember the last time I saw a movie that felt this pointless and protracted. I wish I understood why some people loved it so much.  \n  \nI even thought Natalie Portman's acting was weak, despite all the hype — it never felt like anything other than watching Natalie Portman do an okay (if stilted) impression of Jackie O. I watched some interviews with the real Onassis afterward to see if this movie had somehow given her a different dimension, and instead it just further cemented how little the story or performances had affected me at all: I ended up just feeling like \"nah, they got her wrong.\"",
            "name": "dcxast6",
            "author": "AlmostScreenwriter",
            "time": 1485444379.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 14,
            "body": "My dad has a recreational fascination in the JFK assassination, as he was just the right age to remember it the day it happened. He's read everything he could on it, and absorbed as much info as he can. He told me as he walked out, \"I've spent literally *years* pouring over this topic, and never once stopped to consider what that experience must have been like for her. That is without a doubt one of the best film experiences of my life.\" \n\nI've never been as invested in the topic but I also thought it was superbly crafted. I was apprehensive towards casting Portman but it's clear that she has poured herself into this performance. \n\nIf you need convincing, [watch this](https://www.youtube.com/watch?v=CbFt4h3Dkkw) - the original White House tour documentary (start at 6:17). Look at the way JK holds her hands,  pauses between her words, and averts her eyes from time to time, and compare it to Portman's portrayal. I would not have believed [Padme](https://www.youtube.com/watch?v=buyflmtHcHc) could pull something like this off. \n\nHer portrayal aside, Lorraine has organized a lot of moving parts in a very compelling way. So much so that the sound of the gunshot ringing through her head and the following camera glide up and over the back of the limo as Clint Hill clings to the back of it have transitioned from a photo, to an actual experience for me. \n\nWithout a doubt in my Top Five of 2016 - I hope it's not left out of the awards conversation. ",
            "name": "dbslvp5",
            "author": "danamal",
            "time": 1483134853.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 7,
            "body": "Saw it on Wednesday. Thought it was pretty low key but extremely well done",
            "name": "dbucsnq",
            "author": "agarret83",
            "time": 1483242410.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 7,
            "body": "Extremely overrated. There were some shots I liked, the music was OK, and Natalie Portman's performance was acceptable (I would not consider it Oscar-worthy though, but I wasn't really a big fan of hers to begin with) However, the pace was extremely slow and overall the film was simply forgettable",
            "name": "dddj5j2",
            "author": "SlimmyJimmy855",
            "time": 1486364065.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 7,
            "body": "I think the best or most startlingly moment in the film is when she takes a shower. And you just see red washing over her back. It's amazing how simple and subtle it showcases how traumatic that whole event was. ",
            "name": "dbsffg0",
            "author": "Blackcrow521",
            "time": 1483115691.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 6,
            "body": "Just got out of a screening where the screenwriter, Noah Oppenheim did a Q&A.  This gets a thumbs up, not too enthusiastically, but it is worth a look.\n\nPluses:  This avoids the trappings of the normal bio-pic and focuses on the post assassination.  Billy Crudup as the journalist is a device to frame the story with flashbacks to the CBS TV tour Jackie gave in 1961.  Best scenes for me were with John Hurt as a priest.  Some sequences of the film are absolutely great, much credit to Pablo Larrain and a score that took lots of chances.\n\nMinuses - Narrative sometimes lost momentum and story seemed to get lost.  Thought Natalie Portman forced it a bit, especially with the White House tour which really wasn't that important.  Some of the scenes with Billy Crudup also felt flat or forced.\n\nLarrain is a very interesting choice to direct this film and this paid off in that regard.  Portman does her best with such an iconic character but I've seen her better.\n\n",
            "name": "dc0w5os",
            "author": "coolhandluck",
            "time": 1483631704.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 10,
            "body": "I really enjoyed this movie a lot more than I thought I would. I wasn't *too* interested in the subject material and I was mostly going in for Natalie Portman's acting, but it was just so damn interesting on a technical level. The music was strange and a little off-putting, but in a good way (to me). The way the entire movie was shot was intimate and a little chaotic; half the movie was spent right in Jackie's face.\n\nPortman brought so much life to a character that I didn't really know too much about. The subtle anger in her performance was spectacular. Jackie was such an interesting character -- seemingly weak on the surface, but she knows *exactly* how she is viewed and how to use that to her advantage. The scenes between Portman and Crudup were especially great; I loved how assertive Crudup's character was without being too pushy. You could feel the tension in their back-and-forth but also their respect.\n\nI can understand why some people might not like it though, as it was a little slow. The woman next to me in the theater fell asleep and started snoring. I had to wake her up, it was weird.\n\nOverall it is definitely in my top 10 for the year. I *liked* it when I watched it, but it's one of those movies that I enjoyed even more as I reflected on it afterwards.",
            "name": "dbsxtyp",
            "author": "TroyAtWork",
            "time": 1483151950.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 4,
            "body": "https://www.youtube.com/watch?v=fNkkApo7DDs",
            "name": "dbt1rr2",
            "author": "JustTheTenOfUs",
            "time": 1483157061.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 3,
            "body": "So was she an ego maniac? Did she feel she was a queen? Did people tell her she was a queen? I have questions. I really thought Portman killed it. I thought it was eerie. I liked the scenes of her walking with her back to the camera. ",
            "name": "dc0e0cq",
            "author": "TrillThot",
            "time": 1483604493.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 5,
            "body": "Natalie Portman's performance saved it for me. ",
            "name": "dd1cvmg",
            "author": "MadeinBangladesh235",
            "time": 1485678693.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 5,
            "body": "The guy who played LBJ looked and acted nothing like him. It was particularly jarring after seeing Bryan Cranston nail the role in *All the Way*. But obviously he was not the focus of the film so it's a minor complaint, yet it is my biggest one.\n\nPortman nailed the role and the voice though. She's certainly improved significantly in terms of accents since *V For Vendetta*, that's for sure. So far she's my frontrunner for Best Actress, even though she probably won't actually win because all of Hollywood is wanking over *La La Land* right now.\n\nThe score was phenomenal and extremely unconventional in the best way possible. Felt it captured the mood perfectly. Set and costume designs were also great. It all added up to create a spot-on atmosphere.\n\nThe focus of the movie was not at all what I expected. I expected more standard biopic fare. This was, instead, more of a meditation on grief and a psychological profile of Jackie in the days following the assassination. This pleasantly surprised me and it gave the movie a focus and depth lacking in most traditional biopics. The movie is depressing as all hell because of it, but it worked for me anyway. A movie about this subject shouldn't be a joy to watch; like Jackie herself insisting that all see her blood-stained dress, it shows the raw and painful truth of the tragedy. It was neither overwrought or over-long. It was a film with a specific theme to convey, and I think it succeeded.\n\nSurprised to see it getting some hate here, but I can certainly understand why someone wouldn't *enjoy* the movie. Dismissing its strengths as a work of art, though, is just wrong as far as I'm concerned. It's also a good work of historical drama that should certainly be of interest to anyone with an interest in US presidential history, or the Kennedy administration/assassination particularly. If you don't possess such an interest, I can see how it wouldn't do much for you but it is still certainly a well-made film.\n\nBonus note: John Hurt's role as the priest just made the movie feel even more somber to me, knowing now this was his last role. (At least the last he was alive to see released; perhaps there are posthumous roles coming out I am unaware of, but still.)",
            "name": "ddclzad",
            "author": "EverySingleImage",
            "time": 1486301513.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 16,
            "body": "So, I had a lot of thoughts about this film. I think it tried a lot of things but didn't have a clear conception of what it wanted to be, and because of that it suffered. Portman's Jackie is great and on point, though the accent work in some scenes could have used a bit more work; especially in the early interview segments it felt forced and took me out of it a bit.\n\n There are definitely moments that are resonant and powerful [Jackie explaining to her children that their father is dead, for example](#spoiler). However, I think that overall the film can't decide if it wants to be a film about a grieving mother or a film about Jackie Kennedy orchestrating the legacy of JFK. Furthermore, I really felt as though the inclusion of the assassination at the end of the film was unnecessary and took away from the film. We'd already seen everything surrounding the assassination, and it was heart wrenching to see Jackie's response to it by itself, and it felt as though it didn't need to be shown. When it was, it felt like it was more for shock value than anything else. \n\nLastly, I thought the score was overbearing. The heavy, dissonant track that played over and over was an interesting addition at first, but as it continues to be repeated it felt as though the movie was yelling at me to be sad. I felt as though the score didn't believe in the ability of the movie to be genuinely emotionally affecting, so it attempted to overcompensate by serving as emotional cues that ulitmately weren't necessary. That said, some people I saw the movie with liked the score a lot, so maybe that's just a me thing. Ultimately, I'd give this like a 3/5. Not an awful movie, just not one I particularly need to see again.\n\n",
            "name": "dbvd9k0",
            "author": "forgot_myoldpassword",
            "time": 1483320716.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 24,
            "body": "Oh boy, finally! \n\nI saw this a week ago and was...underwhelmed. The interview scenes felt very lacking, I probably could've gone without them entirely.\n\nWhen Portman was good, she was GOOD. That said, there were definitely a number of points where my immersion broke and I was aware I was watching Natalie Portman instead of Jackie O. \n\nThe cinematography was nice. You really got that cramped, stressful feeling of the situation. \n\nThe rest of the actors were...eh. Nothing special. \n\nThe music was solid in and of itself, but I really felt like the desired mood was being particularly shoved in my face. \n\nSo all in all...eh. It's a better than usual biopic, and Portman's best actress nomination is deserved, but whether she should win is another question.  \n\nEdit: oh, also, the set/costuming was wonderful. Easily my favorite part of the movie. ",
            "name": "dbsqj94",
            "author": "BourbonAndBasketball",
            "time": 1483142462.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 14,
            "body": "I never expected a movie about JFK's wife to be this good, it's easily in my top 5. Portman gave her best performance in years and the best female performance of the year. Like everyone else is saying the soundtrack and technical aspects(lighting, shot composition, etc.) are magnificent. Very personal and intimate film, don't know if I was the only one, but the ending left me with such sad/melancholic feeling inside. I felt like I was on the verge of tears by the end.",
            "name": "dbs92gt",
            "author": "Moviefan55",
            "time": 1483101765.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 16,
            "body": "Wow, saw this last week and just watched the actual tour of the White House Jackie gave.  It's incredible how Natalie Portman is dead on with her performance, every mannerism is perfect.  Will be gutted if she doesn't win best actress.",
            "name": "dbsg5fn",
            "author": "polosport95",
            "time": 1483117856.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 12,
            "body": "I really did not like this movie. While the costumes were visually wonderful, I thought everything else about it was not good. I did not even enjoy Portman's performance. The direction was choppy and in some ways difficult to follow. \n\nI was severely disappointed, and my expectations were low. ",
            "name": "dbz7uz6",
            "author": "JamesKM716",
            "time": 1483539079.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 11,
            "body": "I saw Jackie back during TIFF. Stuck with me for a week. Best way to describe it? Haunting. That score, the mesmerizing performance from Natalie Portman, the direction. All brilliant. ",
            "name": "dbsme4i",
            "author": "100MPHFastball",
            "time": 1483135858.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 7,
            "body": "Took my Grandmother, who is in her mid eighties, to see this movie. Thought she was gonna have a damn heart attack because those gun shot sounds were SO LOUD in the theater. ",
            "name": "dbutmja",
            "author": "wwrxw",
            "time": 1483269224.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 3,
            "body": "Saw it with the family on Christmas Day which we all agreed probably wasn't the best film for Christmas, but oh well!\n\nNatalie Portman's performance is really good, the music is really haunting too. \n\nWhoever casted JFK was spot on by the way, he looked the part very well. Peter Sarsgaard though? I just don't care for him to begin with.\n\nIt was good, not my absolute favorite of the year, and not one I'd probably ever see again though. But if you like seeing the award films this season, go see it!",
            "name": "dbsq2xk",
            "author": "stumper93",
            "time": 1483141821.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 4,
            "body": "how did Jackie handle the cheating from her husband?",
            "name": "dbxniuw",
            "author": "None",
            "time": 1483451340.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 5,
            "body": "Yeah wasn't a huge fan but Natalie Portman was fantastic. Does anyone know how accurate her bizarre voice was to the real Jackie?",
            "name": "dcuoog1",
            "author": "sarelem",
            "time": 1485312952.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 7,
            "body": "The graveyard scene, the scene in the plane directly after the assassination, and the scene where Jackie confronted her children, top 3 scenes of the year for sure. Incredible. \n\nThat being said, I thought Natalie Portman's accent was a little unnatural and distracting. From the first line, it just felt off but I couldn't place why. ",
            "name": "dbsasqj",
            "author": "NothingWasTheGrain",
            "time": 1483104882.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 6,
            "body": "Loved this. Larrain is a master. Think of all the themes touched on in these 95 minutes: grief, faith, family, celebrity, politics, history. And it's easy to be cynical about Portman doing something like this - the absurd overcommitment, the self-seriousness, the predetermined Oscar. But goddamn, this was an arresting performance. Impossible to take your eyes off her.",
            "name": "dby7m98",
            "author": "fondofmotionpictures",
            "time": 1483493068.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 8,
            "body": "I just forced my way through this.  Bored rigid.  Wasn't too sure going in but I'm quite a fan of a biopic so I thought I would give it a shot.  \n\nIm not convinced there was enough meat on the bones to make this into a film.  I came away wondering what had actually happened in the last hour and a half of my life.  I just wasn't interested in what little plot there was \n\nI thought Natalie Portman was excellent (although god that accent was a bit annoying).  One of the few scenes in the film I actually thought was well done was telling the kids what had happened.\n\nMaybe just too \"artsy fartsy\" for my common taste in films.  4/10",
            "name": "dd48m18",
            "author": "milleniummanp7",
            "time": 1485843790.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 18,
            "body": "It underwhelmed me. I'm not sure what I expected, but it just didn't feel right. It was fine, but something about Portman felt off to me. I felt really aware that she was wearing a wig. The score was fantastic, but everything else just rang somewhat hollow for me.",
            "name": "dbs7sm0",
            "author": "icantplaysportswell",
            "time": 1483099705.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 9,
            "body": "I saw it last week and loved it.  Natalie Portman should win Best Actress.",
            "name": "dbspes6",
            "author": "JoeyJoeJoes99",
            "time": 1483140841.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 6,
            "body": "Great movie and amazing attention to detail.  \nHer wandering through the empty White House was so eerie.",
            "name": "dbspusb",
            "author": "Pinballmachinedude",
            "time": 1483141493.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 7,
            "body": "I loved how this wasn't a stereotypical biopic and was more of an intimate arthouse piece on grief. <3\nAlso, Natalie Portman was absolutely stellar. Her performance is definitely in my top five of the year ranked along with Isabelle Huppert, Sandra Hüller, Sonia Braga, and Sasha Lane",
            "name": "dbtizau",
            "author": "wildcosmias",
            "time": 1483181905.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 3,
            "body": "I just left and i really loved how much they took a chance with it. It could've easily been shot as just another standard biopic but the way it jumped back and forth and it's kind of weird European art house feel really helped it stand out. ",
            "name": "dbsdi6l",
            "author": "zeppelin1023",
            "time": 1483110575.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 18,
            "body": "I just saw this film and, to be honest, hated it. I found Jackie to be unlikable both before and after the assassination. Maybe Portman did a good job imitating her; that doesn't make the movie any better.\n\nVery little of what was happening in the movie interested me. I didn't care to see what happened next. I didn't find myself emotionally involved. The movie just made me think about death, but it's easy to be morbid.\n\nThe person who scored the movie did an excellent job. ",
            "name": "dbtq69n",
            "author": "aubrey1987",
            "time": 1483193235.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 5,
            "body": "God, I really loved this movie. I had high expectations coming in, and it met or exceeded all of them. Portman's performance was obviously incredible, but the way that the cinematography really put you inside of Jackie's head was absolutely brilliant. The score was beautiful as well. My only criticisms were of some of the places where the film deviated from the narrative. The scenes with the priest kind of bugged me. While there were some great lines there, it felt a bit tired to me. That said, it'll end up as one of my top films of the year. ",
            "name": "dbsps2m",
            "author": "awesomeness0232",
            "time": 1483141379.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 10,
            "body": "Look, I'm all for an intoxicating Portman-led character piece, but the history - and the contemplation of it - in *Jackie* is laced with eye-rolling digressions and odd, hammerhead structural issues. If anything truly shines (besides Portman, of course), it's Mica Levi's chilled, honorable score, although even that fully runs out of steam by exploring its climatic rhythms before the first frame burns brightly on the screen, settling for shallow repetition and cyclical motifs instead. A missed opportunity precisely because its visceral outlook on grief should've been expanded upon rather than shown through scattered, constructed fragments, and to think such a topic could be fully covered via a boring, obvious framing device is even more of a head-scratcher. Not really recommended unless you appreciate a little \"hey, look at me, I'm art!\" in your typical biopic soup.",
            "name": "dbsshr1",
            "author": "mouse_cunt",
            "time": 1483145117.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 17,
            "body": "This movie has no direction. There's no point to it. We've seen these types of stories many times. \n\nJackie was a waste of time for me. Very bleak and boring. Horribly written.",
            "name": "dbttx5g",
            "author": "None",
            "time": 1483202076.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 10,
            "body": "Unlike most people here I thought the music was heavy handed and very distracting.  The film might have made the bottom of my top ten but the music and the very artificial plot structure knocked it off my list.",
            "name": "dbsaj6p",
            "author": "Jerrymoviefan3",
            "time": 1483104382.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 5,
            "body": "I thought it was an interesting movie. I saw it with family, which included my aunt and grandmother who were both around when JFK was assassinated. They also very much loved Jackie Kennedy.\n\nThey did not like the movie at all. Their reason is that *nobody* can accurately portray Jackie Kennedy and felt as though Natalie Portman did not do a good job.\n\nI saw it because I know it's going to be an Oscar nominated movie, and while it wasn't the kind of movie I'd go see regularly, it was well made. Though I thought it jumped around too much.",
            "name": "dbsqfe8",
            "author": "theclumsyninja",
            "time": 1483142313.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 2,
            "body": "This easily the best written screenplay of the year. I saw everything except 20th century women which I am about to watch and lion which I will catch next week. Hidden figures also I guess lol",
            "name": "dbsde1k",
            "author": "raginwriter",
            "time": 1483110303.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 2,
            "body": "IMHO, all I can say for this movie is \"not bad.\" I think it didn't elevate it's story and the director made some choices - such as the score - that were just plain wrong for the movie. I also think that either the writer or the director and editor chose to put some scenes in the wrong places. It didn't feel like a journey. (I also think the \"interview\" genre is tired.) \n\nPortman was good but it felt like she was just doing as she's told. But if she was half as annoying as the actual Jackie was it's an achievement.",
            "name": "dc24fhd",
            "author": "BigOldQueer",
            "time": 1483696648.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 2,
            "body": "If nothing else, this film was a great showcase for Natalie Portman. Overall, I did like it but thought the structure sort of fell apart at the end; there felt like there were a few moments where the credits could have started to roll. I think having a deeper knowledge on and appreciation for the people and events surrounding the period would have given it more impact. However there were three aspects that made this worthwhile for me. The lead performance, Portman carries the film with strength and fragility. The cinematography which captures the aesthetic of the 60s that feels very familiar and very nostalgic. And the third is the score which had a plunging dramatic quality to it, adding to the sense of profound tragedy. ",
            "name": "dcdss7t",
            "author": "Linubidix",
            "time": 1484357030.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 2,
            "body": "Just saw the film today on the 28th. Rest in peace John Hurt. His performance really resonated with me and I'm sad to see such a long time actor go. ",
            "name": "dd1pykj",
            "author": "famouself",
            "time": 1485697899.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 2,
            "body": "I have to say I really enjoyed this, as an exploration of the grieving process. It felt more like that than a traditional documentary which I felt made it very interesting on an emotional level. Portmans performance is astounding. It was also pleasantly short, and avoided cliche. 8.5/10",
            "name": "dd70e08",
            "author": "Neighbourly",
            "time": 1485995932.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 4,
            "body": "Phenomenal movie and at this point will probably be my second favorite of the year(behind lala land). Portman gave the best performance of her career. Her body language was amazing and her range from broken and defeated to defiant is incredibly impressive. Even in her most broken moments she still plays it with an underlying sense of strength and resilience and in her most defiant moment she still has an underlying sadness. Great performance all around. She really carried the film, which isn't to say that the other parts of the film weren't great,  but so much of the film required her to be great to work. Larrain put a lot of trust in her to give it her all by relying on close ups so often throughout the film. \n\nLarrain also deserves a lot of praise for his direction. The constant use of close ups really allowed Portman to shine but also helped the audience connect with Jackie and feel the weight of the world on her shoulders. His direction, along with the cinematography, allow the film to visually portray the  weight of the situation and compliments all the performances very well. He takes a pretty good but not outstanding screenplay and turns it into something great. I also really enjoyed the mix of archival footage spliced in throughout the film. \n\nThe score also really adds to the films uneasy and eerie atmosphere. Mica Levi is definitely a composer to keep your eye on. \n\nThe editing in some parts was a little odd and not to my liking but not enough enough to really subtract from an otherwise great film. ",
            "name": "dbsdzwt",
            "author": "sean585",
            "time": 1483111792.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": 4,
            "body": "Good performance by Portman but pretty weak movie. I kept looking at my watch which is never a good sign. When they first showed glimpses of the assassination, I was happy that they decided to not get exploitive then near the end they decided to go really graphic which was a shame. 4/10",
            "name": "de242li",
            "author": "Prentz",
            "time": 1487779032.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t3_5l14ri",
            "score": -7,
            "body": "Maybe it's because was so moved from having seen \"Manchester by Sea\", but I really the move reaching, emotionally manipulative, and maudlin.",
            "name": "dbsk5e8",
            "author": "Sexy_Sasquatch",
            "time": 1483130778.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsb3rk",
            "score": 46,
            "body": "The way the score kicks in with just black screen at the beginning is awesome.",
            "name": "dbtoskf",
            "author": "brycedriesenga",
            "time": 1483190980.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsb3rk",
            "score": 17,
            "body": "The score was done by the one and only Mica Levi, who also did Under The Skin. ",
            "name": "dbwpf35",
            "author": "FScottWritersBlock",
            "time": 1483406037.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbs6kj3",
            "score": 48,
            "body": "heck even when you look at the poster you think \"damn, is she royalty?\" Her performance feels like a snapshot ",
            "name": "dbsgiic",
            "author": "Jon-Osterman",
            "time": 1483118999.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbuf3la",
            "score": 5,
            "body": "Absolutely loved the score as well. The score, the costumes, and the performances by Natalie Portman and Peter Sarsgaard are the four things that I left with. Even though I don't agree with your last point, this movie was very good and I would not be upset with Natalie Portman winning best actress, no matter how badly I want Emma Stone to win. Excellent work by all people in this movie. \n",
            "name": "dbuofpp",
            "author": "WaltsBrownJacket",
            "time": 1483260466.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbuf3la",
            "score": 2,
            "body": "agreed, completely!",
            "name": "ddw3p1d",
            "author": "maryofscotts",
            "time": 1487418558.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbs6kwd",
            "score": 2,
            "body": "Half of the video is relevant to Larrain, thanks for sharing. Didn't know Aronofsky was a funny man haha",
            "name": "dbwguot",
            "author": "smileistheway",
            "time": 1483389697.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsdpwz",
            "score": 4,
            "body": "And even while sobbing like that, she is aware she's being watched. This time, by herself. ",
            "name": "dcym4z7",
            "author": "thesecondkira",
            "time": 1485512687.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbs79kp",
            "score": 28,
            "body": "That's because mi hermano Chilensis Larrain (which is strange for me calling him that considering his family history) doesn't really like biopics that much. Check out his Neruda as well, which is getting an even better response. \n\nLarrain sees the run of the mill and throws it into the crater of the Villarricca.",
            "name": "dbsipaf",
            "author": "StrangeSemiticLatin2",
            "time": 1483126281.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbs79kp",
            "score": 14,
            "body": "The visual style was fantastic. And eerie. ",
            "name": "dbsm66p",
            "author": "theredditoro",
            "time": 1483135435.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbs79kp",
            "score": 13,
            "body": "Seriously. This is one if the best films released this year.",
            "name": "dbt4abj",
            "author": "Tehsoupman12",
            "time": 1483160391.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbtlfpi",
            "score": 10,
            "body": "In the NYT anatomy of a scene Larrain talked about how they used the actual dialogue from the doc and the actors were lip syncing. They still did an excellent job recreating it though!",
            "name": "dbvdumh",
            "author": "mhazzie24",
            "time": 1483321655.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbs5h6s",
            "score": 55,
            "body": "Soundtrack felt horror-like at some times. Same composer from Under The Skin. Yea. ",
            "name": "dbs61fd",
            "author": "hazychestnutz",
            "time": 1483097063.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbs5h6s",
            "score": 4,
            "body": "From the first dreadful sliding sound, I was completely engaged by the soundtrack.",
            "name": "dbx8o9v",
            "author": "Long-Ball-Larry",
            "time": 1483430724.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbs5h6s",
            "score": 8,
            "body": "The cinematography was also fantastic. ",
            "name": "dbs6o6o",
            "author": "theredditoro",
            "time": 1483097997.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbt2mfe",
            "score": 5,
            "body": "I think this was a poor casting decision ",
            "name": "dchjg6z",
            "author": "robotsandpizza",
            "time": 1484571993.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbt2mfe",
            "score": 6,
            "body": "13 days still throws me off",
            "name": "dbtdruk",
            "author": "elbenji",
            "time": 1483173976.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbt2mfe",
            "score": 1,
            "body": "I don't know if he sounded or looked like Bobby, but did a killer job in the movie",
            "name": "ddxwyi2",
            "author": "smpl-jax",
            "time": 1487550528.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbt2mfe",
            "score": 1,
            "body": "I thought that was weird, but I quickly didn't really care. I thought he was great regardless.",
            "name": "de537k6",
            "author": "badgarok725",
            "time": 1487933277.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbthjwm",
            "score": 26,
            "body": "SPOILER: JFK dies",
            "name": "dbum2ai",
            "author": "Adysen2121",
            "time": 1483256633.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbt6t68",
            "score": 14,
            "body": "The movie is worth watching for her performance. But I agree with your criticism.",
            "name": "dbt7b9i",
            "author": "ss4johnny",
            "time": 1483164502.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbs5kso",
            "score": 11,
            "body": "You should check out Neruda, his other film released this year. It is indeed something to behold, and if Jackie is anything like his previous films, I can't wait to check it out. ",
            "name": "dbsgss8",
            "author": "Zassolluto711",
            "time": 1483119909.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dc3r1kg",
            "score": 1,
            "body": "I see a lot of people hating on the pacing of the movie and calling it boring, but I just need to say this to someone who also liked this movie-- I haven't felt this unsettled by a film in a long time. I was riveted by every detail and felt my gut twist throughout. This movie felt like a punch to the face, while allowing us to play as the fly on the wall of a horrible tragedy and how it's handled behind closed doors. Absolutely fascinating.",
            "name": "de1q1ha",
            "author": "Sophycles",
            "time": 1487756569.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dciko3r",
            "score": 6,
            "body": "Humbug. ",
            "name": "dcwlhsy",
            "author": "Whaaaaaa-",
            "time": 1485409182.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbse433",
            "score": 3,
            "body": "Exactly. Well said !",
            "name": "dc9z2aa",
            "author": "tune345",
            "time": 1484143752.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dcp6u8l",
            "score": 13,
            "body": "This film wasn't about Jackie's life it was a character study about her head space within the week of her husband's assassination. I thought it was a fascinating movie. ",
            "name": "dcwu7de",
            "author": "CrustaceousSebastian",
            "time": 1485419499.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dcp6u8l",
            "score": 8,
            "body": "I thought the point was at that time she felt defined by her spouse, and how jarring it was for her to suddenly lose that identity along with her husband. ",
            "name": "dcwlh0s",
            "author": "Whaaaaaa-",
            "time": 1485409158.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dcxast6",
            "score": 1,
            "body": "[deleted]  \n ^^^^^^^^^^^^^^^^0.7402 \n > [What is this?](https://pastebin.com/64GuVi2F/91293)",
            "name": "ddfq4jw",
            "author": "None",
            "time": 1486487316.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbslvp5",
            "score": 6,
            "body": "I have the same recreational fascination in the JFK assassination, but I'm 28. I feel like had he not died we'd be such a different nation. And I realized even before the film came out I had never heard Jackie speak. So the first thing I did when I got home after the film was watch the actual White House tour. Natalie nailed it. \n\nSuch a fantastic film. ",
            "name": "dbsnj3q",
            "author": "JacobCrim88",
            "time": 1483137886.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dc0e0cq",
            "score": 1,
            "body": "> Link\n\nTHANK YOU! That's how I felt. I went into the film not knowing anything about Jackie beside that she was a style icon of her time. The movie left me feeling slightly confused about her character and if she truly loved \"Jack\" as a husband or if she was egocentric. Natalie Portman was brilliant, I just wish they would've given us a little more detail about Jackie as a wife and first lady and not just a widow. The scene with the pastor also confused me. ",
            "name": "de2v4nn",
            "author": "krissleeann",
            "time": 1487822063.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbvd9k0",
            "score": 11,
            "body": "I respectfully disagree with a lot of this comment. I too thought that it was a little annoying to show the actual assassination at the end but when I thought about it a little later after watching the movie it made more sense. The movie itself bends a lot of cinematic tropes and cop outs. Like the first time, scenes were hinted at in movies, like starting and ending the movie with the same scene or someone being killed without actually seeing the death, it was amazing. yet over time those kinds of things became overused and expected. I think that with Jackie, they were smart to finally show the assassination at the end. A little bit because then we could see the things she was alluding to in the interview; Jack's face, his brains, her paralyzation on the way to the hospital, all of it. Additionally, I'm so thankful they didn't end the movie with the same scene that its started with, they continued the story a little bit, for that last reminder that the movie is, at least somewhat, about living with the President. However, I do agree that at sometimes the movie was confusing. Like it is important that they didn't leave out Camelot because that is what the family was known for, but it felt a little overused. I agree that at times the score was too heavy, but it felt very necessary to continue the somberness of it. I don't think the movie could have been as great with large scenes without noise, it didn't feel like it would be able to hold up well enough like that. The thing about Jackie that I love that portman achieved was the awkward shoulders and the duck feet. That was absolutely perfect. Though yes, all the legacy talk made me just as uncomfortable- like the director was telling the audience \"this is what you have to think when you think Jackie now!!\"",
            "name": "dbwzrlx",
            "author": "bon123bon",
            "time": 1483418995.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbvd9k0",
            "score": 4,
            "body": "It's so refreshing to see well-thought-out and written criticism in a discussion here—really great comment. So used to seeing comments along the lines of just, \"I hated that movie\" with nothing else. It's one of my biggest pet peeves when it comes to online discussion—people just constantly share their opinions without giving anyone a reason to care about it. \n\nI've not seen the film yet, but I definitely wanna try and find time to soon. The score definitely seems polarizing, so interested to hear that. People seem to have a lot of differing opinions on this movie, and it definitely seems like it does a number of interesting things to standout from your typical bio-pic. Even if they don't always land, it definitely makes me intrigued enough to go see it. ",
            "name": "dbwk4jf",
            "author": "Mippipopolous",
            "time": 1483397720.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbz7uz6",
            "score": 6,
            "body": "I agree. I think Portman did what she was told to do so can't fault her. The score was not only bad but a poor choice for this film, and the choices they made in editing felt wrong. It felt like the scenes were out of order. It was the wrong director for this picture.",
            "name": "dc2496l",
            "author": "BigOldQueer",
            "time": 1483696425.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbz7uz6",
            "score": 2,
            "body": "I hate to say this, because any mentioning of down voting seems to perpetuate more down voting,but I've said just this and was down bored severely.",
            "name": "dc1i7d9",
            "author": "Hiccup",
            "time": 1483670352.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbutmja",
            "score": 5,
            "body": "Same!  Especially since the movie dragged right before then and most of the theater had fallen asleep.  Total jump scare for a lot of people!",
            "name": "dbvp7bs",
            "author": "enyasurvivor",
            "time": 1483337152.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbutmja",
            "score": 3,
            "body": "Also the yummy open skull",
            "name": "dc35hrv",
            "author": "PoonaniiPirate",
            "time": 1483758768.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbxniuw",
            "score": 16,
            "body": "She says in the movie that the fact Jack always returned to his family even though he strayed made him loyal in her mind. In my opinion, I think the romance they felt when they were young turned into more of a partnership as his political career developed and when you think about the pressure of being part of the Kennedy dynasty in general.",
            "name": "dbyj5zs",
            "author": "algebratextbook",
            "time": 1483506004.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dcuoog1",
            "score": 3,
            "body": "[Link](https://youtube.com/watch?v=j3ZvIzL1JbI) to an interview with her.",
            "name": "dcv6n86",
            "author": "None",
            "time": 1485333759.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dcuoog1",
            "score": 3,
            "body": "Very accurate. Jackie had a weird way of speaking, especially in public.",
            "name": "dczc8ki",
            "author": "DevOnDemand",
            "time": 1485562397.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dcuoog1",
            "score": 1,
            "body": "What kind of accent was that?",
            "name": "dcyhf7j",
            "author": "Riff-Ref",
            "time": 1485506405.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsasqj",
            "score": 29,
            "body": "> That being said, I thought Natalie Portman's accent was a little unnatural and distracting.\n\nProbably because she nailed Jackie Kennedy's accent. She had a very strange way of speaking, and what you're hearing in the film is an accurate imitation of that.",
            "name": "dbsd5xp",
            "author": "StudandStuff",
            "time": 1483109776.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsasqj",
            "score": 17,
            "body": "Jackies voice was unnatural ",
            "name": "dbss8qw",
            "author": "hollaatyourgirl",
            "time": 1483144788.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dby7m98",
            "score": 1,
            "body": "Yes. I can understand why some people might find it boring, it doesn't spoonfeed the audience or rely on exposition. It makes you think. ",
            "name": "de53in4",
            "author": "crazycat68",
            "time": 1487933674.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dd48m18",
            "score": 3,
            "body": "  > I just forced my way through this. Bored rigid.\n\nOh good, so it's not just me.",
            "name": "dd6jnby",
            "author": "5xum",
            "time": 1485962129.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbs7sm0",
            "score": 7,
            "body": "I felt similarly.  I really enjoyed John Hurt in the third act, though.  If anything, it made me want to learn more about the Kennedy family (documentary, perhaps).",
            "name": "dbt36t3",
            "author": "Luminair",
            "time": 1483158931.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbspes6",
            "score": 3,
            "body": "The only actress I've seen this year with an actual difficult, haunting, emotional, resonating performance is portman. She steals the show mightily. Nobody else can truly even contend. Portman's Jackie is simply a powerhouse performance which without it, the movie falls flat. She's really the only reason to watch the movie.  Meryl streep was certainly delightful in florence foster jenkins, but i feel like portman's has more heft to it. \n\nAmy adams was good, but ultimately standard and not necessarily an elevating role. \n\nThe only other performance worth mentioning is emma stone. I think depending on how the the runup/campaigning goes, she's got an excellent chance in a very nuanced role.  Also, i didn't care for fences really because it felt much like a play than a film/something theatrical. \n\nEdit: forgot one, i thought Jessica Chastain in miss sloane was phenomenal ",
            "name": "dc1j4kn",
            "author": "Hiccup",
            "time": 1483671359.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbspes6",
            "score": 4,
            "body": "I can't even imagine who would compete with her at this point. I have a few more Oscar contenders to see, but of the ones I've seen she seems to be the clear best female lead. ",
            "name": "dbsptc6",
            "author": "awesomeness0232",
            "time": 1483141433.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbtq69n",
            "score": 8,
            "body": "I haven't actually seen the film,  and in such a case correct me if I'm wrong: but in a historical film like this, would you rather have the character be likable or honest to the source?\n\nI'm recalling *American Sniper* when everybody gave the movie shit for inaccurately portraying Chris Kyle as a good guy when in reality he was much different, but it seems you would've preferred a more likable character in this film.",
            "name": "dbvdya6",
            "author": "JustAnEpicPerson",
            "time": 1483321813.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbtq69n",
            "score": -3,
            "body": "Yeah, she seems to have gotten the ultimate hall pass to do whatever she wanted because of what happened to her husband.",
            "name": "dbtv7vn",
            "author": "Penisgang",
            "time": 1483206228.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsshr1",
            "score": 6,
            "body": ">Not really recommended unless you appreciate a little \"hey, look at me, I'm art!\" in your typical biopic soup.\n\nThis is damn near my review of the movie, condensed into a single sentence. Thank you. ",
            "name": "dbsx13n",
            "author": "BourbonAndBasketball",
            "time": 1483150932.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsshr1",
            "score": 4,
            "body": "Never would have expected such a well thought out review from someone named mouse_cunt. We share a lot of the same opinions on the movie, but I'd never be able to type my thoughts out as eloquently as this.",
            "name": "dbst1if",
            "author": "The_Crownless_King",
            "time": 1483145828.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbttx5g",
            "score": 6,
            "body": "At least this movie has more of a point than Lalaland.  \nTrying to tell a story from her point of view was really interesting when you realize how powerless and fragile she was amidst all these ghoulish politicians.\nI really don't understand why people are downvoting you, but you should give one concrete example of why you hated it.",
            "name": "dbuml99",
            "author": "pinballmachindude",
            "time": 1483257486.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsaj6p",
            "score": 16,
            "body": "The music is one of the best parts. It sounds like a horror movie. And what do you mean regarding an artificial plot structure? ",
            "name": "dbscvf9",
            "author": "Cunhabear",
            "time": 1483109097.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsaj6p",
            "score": 5,
            "body": "You're not alone....I could never get emotionally into the film because it was oppressingly showy",
            "name": "dbsk3ks",
            "author": "Sexy_Sasquatch",
            "time": 1483130637.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsaj6p",
            "score": 3,
            "body": "Could you explain what you mean by \"artificial\" plot structure? And what about came across as heavy handed? ",
            "name": "dbsled6",
            "author": "danamal",
            "time": 1483133830.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsaj6p",
            "score": 2,
            "body": "I absolutely hated the score. It was so loud and distracting. I felt like I couldn't feel my own feelings because the music was shoving whatever it wanted me to feel down my throat. Loved the movie otherwise. Natalie Portman was fantastic in it. Just wish the music hadn't ruined it. ",
            "name": "dbsd106",
            "author": "idiotdidntdoit",
            "time": 1483109454.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsk5e8",
            "score": 16,
            "body": "Could we get that again, but proofread?",
            "name": "dbsm1kv",
            "author": "danamal",
            "time": 1483135176.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsgiic",
            "score": 62,
            "body": "Well she is the Queen of Naboo",
            "name": "dbt91fk",
            "author": "Not_a_SHIELD_Agent",
            "time": 1483166955.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsgiic",
            "score": 19,
            "body": "It's so immersive! Yeah and the whole Camelot angle really added to that royalty vibe too.",
            "name": "dbswoi5",
            "author": "JasperFeelingsworth",
            "time": 1483150489.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsgiic",
            "score": 33,
            "body": "Hard to get closer then a Kennedy back then in America ",
            "name": "dbsqma3",
            "author": "BookieStovepipe",
            "time": 1483142579.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbs61fd",
            "score": 14,
            "body": "Love from Under The Skin is one of my favorite pieces ever composed for a film",
            "name": "dbsgirw",
            "author": "Jon-Osterman",
            "time": 1483119024.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbs61fd",
            "score": 3,
            "body": "O 100%. The way she would walk through the White House with those heavy strings playing reminded me of waking nightmare. Very eery and really set the tone throughout the whole movie.",
            "name": "dbubaio",
            "author": "stroudwes",
            "time": 1483240269.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbtdruk",
            "score": 11,
            "body": "The actor playing Bobby is 13 Days was so good that he threw off Christopher Lawford. Who is a Kennedy newphew. ",
            "name": "dbttjys",
            "author": "Lozzif",
            "time": 1483201000.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbum2ai",
            "score": 11,
            "body": "Shit man, I haven't even gotten past WWII yet! Maybe hold it in for those of us who aren't caught up next time.",
            "name": "dbv1yh1",
            "author": "TheConqueror74",
            "time": 1483288812.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbt7b9i",
            "score": 8,
            "body": "I found the only reason to watch the film was for her incredible performance. Otherwise, it didn't feel like anything i truly hadn't seen before regarding Jackie or the Kennedy clan and in better movies. ",
            "name": "dc1ipdw",
            "author": "Hiccup",
            "time": 1483670899.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsd5xp",
            "score": 13,
            "body": "I went back and watched the White House tour with Jackie Kennedy and damn Portman was spot on.",
            "name": "dbsxv79",
            "author": "TroyAtWork",
            "time": 1483151994.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsd5xp",
            "score": 1,
            "body": "Yeah, you see the same upperclass New England accent in Grey Gardens (Which is about Jackie's cousins, incidentally!).",
            "name": "dcgh42s",
            "author": "fkdsla",
            "time": 1484521785.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbt36t3",
            "score": 5,
            "body": "One interesting mini-series I watched was The Kennedys. Lot of good actors in that one, including Tom Wilkinson and Greg Kinnear.",
            "name": "dbtb7ge",
            "author": "icantplaysportswell",
            "time": 1483170104.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dc1j4kn",
            "score": 1,
            "body": "I didn't see Jessica Chastain or Meryl Streep's films this year, but you are right, Jackie is literally carried by Natalie.  She will win.  I think best actor right now is between Denzel Washington and Casey Affleck.  ",
            "name": "dc1rl5i",
            "author": "JoeyJoeJoes99",
            "time": 1483680674.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsptc6",
            "score": 6,
            "body": "Emma Stone from La La Land or Amy Addams from Arrival are the two big female lead actors that I am guessing that will be up there.  Neither have won an Oscar yet while Portman does so I guessing one of them.",
            "name": "dbsxao2",
            "author": "bootlegvader",
            "time": 1483151268.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsptc6",
            "score": 3,
            "body": "I haven't seen Meryl Streep yet or Fences, but I would bet everything on Natalie Portman.",
            "name": "dbsuzm0",
            "author": "JoeyJoeJoes99",
            "time": 1483148338.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsptc6",
            "score": 3,
            "body": "Isabelle Huppert has been sweeping the critics awards for *Elle*, but she has no chance in winning and is campaigning to just get nominated. At this point though, Emma Stone is probably Natalie's biggest competitor tbh",
            "name": "dbtilyf",
            "author": "wildcosmias",
            "time": 1483181331.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsptc6",
            "score": 1,
            "body": "Meryl Streep was really great as Florence Jenkins.",
            "name": "dbstt2o",
            "author": "Pinballmachinedude",
            "time": 1483146820.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsx13n",
            "score": 4,
            "body": "I would also like to extend praise to this sentence.",
            "name": "dbt90ko",
            "author": "losturtle1",
            "time": 1483166921.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbuml99",
            "score": 12,
            "body": "You thought la la land had no point? Just curious, why's that?",
            "name": "dbw7a8r",
            "author": "Basic_Millennial",
            "time": 1483363375.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbscvf9",
            "score": 5,
            "body": "But it isn't a horror movie. It's a very quiet film about deeply personal loss. I felt like the music was very out of place. ",
            "name": "dbsd28k",
            "author": "idiotdidntdoit",
            "time": 1483109530.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsm1kv",
            "score": 3,
            "body": "it wasn't that good.",
            "name": "dbt5yky",
            "author": "Sexy_Sasquatch",
            "time": 1483162660.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsgirw",
            "score": 11,
            "body": "Mica Levi is definitely a talent. Really hope directors/studios/producers/whoever keep approaching her to do film scores. It'd be cool to hear her score something for Denis Villanueve.",
            "name": "dbtr6mv",
            "author": "darkrabbit713",
            "time": 1483195203.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsgirw",
            "score": 1,
            "body": "Just like Love was my favorite from Under the Skin, Vanity is my favorite from Jackie.",
            "name": "dbwprcn",
            "author": "FScottWritersBlock",
            "time": 1483406497.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbttjys",
            "score": 1,
            "body": "That I did hear",
            "name": "dbtykya",
            "author": "elbenji",
            "time": 1483218262.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsxao2",
            "score": 3,
            "body": "I'm just speaking from personal preference. I've seen both of those movies and while I enjoyed both movies and both performances, it's tough for me to see either performance as being better than Portman. Doesn't mean that my opinion is right or that the awards are always based solely on merit, but I'm having a hard time seeing those as beating Portman's portrayal of Jackie. ",
            "name": "dbsxj0d",
            "author": "awesomeness0232",
            "time": 1483151565.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsxao2",
            "score": -3,
            "body": "This is irrelevant but those 2 put more effort every movie than Natalie.  ",
            "name": "dbsz1k5",
            "author": "blakxzep",
            "time": 1483153510.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsuzm0",
            "score": 8,
            "body": "I've seen both Florence Foster Jenkins and Fences, and I think Natalie Portman is **far** above Meryl Streep and Viola Davis. Don't get me wrong, they were both great too, but Portman's performance is a lot more layered and demanding than the other two. She perfectly portrays anger and sadness, and the camera is right up in her face for seemingly most of the movie. Without a top shelf performance in the Jackie role, the film simply doesn't work.\n\nViola Davis was great, but I didn't think her role had *as* much to work with as Portman did in Jackie. Meryl Streep was very good as always but I wasn't blown away at any point during Florence Foster Jenkins.",
            "name": "dbsy4vw",
            "author": "TroyAtWork",
            "time": 1483152338.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsuzm0",
            "score": 6,
            "body": "Viola Davis is being pushed to the Best Supporting Actress category to increase her chances of winning.",
            "name": "dbt0g91",
            "author": "carolinemathildes",
            "time": 1483155340.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbstt2o",
            "score": 1,
            "body": "Ah, that's one of the ones that I haven't seen yet. ",
            "name": "dbsu4gn",
            "author": "awesomeness0232",
            "time": 1483147225.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsd28k",
            "score": 21,
            "body": "Dealing with living in the white house after your husband, the President's brains are splattered all over you while you try to to keep a family and social network together sounds more horrifying than any \"horror\" film I've seen. It's real horror. All the music starts at middle tones and just gets lower. It's fright and anxiety and looming uncertainty put to music. ",
            "name": "dbsd82t",
            "author": "Cunhabear",
            "time": 1483109913.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsd28k",
            "score": 8,
            "body": "I didn't feel like a horror score to me, but it did capture the bizarre, otherworldly headspace that Jackie was in post-assassination. It reminded me of There Will be Blood's score, which also received similar criticism for being out of place, which I get. I loved both.",
            "name": "dbsd9ks",
            "author": "larrygopnik",
            "time": 1483110009.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsz1k5",
            "score": 7,
            "body": "IDK, Black Swan was pretty amazing with Natalie.",
            "name": "dbsz4e0",
            "author": "bootlegvader",
            "time": 1483153609.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbt0g91",
            "score": 7,
            "body": "... For Suicide Squad? ",
            "name": "dbtbou2",
            "author": "DMPunk",
            "time": 1483170812.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsu4gn",
            "score": 1,
            "body": "Not my kind of movie, but very sweet.",
            "name": "dbsur9a",
            "author": "Pinballmachinedude",
            "time": 1483148042.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsd82t",
            "score": 3,
            "body": "This, exactly this.",
            "name": "dbshmw3",
            "author": "semper183",
            "time": 1483122683.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsd9ks",
            "score": -2,
            "body": "There will be blood however wasn't calling attention to itself in every. Single. Scene. ",
            "name": "dbsds1l",
            "author": "idiotdidntdoit",
            "time": 1483111251.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbsz4e0",
            "score": -1,
            "body": "Yeah Black swan was terrific and well deserved but she went back to giving half assed performances and bad movies.\n\nBesides Lois Lane I think Amy Adams consistently challenges herself.  2 great movies this year and Emma is on a rise right now.\n\n\nFunny enough this was Aronofskys project that he decides to produce instead.  So Darren helped her get taken seriously again.",
            "name": "dbszkrq",
            "author": "blakxzep",
            "time": 1483154196.0
        },
        {
            "sentiment_score": null,
            "parent_name": "t1_dbtbou2",
            "score": 4,
            "body": "No, for Fences, as referenced in the previous comment.",
            "name": "dbtbz76",
            "author": "carolinemathildes",
            "time": 1483171240.0
        }
    ]
]