{"body": "#Please remember this is a spoiler friendly zone. You don't have to use spoiler tags in this thread. If you haven't seen the film LEAVE NOW. If you want to see the opinions of redditors check the poll below. Also any comments that clearly show the commenter has not seen the film IT WILL BE REMOVED.\n\n---------\n\n#Poll\n\n**If you've seen the film, please rate it [at this poll](http://www.polljunkie.com/poll/kpddrw/the-great-wall-rmovies-poll).**\n\n**If you haven't seen the film but would like to see the result of the poll, [click here](http://www.polljunkie.com/poll/jagxty/the-great-wall-rmovies-poll/view).**\n\n---------\n\n**Summary:** When a mercenary warrior is imprisoned within The Great Wall of China, he discovers the mystery behind one of the greatest wonders of our world. As wave after wave of marauding beasts besiege the massive structure, his quest for fortune turns into a journey toward heroism as he joins a huge army of elite warriors to confront this unimaginable and seemingly unstoppable force. \n\n**Director:** Zhang Yimou\n\n**Writers:** Carlo Bernard, Doug Miro, Tony Gilroy\n\n**Cast:**\n\n* Matt Damon as William Garin\n* Jing Tian as Commander Lin Mae\n* Pedro Pascal as Pero Tovar\n* Willem Dafoe as Sir Ballard\n* Andy Lau as Wang\n* Zhang Hanyu as Shao\n* Eddie Peng as Commander Wu \n* Lu Han as Peng Yong\n* Lin Gengxin as Commander Chen\n* Chen Xuedong as Commander of the Imperial Guard\n* Huang Xuan as Commander of the Deer Troop\n* Wang Junkai as The Emperor\n* Ryan Zheng as Shen\n\n**Rotten Tomatoes:** [31%](https://www.rottentomatoes.com/m/the_great_wall_2017)\n\n**Metacritic:** [35/100](http://www.metacritic.com/movie/the-great-wall)\n\n**After Credits Scene?:** No", "totalNeg": 1127, "name": "5ujuqd", "title": "Official Discussion: The Great Wall [SPOILERS]", "totalPos": 612, "score": 90, "children": [{"body": "[The Great Wall](https://tldrmoviereviews.com/2017/02/17/movie-review-the-great-wall/) is a movie of two halves, the first is the action, which is epic, and really well put together, then there is the rest of the film with bad dialogue, clunky story lines, what ever the hell accent Matt Damon was doing, it is like you can see the gears of the movie clunking along. \n\nIn many respects it is a film that you wish you had a remote to fast forward to the good parts.", "parent_id": "t3_5ujuqd", "score": 73, "displayText": "Bmac_TLDR", "name": "ddukvpk", "sentiment": 2.0, "author": "Bmac_TLDR", "children": [{"body": "The action does look fantastic. I'd see it for the visuals alone", "parent_id": "t1_ddukvpk", "score": 37, "displayText": "jm_tullock", "name": "ddulezk", "sentiment": 4.0, "author": "jm_tullock", "children": [{"body": "indeed, just be prepared to sit through a lot of nothing in between the set pieces  ", "parent_id": "t1_ddulezk", "score": 13, "displayText": "Bmac_TLDR", "name": "ddulhre", "sentiment": 1.0, "author": "Bmac_TLDR", "children": [{"body": "Good to know. If I know the action/scale makes up for it, I wouldn't mind at all", "parent_id": "t1_ddulhre", "score": 14, "displayText": "jm_tullock", "name": "ddulkfu", "sentiment": 3.0, "author": "jm_tullock", "children": []}]}]}]}, {"body": "I enjoyed it. I've always been a fan of the director and it's visually stunning like his other movies. The battle scenes- especially the first one with the drums and the girls jumping down the wall was really really cool. I didn't care much for Willem Dafoe's plot line but it didn't ruin the movie for me. Matt Damon's accent was a little strange. Overall though I really liked it. I wasn't expecting to like it as much as I did, but it was a fun movie. ", "parent_id": "t3_5ujuqd", "score": 44, "displayText": "amsbkwrm", "name": "ddumgis", "sentiment": 3.0, "author": "amsbkwrm", "children": []}, {"body": "I thought the film was a totally adequate way to pass the time that just happened to have absolutely gorgeous visuals (don't see it in 3D like I did, it muted a lot of the vibrant colors in the film). If China wanted to jump start their industry on the international blockbuster level, Zhang Yimou was the perfect pick. \n\nIt also wasn't worth the whitewashing/white savior controversy, since the film is way more about how savage Westerner Matt Damon is saved by Chinese communism who then helps the cause rather than Damon himself being the one who saves China himself. ", "parent_id": "t3_5ujuqd", "score": 113, "displayText": "BPsandman84", "name": "ddumigh", "sentiment": 2.0, "author": "BPsandman84", "children": [{"body": "Yeah, that's pretty much what I've been saying about Iron Fist. It isn't the story of a man who SAVES a [Pseudo] Asian Culture, it is the story of a man who is SAVED by that Culture. In all likelihood Danny Rand would have grown up to be yet another Billionaire Playboy Brat who never had to face the consequences of his actions.\n\nAlso, Danny SUCKS compared to the previous holders of the Iron Fist title, like isn't even in the top 90. That's one of the reasons why he hangs out in New York, so he's a Big Fish in a Small Pond.", "parent_id": "t1_ddumigh", "score": 44, "displayText": "CMORGLAS", "name": "ddvaq2e", "sentiment": 1.0, "author": "CMORGLAS", "children": [{"body": "That's a rather difficult feat for Danny since I thought there were only 66 Iron Fists in history. ", "parent_id": "t1_ddvaq2e", "score": 1, "displayText": "LetsGoChuckTaylor", "name": "de18fc9", "sentiment": 2.0, "author": "LetsGoChuckTaylor", "children": [{"body": "I made a typo, I mean 90%", "parent_id": "t1_de18fc9", "score": 3, "displayText": "CMORGLAS", "name": "de18sq7", "sentiment": 0.0, "author": "CMORGLAS", "children": []}]}]}, {"body": "The people that bitched about the whitewashing must have been ignorant to the production of the film. It was a very deliberate move to put an A-lister in that role like Damon. ", "parent_id": "t1_ddumigh", "score": 18, "displayText": "amedema", "name": "ddvluvc", "sentiment": 1.0, "author": "amedema", "children": []}, {"body": "Who would of thought the presumptions from people about whitewashing on a film before they had seen it would turn out to be wrong. I am shocked. /s\n\nGiven that about 90% of whitewashing claims are bullshit this should suprise no one. ", "parent_id": "t1_ddumigh", "score": 5, "displayText": "AcidJiles", "name": "ddz2j57", "sentiment": 0.0, "author": "AcidJiles", "children": []}, {"body": "Fuck.  About to see it in 3d because it's the only way I can for a big screen.  \n\nI FUCKING HATE 3D WHY THE FUCK IS THIS STILL A THING.\n\nEvery time I think of how much better a movie would look in 2d.  This shit is still garbage in 2017", "parent_id": "t1_ddumigh", "score": 1, "displayText": "halfcabin", "name": "de120tg", "sentiment": 0.0, "author": "halfcabin", "children": []}, {"body": "\"How evil, greedy western barbarians are bad\"\n\nSource: https://thefederalist.com/2017/02/21/the-great-wall-pretties-up-the-chinese-and-american-film-industrys-hatred-of-the-west/", "parent_id": "t1_ddumigh", "score": 1, "displayText": "heronumberwon", "name": "de1oikc", "sentiment": 0.0, "author": "heronumberwon", "children": []}]}, {"body": "I saw this movie this movie about 2 month ago, and i was waiting for US release date so that the movie can be discussed here. (Living in China currently, and most movies are released a while after US release, so most times, by the time i watched the movie, discussions are already over. \n\nSo lets talk about the movie. Brief and Simple. \n\nFirst, plot/story. Very generic storyline. Monsters come. Fight. Monsters go. Improve technique. Fight again. Win. main characters kiss. That is a very basic story line. (Dont know if this is a spoiler, cause everyone should know this anyways even if they never watched the movie)but still on the positive way, it had a simple storyline. Storys weren't dragging on and not much useless scenes were included. Audience didnt really get bored. \n\nSecond, Action. Scale of the movie was tremendous and was very impressive. Solely looking at action, i would give it a 8/10. Also, scale of the war was amazing. The great wall was recreated at a massive scale, and the hot air ballon scene in the night was (unrealistic but) beautiful. However, what really made me cringe was the bungee jumping warriors (idk what they are called) but that just cracked me out. I mean wtf is that suppose to be. Are the fishing the monsters with warriors as a bait? But was still cool, looking at them jump down. \nIf tha action scenes were a bit more violent, imo it could have expressed the monsters more violent and make war more realistic. I kept imaging World war Z when I saw the monsters climbing walls, but after the movie i found out that both movies were from same film production crew. \n\nI dont know what to feel about the 3-arrow shooting scene. It was cool but i don't really know if it really fit in to the movie well. \n\nJing tian (Commander Lin)'s acting IMO was not so good. Just like my mom said, her acting compared to Matt Damon, who is an amazing actor, needs more practice.Among chinese actors, Andy Lau's acting and english, both were the best. The monsters design, at first really disgusted me. I was expecting a really cool monster and *bam*. WELL, but atfter the movie, their ugly appearance i think expressed their cruel behavior in nature more affectively. I somehow ended up disliking the Queen' design even more. \n\nInteresting fact: \n\nJing Tian (Commander Lin) will be appearing again Kong: Skull Island.\n\nThe Great Wall is a Chinese movie to use the most budget. \n\nLu han use to be (would anyone clarify this info) a member of korean idol group EXO. \n\nThe emperor is from a group called TFBoys.\n\nThanks for reading this crappy review lol\n", "parent_id": "t3_5ujuqd", "score": 35, "displayText": "sickboi19", "name": "dduz4ks", "sentiment": 2.0, "author": "sickboi19", "children": [{"body": ">main characters kiss\n\nI didn't remember Matt Damon kiss  Jing Tian character at all.", "parent_id": "t1_dduz4ks", "score": 29, "displayText": "DragonFireDon", "name": "ddv4k4q", "sentiment": 1.0, "author": "DragonFireDon", "children": [{"body": "never mind. they just talk and leave, right?", "parent_id": "t1_ddv4k4q", "score": 10, "displayText": "sickboi19", "name": "ddv4svq", "sentiment": 0.0, "author": "sickboi19", "children": [{"body": "Yeah, it was super refreshing that there wasn't anything romantic and their relationship was purely based on them being partners in fighting those beasts. ", "parent_id": "t1_ddv4svq", "score": 30, "displayText": "Bowlero", "name": "ddv67t2", "sentiment": 3.0, "author": "Bowlero", "children": [{"body": "Their last scene together seemed set up for them to kiss.  Pedro Pascal even goes back to his cell to give them a moment of privacy.  You don't do that for people who are just going to have a polite conversation. ", "parent_id": "t1_ddv67t2", "score": 11, "displayText": "JC-Ice", "name": "ddvtr4v", "sentiment": 1.0, "author": "JC-Ice", "children": []}, {"body": "I also suspect Chinese audiences aren't as cool with the White man/Chinese woman pairing as Hollywood might be...", "parent_id": "t1_ddv67t2", "score": 19, "displayText": "Delta_Assault", "name": "ddvt2gw", "sentiment": 2.0, "author": "Delta_Assault", "children": [{"body": "They're not. They're beginning to become paranoid of the onslaught of creepy white dudes that come thinking they can get an easy lay. But then again they make movies like this", "parent_id": "t1_ddvt2gw", "score": 1, "displayText": "harsheehorshee", "name": "ddz12b9", "sentiment": 1.0, "author": "harsheehorshee", "children": [{"body": "Why dont make a AMWF movies then?", "parent_id": "t1_ddz12b9", "score": 2, "displayText": "royaldocks", "name": "de1l5gt", "sentiment": 0.0, "author": "royaldocks", "children": []}]}]}]}, {"body": ">Jing tian (Commander Lin)'s acting IMO was not so good. \n\nAgreed there, there are plenty of actresses in China more talented than her!\n\nhttps://www.reddit.com/r/movies/comments/5ujuqd/official_discussion_the_great_wall_spoilers/ddupq2m/", "parent_id": "t1_ddv4svq", "score": 5, "displayText": "DragonFireDon", "name": "ddv4v9q", "sentiment": 1.0, "author": "DragonFireDon", "children": [{"body": "Gong Li's been in lots of Yimou's movies and had beauty and talent. They need to find more actresses like her.", "parent_id": "t1_ddv4v9q", "score": 1, "displayText": "Delta_Assault", "name": "ddvt7d9", "sentiment": 4.0, "author": "Delta_Assault", "children": []}]}]}]}, {"body": "Luhan is legally a member of EXO until 2022. Other than his contract he has no connection to EXO since late 2015.\n\nAnother interesting fact: The emperor is from a group called TFBoys.", "parent_id": "t1_dduz4ks", "score": 11, "displayText": "bbbbrrrraaavvvooo", "name": "ddv15nn", "sentiment": 4.0, "author": "bbbbrrrraaavvvooo", "children": [{"body": "thanks for clarification!", "parent_id": "t1_ddv15nn", "score": 2, "displayText": "sickboi19", "name": "ddv207d", "sentiment": 4.0, "author": "sickboi19", "children": []}]}, {"body": "I see many critics complain about the plot. However, John Wick's plot is even more basic: Guy finds revenge after gangsters kills his dog and steals his car. ", "parent_id": "t1_dduz4ks", "score": 10, "displayText": "br0squit0", "name": "ddwc27p", "sentiment": 1.0, "author": "br0squit0", "children": [{"body": "When it comes to complaints about the plot, it is more about the individual swings that change direction in the plot. Predictable character changes or uncharacteristic switches in characters' actions not matching previous motivations. Not necessarily looking at the barebones skeleton of the plot and poking holes at that - to truly analyse the plot the parts connecting the plot points must be examined not just the plot itself. These connecting parts for this movie were often quite weak or disappointing when looking at characters and not pure action (like the first general's death) whereas the character responses and connecting plot segments of John Wick were definitely a bar above.", "parent_id": "t1_ddwc27p", "score": 8, "displayText": "DoctorGlorious", "name": "ddxs2pi", "sentiment": 1.0, "author": "DoctorGlorious", "children": []}]}, {"body": "Jing Tian is known in mainland China for being a bad actress who drags down both her movies and costars with her. Apparently, her boyfriend is super rich who keeps investing in her movies. Theree are running jokes that 'Jing Tian can never become famous', 'I won't see this movie because of Jing Tian', 'Here comes Jing Tian with her zombie face again' (zombie face meaning she doesn't emote) despite her always working. ", "parent_id": "t1_dduz4ks", "score": 9, "displayText": "FluffyWof", "name": "ddx9d78", "sentiment": 2.0, "author": "FluffyWof", "children": []}, {"body": "> However, what really made me cringe was the bungee humping warriors (idk what they are called) but that just cracked me out. I mean wtf is that suppose to be. Are the fishing the monsters with warriors as a bait? But was still cool, looking at them jump down.\n\nI liked the concept of that but they were never shown to be very effective. Needed more shots of them actually *succeeding* in killing some monsters, rather than making it look like most of them were immediately killed.", "parent_id": "t1_dduz4ks", "score": 7, "displayText": "BuoyantTrain37", "name": "ddv85a5", "sentiment": 2.0, "author": "BuoyantTrain37", "children": []}, {"body": "When I saw the movie tonight there was no kiss between the main characters", "parent_id": "t1_dduz4ks", "score": 3, "displayText": "JeffDenlon", "name": "ddxhzum", "sentiment": 2.0, "author": "JeffDenlon", "children": [{"body": "yup i had mistaen", "parent_id": "t1_ddxhzum", "score": 3, "displayText": "sickboi19", "name": "ddxiqz1", "sentiment": 1.0, "author": "sickboi19", "children": []}]}]}, {"body": "Needed more dumb parts like Hero White Guy ricocheting arrows off thrown axes and less dumb *dumb* parts like everything else.\n\nAlso loved how Dafoe looked as though he randomly walked onto the set, high on opium, and refused to leave, so the filmmakers decided to just write him into a pointless role.", "parent_id": "t3_5ujuqd", "score": 172, "displayText": "Hitzkolpf", "name": "dduldem", "sentiment": 0.0, "author": "Hitzkolpf", "children": [{"body": "There\n\nwas\n\na\n\nSword\n\nFight!", "parent_id": "t1_dduldem", "score": 66, "displayText": "Delta_Assault", "name": "ddusnet", "sentiment": 4.0, "author": "Delta_Assault", "children": [{"body": "...... What if it was just one monster with six swords?", "parent_id": "t1_ddusnet", "score": 6, "displayText": "PuffsPlusArmada", "name": "ddyceel", "sentiment": 1.0, "author": "PuffsPlusArmada", "children": []}]}, {"body": "Yeah, Dafoe's role seemed like it could be interesting and then they just shelved any good ideas for him and made him into an extremely predictable bad guy.  After the first 15 minutes of the movie, the entire plot of the movie became pretty obvious, and there was an overt sense of 'good guys will win, bad guys will have bad shit happen to them.'  \n\nOverall, this was a very boring movie for me.  Except that I chuckled every time Damon's weird accent sounded particularly Canadian.", "parent_id": "t1_dduldem", "score": 14, "displayText": "None", "name": "ddupm1r", "sentiment": 1.0, "author": "None", "children": []}, {"body": "I feel like the sole reason for Dafoe's storyline in the film is to make sure the film is feature length. The movie runs 95 minutes before the credits start to roll. ", "parent_id": "t1_dduldem", "score": 3, "displayText": "JeffDenlon", "name": "ddxjnlv", "sentiment": 0.0, "author": "JeffDenlon", "children": []}, {"body": "Did my brain stroke off for a second or did the axe-ricochet thing not actually hit any monsters? Same with the axes thrown in two different directions that then meet and... hit each other and fall to the ground? Did I miss both shots of monsters being hit that one would expect?", "parent_id": "t1_dduldem", "score": 2, "displayText": "Excession1586", "name": "de4r8u8", "sentiment": 1.0, "author": "Excession1586", "children": []}]}, {"body": "It's a good popcorn flick, dumb and fun. The plot's predictable but the action and visuals are fantastic, and Pedro Pascal is great. \n\nMy main gripe is the creatures themselves. The Queen and her goon squad were pretty cool but the soldiers are very generic creatures, they had a chance to make them anything and really missed out on doing something more unique.\n\nOverall worth the ticket imo", "parent_id": "t3_5ujuqd", "score": 24, "displayText": "Imapony", "name": "ddvkhuq", "sentiment": 2.0, "author": "Imapony", "children": [{"body": "This is exactly my feelings toward it. I really wish they had done more with those generic creatures. But the rest of it sort of made up for that a bit. Yknow, as far as the fun action-popcorn movie goes. My expectations for the film were the lowest I think my expectations had ever been (only went because someone else offered to pay, and they were giving out lanyards.. who doesn't want a free lanyard??) And I ended up actually having a lot of fun watching it!\n\n\n\nLoved the fight scenes a lot, especially when they're down at the war zone level at the foot of the wall. And I actually got some chills during the final battle, when the queen realized what tower they were in and sent all the creatures toward it, haha! Again, it might just be that I was completely expecting a crap movie.. but I kinda want to see that again! Maybe the surprise of it being decent would wear off and I could look at it with my critical eye. Something that really stuck out to me was the overall feeling of the wall.. especially during the first time we get a glimpse of the inside, when the guy is running past all the soldiers shouting. I absolutely love how they made it feel actually old and real. I don't know. I swear I could feel it though, like when I'm walking in an old castle and imagining what it would have been like to live in it back in the day. Definitely enjoyed it.", "parent_id": "t1_ddvkhuq", "score": 10, "displayText": "Panacea-for-Placebo", "name": "ddvqp0n", "sentiment": 4.0, "author": "Panacea-for-Placebo", "children": []}]}, {"body": "There got to be more effective ways to fight monsters than bungee jumping with spears...", "parent_id": "t3_5ujuqd", "score": 54, "displayText": "Aestheticshampoo", "name": "dduxwcg", "sentiment": 2.0, "author": "Aestheticshampoo", "children": [{"body": "Literally every other way they fought the monsters *was* more effective than the bungee women.  Hell, those blades that came out of the wall were a pretty good idea. ", "parent_id": "t1_dduxwcg", "score": 29, "displayText": "JC-Ice", "name": "ddvtul0", "sentiment": 2.0, "author": "JC-Ice", "children": [{"body": "I legitimately don't think there was any way for the monsters to beat the blades", "parent_id": "t1_ddvtul0", "score": 10, "displayText": "sabertale", "name": "ddy847g", "sentiment": 1.0, "author": "sabertale", "children": [{"body": "The blades concept sounds interesting, but the movie seems terrible so I likely won't see it.  Can you describe the blade concept in any more detail?", "parent_id": "t1_ddy847g", "score": 5, "displayText": "Nevermore60", "name": "de118z5", "sentiment": 0.0, "author": "Nevermore60", "children": [{"body": "The wall had literal saw blades that would poke out of the wall and chop up the the monsters into bits when they tried to climb up. They only used them once in the movie tho because they were pretty op. And right afterwards they had the monsters tunnel under the wall somehow which was pretty much the only way the blades could be beat", "parent_id": "t1_de118z5", "score": 10, "displayText": "sabertale", "name": "de3k9bx", "sentiment": 2.0, "author": "sabertale", "children": []}, {"body": "Horizontal slits on the wall open up to reveal giant blades, that operates in a scissor-like motion to cut down any monster that attempts to scale the wall.\nNot as colourful or spectacular as those wall bungee jumpers though", "parent_id": "t1_de118z5", "score": 4, "displayText": "btwx1111", "name": "de1zwc4", "sentiment": 2.0, "author": "btwx1111", "children": []}, {"body": "giant scissors coming out of the wall. lots of scissors.", "parent_id": "t1_de118z5", "score": 3, "displayText": "kmora94", "name": "de1zt08", "sentiment": 4.0, "author": "kmora94", "children": []}]}, {"body": "I mean they do though...", "parent_id": "t1_ddy847g", "score": 2, "displayText": "BelligerentBacteria", "name": "de33ftj", "sentiment": 0.0, "author": "BelligerentBacteria", "children": [{"body": "I just meant there was no way to get over the wall with the blades there. No need for bungee jumping spear ladies", "parent_id": "t1_de33ftj", "score": 2, "displayText": "sabertale", "name": "de3k00a", "sentiment": 1.0, "author": "sabertale", "children": []}]}]}, {"body": "This is on par with gangsters turning their guns sideways to shoot. It looks cool but you are a god damn idiot doing something so inefficient. ", "parent_id": "t1_ddvtul0", "score": 8, "displayText": "tyes77", "name": "ddvxvqw", "sentiment": 0.0, "author": "tyes77", "children": []}]}]}, {"body": "Just saw it tonight. \n\n**THE GOOD**\n--it's a beautiful movie. Some really nice cinematography and production design, particularly the costumes. \n\n--some nicely done fight sequences, although it looked like they blew their creative wad on the first fight sequence and the rest were just ok. \n\n--I liked that there was obvious sexual tension between Matt Damon and the General but they never actually go anywhere into a tacked on romance. Made the General a stronger female lead. \n\n**THE BAD**\n--the inconsistency of Matt Damon's accent. At times he sounded typically American. At times it sounded like he was *trying* to do an Irish brogue. At his worst he sounded like a white actor trying to do a Native American (think Tonto from Lone Ranger)\n\n--the inconsistency of Matt Damon's eyes. I swear there were a few scenes where it looked like they did some kind of make up effect to give him slightly Asian eyes. But then there were other scenes where he had the permanent look of surprise that one has when they've had a bad eye brow lift. (I guess he's had work done?)  And then there were times when he looked \"normal\". \n\n--the final show down scene with the queen lizard was almost a shot for shot recreation of the final showdown from Independence Day II. \n\n--The magic rock quality that the magnet took on at the end. When there were a couple dozen lizards at the door of the tower and the strategist whips around and holds the magic rock up to the door I actually busted out laughing. ", "parent_id": "t3_5ujuqd", "score": 16, "displayText": "JMCrown", "name": "de3poqy", "sentiment": 2.0, "author": "JMCrown", "children": [{"body": "I still cant figure out what is accent was meant to be, i thought some kind of scandinavian, or scottish, or english, or spanish and even canadian at some point", "parent_id": "t1_de3poqy", "score": 1, "displayText": "McFigroll", "name": "de3t84a", "sentiment": 1.0, "author": "McFigroll", "children": [{"body": "Yeah it changed all the time. I am Swedish so at times I heard some Scandinavian English in there but at other times he just had a plain American accent. That was weird. ", "parent_id": "t1_de3t84a", "score": 1, "displayText": "Ajugas", "name": "de46fbp", "sentiment": 1.0, "author": "Ajugas", "children": [{"body": "My roommate explained it this way: He gave that whole speech about how he fought for different countries under different flags for different people, they would all have different beliefs and feelings associated with their accents, so when he was accessing those feelings, he used those accents.   \nExample:  \n\"I trust no one but myself\" - Weird crazy like Irish thing I guess (feel free to correct me), because the people who felt like that, spoke that way.", "parent_id": "t1_de46fbp", "score": 3, "displayText": "Mongela", "name": "de48538", "sentiment": 2.0, "author": "Mongela", "children": [{"body": "Wow...that is being extremely generous.  Is your roommate Matt Damon by chance?", "parent_id": "t1_de48538", "score": 5, "displayText": "JMCrown", "name": "de4a6sd", "sentiment": 4.0, "author": "JMCrown", "children": [{"body": "Lol no, but its a good way to maintain your suspension of disbelief. ", "parent_id": "t1_de4a6sd", "score": 1, "displayText": "Mongela", "name": "de4c5gf", "sentiment": 3.0, "author": "Mongela", "children": []}]}]}]}]}, {"body": "I completely agree on the last fight scene. I had just seen Independence day II a couple nights before and I couldn't shake the feeling that I had seen the exact same thing before.", "parent_id": "t1_de3poqy", "score": 1, "displayText": "MagicMaddy420", "name": "de47n33", "sentiment": 1.0, "author": "MagicMaddy420", "children": []}]}, {"body": "I really loved the production design and costumes, not so much the uninspired monster design and laughable CGI. It seems like all the work went into designing cool armor and siege weapons, and they didn't think of what the soldiers would actually be *fighting* until the last minute. I'm also not fond of the \"kill the boss and all the minions are somehow disabled\" solution, it always seems like a copout.\n\nI would've liked to see more acrobatics, martial arts, and stunt work. Those were always the strong points in the movie when we got them.\n\nThe plot was pretty bare-bones but it's to be expected. The action blockbusters that do well in China look cool and don't have complex stories, so it's pretty good in that regard.\n\nI just thought it was cool to get a big action blockbuster with a unique Ancient Chinese aesthetic, as opposed to sci-fi or European fantasy. So as far as that goes, I enjoyed it and could recommend it.", "parent_id": "t3_5ujuqd", "score": 14, "displayText": "BuoyantTrain37", "name": "ddunf7e", "sentiment": 1.0, "author": "BuoyantTrain37", "children": [{"body": "Some of the emblems looked good as well as the armor. I just wish they dulled the colors a little, especially the blue armor. The purple seem to fade by the end and wasn't too bad looking at the night. \n\nPerhaps if they had trim with hints of colors would've seemed more sensible and respectable? ", "parent_id": "t1_ddunf7e", "score": 1, "displayText": "UgeneCrabs", "name": "ddxbg3f", "sentiment": 1.0, "author": "UgeneCrabs", "children": [{"body": "The costumes kind of reminded me of the Dynasty Warriors games, so I think that's why I liked them. When they introduce the generals all wearing pretty distinctive color-coded armor, I expected all of them to have more developed personalities, but we really only focused on the commander and Matt Damon, which I think was a big missed opportunity.", "parent_id": "t1_ddxbg3f", "score": 3, "displayText": "BuoyantTrain37", "name": "ddxyh07", "sentiment": 3.0, "author": "BuoyantTrain37", "children": []}]}, {"body": "I am glad it was set in China but I was having my doubts in the first half, like it's just the wall and desert, that's it? Even with the capital city, it didn't seem to cover a lot of what could of been a scenic tour. You know like that  lantern science style pretty ", "parent_id": "t1_ddunf7e", "score": 1, "displayText": "UgeneCrabs", "name": "ddxbixg", "sentiment": 2.0, "author": "UgeneCrabs", "children": []}, {"body": "john wick 2 was campy and plot was bare bones, so appeal for great wall should crossover", "parent_id": "t1_ddunf7e", "score": -10, "displayText": "heykarlll", "name": "ddusstj", "sentiment": 1.0, "author": "heykarlll", "children": []}]}, {"body": "Ok, am I the only one who thought the dude in the picture for The Great Wall discussion was Jack Black??", "parent_id": "t3_5ujuqd", "score": 13, "displayText": "Johnnycc", "name": "ddvkchn", "sentiment": 2.0, "author": "Johnnycc", "children": [{"body": "Now I see it.\n", "parent_id": "t1_ddvkchn", "score": 8, "displayText": "I_dont_study", "name": "ddvsjgp", "sentiment": 4.0, "author": "I_dont_study", "children": []}]}, {"body": "Definitely an enjoyable film. It's a stunningly beautiful action film with a thin plot and not much to think about afterwards. Matt Damon's character isn't some kind of \"White Savior\" and is actually used as a tool by the Chinese army who seem to have superior values. The visuals in many scenes were really impressive and I'd recommend it to anyone who enjoys epic battle sequences.", "parent_id": "t3_5ujuqd", "score": 13, "displayText": "TooShiftyForYou", "name": "ddy3i8y", "sentiment": 3.0, "author": "TooShiftyForYou", "children": [{"body": "The worst part about the white washing comments, is that they are coming from white people ... the movie was a big success in China", "parent_id": "t1_ddy3i8y", "score": 7, "displayText": "el_Di4blo", "name": "ddz3au4", "sentiment": 0.0, "author": "el_Di4blo", "children": []}]}, {"body": "Okay but can we all agree that Commander Lin is bae af?", "parent_id": "t3_5ujuqd", "score": 95, "displayText": "AceTrigger94", "name": "ddunpx5", "sentiment": 2.0, "author": "AceTrigger94", "children": [{"body": "Jing Tian kinda gets a bad rep in China nowadays because of her dull acting range (she is gorgeous no doubt) yet due to her rumored mysterious yet powerful family background she gets to appear in multiple blockbuster films...", "parent_id": "t1_ddunpx5", "score": 43, "displayText": "AwesomeWilliam", "name": "ddup8pg", "sentiment": 1.0, "author": "AwesomeWilliam", "children": [{"body": "TRUE.", "parent_id": "t1_ddup8pg", "score": 19, "displayText": "DragonFireDon", "name": "dduqpdm", "sentiment": 4.0, "author": "DragonFireDon", "children": [{"body": "IF BIG.", "parent_id": "t1_dduqpdm", "score": 16, "displayText": "10dollarbagel", "name": "ddvsxd4", "sentiment": 1.0, "author": "10dollarbagel", "children": []}]}, {"body": "So if she is a shit actor but got where she is due to nepotism or just family money/influence... then how is this a bad rep wouldn't it be an *accurate* one?\n", "parent_id": "t1_ddup8pg", "score": 6, "displayText": "Meph616", "name": "ddwm7bv", "sentiment": 0.0, "author": "Meph616", "children": []}, {"body": "Powerful in what way?  Triads? ", "parent_id": "t1_ddup8pg", "score": 1, "displayText": "JC-Ice", "name": "ddus3dv", "sentiment": 4.0, "author": "JC-Ice", "children": [{"body": "Powerful as she gets to be the main character and gets a lot more screen time even though she isn't talented enough to be in that position. It is rumored that her dad is a powerful figure in the Chinese film industry.", "parent_id": "t1_ddus3dv", "score": 20, "displayText": "AwesomeWilliam", "name": "dduw76q", "sentiment": 4.0, "author": "AwesomeWilliam", "children": [{"body": "its just that her family is super fucking rich. ", "parent_id": "t1_dduw76q", "score": 18, "displayText": "sickboi19", "name": "dduzeiv", "sentiment": 4.0, "author": "sickboi19", "children": []}]}, {"body": "its just a rumor lol. Some people hate on her but keep seeing her in movies so its a joke/meme that she's backed by powerful/rich ppl", "parent_id": "t1_ddus3dv", "score": 5, "displayText": "leeyuuh", "name": "dduu2uw", "sentiment": 0.0, "author": "leeyuuh", "children": []}]}, {"body": "which means she is no way different than 99% of the working actors in Hollywood today", "parent_id": "t1_ddup8pg", "score": 1, "displayText": "JeffDenlon", "name": "ddxjkag", "sentiment": 2.0, "author": "JeffDenlon", "children": []}]}, {"body": "I want her to be Mulan so bad. Can't wait to see her in Pacific Rim: Uprising", "parent_id": "t1_ddunpx5", "score": 48, "displayText": "rjonreview19", "name": "dduo253", "sentiment": 0.0, "author": "rjonreview19", "children": [{"body": "and Kong: Skull Island", "parent_id": "t1_dduo253", "score": 22, "displayText": "sickboi19", "name": "dduzfam", "sentiment": 2.0, "author": "sickboi19", "children": []}, {"body": "I agree would make a GREAT Mulan...", "parent_id": "t1_dduo253", "score": 6, "displayText": "Hopeann", "name": "ddw5pfu", "sentiment": 4.0, "author": "Hopeann", "children": []}]}, {"body": "before anyone else as fuck... Is this statement on fleek? I get confused sometimes.", "parent_id": "t1_ddunpx5", "score": -12, "displayText": "Late_Dent_ArthurDent", "name": "ddupx1i", "sentiment": 0.0, "author": "Late_Dent_ArthurDent", "children": []}]}, {"body": "Just got back. I liked the movie but probably not in the way I was supposed to. I laughed a lot and not at the witty banter.", "parent_id": "t3_5ujuqd", "score": 12, "displayText": "peterezgo", "name": "ddw4rgh", "sentiment": 2.0, "author": "peterezgo", "children": [{"body": "Alot of the audience here (mostly Chinese)  liked Pedro's lines, even I had to laugh with his awkward door closing scene at the end, and Matt didn't even make the kiss! \n\nHow was your audience l", "parent_id": "t1_ddw4rgh", "score": 3, "displayText": "UgeneCrabs", "name": "ddxbud8", "sentiment": 3.0, "author": "UgeneCrabs", "children": []}]}, {"body": "Honestly I liked the movie. I went in expecting some  B-grade scifi/kong fu movie and thats just what I got. I liked the begenning set up and seeing the anime like warriors and their armors and weapons. I thought the fight scenes were fun and I may have had a large crush on the main female lead (pretty girl + kick ass armor= LOVE).\n\nI liked that all the Chinese was in subtitles and that only the girl could speak english and their was a good reason for it. The last half of the movie how ever while cool was the weaker aspect of it and the point i started checking my phone.\n\n\nAs for anyone who would say this is a white savior film I would disagree. Other than bringing the magnet and coming up with the whale hunting idea Matt Damon's character does just about as much or as little as everyone elses. Plus remember this was a Chinese film with a Chinese Producer made by a Chinese studio for a Chinese audience. So I really don't think white savior would count in this instance. \n\nSo good B grade action film to watch at home when you have nothing else to do. ", "parent_id": "t3_5ujuqd", "score": 28, "displayText": "TheMastersSkywalker", "name": "ddv8d9d", "sentiment": 3.0, "author": "TheMastersSkywalker", "children": [{"body": "This movie was not meant for a Chinese audience as much as it was for a western audience. The director stated that the plot and casting choices were made to reach a Western audience. It was also a joint effort between Chinese and U.S. studios. Unfortunately, there's more to reaching a western audience than using a few famous American actors and some pretty CGI which is why it's such a spectacularly unspectacular film", "parent_id": "t1_ddv8d9d", "score": 11, "displayText": "peter_pounce", "name": "ddvl8vd", "sentiment": 1.0, "author": "peter_pounce", "children": [{"body": "> This movie was not meant for a Chinese audience as much as it was for a western audience. The director stated that the plot and casting choices were made to reach a Western audience. \n\nIn other words, they cast Matt Damon in the lead role and called it a day.", "parent_id": "t1_ddvl8vd", "score": 3, "displayText": "slash196", "name": "ddvos3h", "sentiment": 1.0, "author": "slash196", "children": []}]}, {"body": "But there is NO Kung Fu.\n\nPlus I assure you, I KNOW there are prettier and more talented actresses than Tian Jian  by miles in China. \n\nThere are a TONS of very talented and gorgeous  actresses in China than her! There are beauties in China, you watch and can't get them out of your head for days/months/years. I didn't feel that with Tian Jian, at all!", "parent_id": "t1_ddv8d9d", "score": -11, "displayText": "DragonFireDon", "name": "ddv8krv", "sentiment": 4.0, "author": "DragonFireDon", "children": [{"body": "Comon why did I get downvoted? I am not wrong, there is no Kung Fu in this. There ISN'T, period. I am definitely not wrong about this.\n\nNor am I wrong there are far better talented actresses also more beautiful than Jian Tian. Being said before, she has connections so that's why she is getting cast instead of other superior Chinese talents.\n\nIn fact, I thought she was very wooden in this movie. \n\nDownvote me all you want, but I speak the truth!", "parent_id": "t1_ddv8krv", "score": 0, "displayText": "DragonFireDon", "name": "ddviv7n", "sentiment": 1.0, "author": "DragonFireDon", "children": [{"body": "She's always been very wooden in her movies. Very 僵尸脸 (zombie dead face) is a term commonly used for her. ", "parent_id": "t1_ddviv7n", "score": 3, "displayText": "FluffyWof", "name": "ddx9fcm", "sentiment": 2.0, "author": "FluffyWof", "children": []}]}, {"body": "[removed]", "parent_id": "t1_ddv8krv", "score": -33, "displayText": "None", "name": "ddvch3c", "sentiment": -1.0, "author": "None", "children": [{"body": "Tf man", "parent_id": "t1_ddvch3c", "score": 18, "displayText": "KeebeeNacho", "name": "ddvd1rs", "sentiment": 2.0, "author": "KeebeeNacho", "children": [{"body": "taiwan #1 fuck china", "parent_id": "t1_ddvd1rs", "score": -12, "displayText": "edman400", "name": "ddve2ta", "sentiment": 0.0, "author": "edman400", "children": [{"body": "TAIWAN NUMBA WAN", "parent_id": "t1_ddve2ta", "score": 2, "displayText": "ZainCaster", "name": "ddwx974", "sentiment": 2.0, "author": "ZainCaster", "children": [{"body": "\"fuk you, China no. 1, Korea no. 2 Japan no. 3, Taiwan no. 8\"", "parent_id": "t1_ddwx974", "score": 2, "displayText": "UgeneCrabs", "name": "ddxbd81", "sentiment": 0.0, "author": "UgeneCrabs", "children": []}]}, {"body": "Nice try, almost all Taiwanese people are ethnically Chinese though", "parent_id": "t1_ddve2ta", "score": 2, "displayText": "peter_pounce", "name": "ddvl9wm", "sentiment": 3.0, "author": "peter_pounce", "children": []}]}]}]}]}]}, {"body": "When they killed the monster at the campfire with Damon swiping at the camera and then it falls down the cliff I didn't know was there I was legit convinced it was going to be the worst movie I had ever seen. Ended up being decent Netflix quality imo.", "parent_id": "t3_5ujuqd", "score": 9, "displayText": "DragonzordRanger", "name": "ddyuhom", "sentiment": 0.0, "author": "DragonzordRanger", "children": [{"body": "That part was laughably awful, never mind how the monster just ate 2 people instantly like 5 feet away from him before he could turn around, what the fuck was those camera angles.", "parent_id": "t1_ddyuhom", "score": 3, "displayText": "OneofthemBrians", "name": "de3pnnb", "sentiment": 0.0, "author": "OneofthemBrians", "children": []}]}, {"body": "Anyone else notice that Andy Lau played the corrupt cop in Internal Affairs and Matt Damon played the same role in the remake The Departed? \nI wonder if that conversation came up while they were filming.", "parent_id": "t3_5ujuqd", "score": 9, "displayText": "I_dont_study", "name": "ddvtalg", "sentiment": 0.0, "author": "I_dont_study", "children": [{"body": "If there's any justice in the universe, Andy would have pointed at Matt Damon when they met up for the first table read, and said: \"Son of a bitch. He stole my lines!\"", "parent_id": "t1_ddvtalg", "score": 2, "displayText": "soeffed", "name": "de2p4ff", "sentiment": 4.0, "author": "soeffed", "children": []}]}, {"body": "The movie was okay.  Not knowing much about it except the story premise... I was expecting something kinda fun without much depth to it and it delivered.  I was however a little disappointed when I found out it was the director of \"Hero\" and \"curse of the Golden Flower\" behind it.  Both those films are excellent and emotionally provocative whilst this was more in the Pacific Rim category of action flicks.", "parent_id": "t3_5ujuqd", "score": 9, "displayText": "Dong_Hung_lo", "name": "de1kx1r", "sentiment": 2.0, "author": "Dong_Hung_lo", "children": [{"body": "Ugh it looks crap and Matt Damon's accent sucks.  I'm giving this one a pass.", "parent_id": "t1_de1kx1r", "score": 1, "displayText": "my_left_foot", "name": "de2kanx", "sentiment": 0.0, "author": "my_left_foot", "children": [{"body": "its fucking amazing. this film is what films are all about", "parent_id": "t1_de2kanx", "score": 0, "displayText": "Niall93", "name": "de47was", "sentiment": 4.0, "author": "Niall93", "children": [{"body": "I legit laughed out loud at this. ", "parent_id": "t1_de47was", "score": 2, "displayText": "Cheddarwurst", "name": "de57bgt", "sentiment": 0.0, "author": "Cheddarwurst", "children": [{"body": "i sound deluded maybe i was just too high but this film is impeccable. ", "parent_id": "t1_de57bgt", "score": 1, "displayText": "Niall93", "name": "de5v1xj", "sentiment": 4.0, "author": "Niall93", "children": [{"body": "Bruh, it was colorfully okay at best. ", "parent_id": "t1_de5v1xj", "score": 1, "displayText": "Cheddarwurst", "name": "de63xqq", "sentiment": 2.0, "author": "Cheddarwurst", "children": []}]}]}]}]}, {"body": "Comparing \"The Great Wall\" to \"Hero\" or \"Curse\" is selling the director short. While the two other movies were great, but they are no match for Zhang's films from the 1980s and 1990s. \"Raise the Red Lantern,\" and \"The Story of Qiu Ju\" were not just great works of cinematography but also revolutionary for their time. \n\nThis shows that that country seriously has stopped producing good shit. ", "parent_id": "t1_de1kx1r", "score": 1, "displayText": "cagedcat", "name": "de23bcm", "sentiment": 4.0, "author": "cagedcat", "children": [{"body": "The problem with good movies like red lantern and qiu ju is not only do they not sell tickets in the domestic market (China) because the story is too depressing, but also they tend to piss off party officials with the \"negative\" portrayal of China.\n\nThere are plenty of good Chinese directors, like Jia Zhangke for example. But they basically have no money because nobody watches good movies.", "parent_id": "t1_de23bcm", "score": 2, "displayText": "jiristomec", "name": "de29246", "sentiment": 1.0, "author": "jiristomec", "children": [{"body": "Raise the Red Lantern did very well in China - since it was 1992 and very few movies came out that year - it was a socialist state and the gov fully approved of that movie. People gobbled up the earlier Zhang Yimou's films like they were made of gold. China's domestic market that is, not the international market. \n\nIt's never about the box office. Ang Lee made Crouching Dragon and the Hulk so that he could make art films like BrokeBack and the Storm. And even for these \"art films,\" the box office did pretty decent. What doesn't make money are independent films (like those for Sundance), and this is true for the US and China.  \n\n\nWhy is no one watching Jia Zhangke?\n\nHe is a fucking independent filmmaker with no commercial and political backing. \n\nWhat is at the heart of the matter is 1) lack of funding and 2) censorship. Most Chinese movies are funded by the state (private enterprises in China are not exactly \"private\" in the strict sense of the word). Very little money is going to independent films.\n\nThen we have the censorship bureau -- that is one heck of a powerful organization. You want to critique the state? Sure, but your movie doesn't get a release in China. Go ahead, you can show it at the Venice Film Festival and make $200 in Europe and the US. But you know what, we will also forbid you from making another film for 10 years in China. \n\nChina's history of cinema is fascinating. Currently, we are getting even fewer independent films (and big budget \"art films\" are also becoming rarer), due to the changing political climate in recent years. ", "parent_id": "t1_de29246", "score": 1, "displayText": "cagedcat", "name": "de2acta", "sentiment": 2.0, "author": "cagedcat", "children": [{"body": "Do you even facts, bro? \n\nRaise the Red Lantern did NOT do very well in China - seeing as it was BANNED upon release (https://en.wikipedia.org/wiki/Raise_the_Red_Lantern#cite_note-2). And even if it did come out in theaters in 1992 (which it didn't), there was hardly any domestic theatrical market in China to speak of at the time. \n\nJust as an example of what the market was like in the 1990's:\n\nThe highest grossing movie of 1994 was none other than 'The Fugitive', starring Harrison Ford and Tommy Lee Jones. It was the first imported Hollywood film to be officially shown in Chinese theaters since the 1940s' following Communist Liberation (or 'Takeover', if that's your bag), and it made a grand total of...¥25.8 million RMB. \n\nNot accounting for the low rate of yuan inflation and using the present day CNY to USD exchange rate, that comes out to a grand total of...$3.75 million USD, good for the highest-grossing theatrical release in China in 1994. \n\nNo \"gobbling\" of anything happened in Chinese theaters until really the past decade (with the success of 'Titanic' in 1998 being a precursor of the norm that's prevalent today). \n\nAnd granted Jia Zhangke has often run afoul of censors, but his last release ('Mountains May Depart' in 2015) was a high-profile arthouse film for China, and nobody saw it anyway (about ¥20 million RMB gross, or $3 million USD with present exchange rate), at least if you're comparing with mainstream stuff that would consider a ¥20 million gross to be a complete failure. \n\nHowever, you cannot say he doesn't get any money for new projects, since he is absolutely at the top tier of established art film directors in China, and could easily get money for his next project.\n\nYou're going to tell me he can't get funding when he's done 5 feature films and 3 documentaries since 2004 (when his movie 'The World' was the first release to get official approval)? You're going to tell me he can't get funding after 'A Touch of Sin' literally made NO MONEY IN CHINESE THEATERS since it was banned in 2013? He released 'Mountains May Depart' in 2015, after completing a movie that made no money in China in 2013. Sounds like he's really struggling to find investors, right? Right. \n\nRelatively not much money is going to independent films, but that doesn't mean they aren't still being made and shown in Chinese theaters. I'm sure you've seen 'Crosscurrent', 'Kaili Blues', and 'Tharlo', right? All three of those played in Chinese theaters in 2016. Or what about 'Knife in the Clear Water'? That just won Best Director at the Marrakech International Film Festival, with a jury that was headed by Bela Freaking Tarr. \n\nCensorship in China can be ugly, oppressive and creatively stifling, but that doesn't mean things aren't still being made. But like George Lucas said, monetary considerations for Hollywood blockbusters also leads to creative asphyxiation. It is what it is and people still take their films to Sundance or Berlin, and they hope for the best in negotiating with censors (if they didn't get approval already), as well as distributors (who can be just as tough to convince). \n\nIf your point is that nobody is making art or indie-type films in China anymore because there's no money for projects, then that's not really true. If your point is that those kinds of films aren't being allowed into local theaters, then that's also not really true either. Your point about Jia Zhangke not drawing an audience because he can't get money or political backing isn't true, since his last approved film got a shit-ton of marketing for an art film, and audiences simply just weren't interested.   \n\nChina's history of cinema is fascinating, but what's even more fascinating is its present, where there is an imperfect but thriving domestic market that can actually produce and consume its own content in a huge way (and that's not something that can be said for most film markets in the world). \n\n'Raise the Red Lantern' and 'Farewell, My Concubine' came out at a time when there was huge post-Tiananmen cultural interest in China from the global community, and when there was also NO CHANCE that the films could actually find a legit audience in 80s'/early 90s' China that could pay to go see films on thousands of modern theater screens that didn't suck. \n\nThere was literally no other brass ring for Chinese filmmakers of that era to aim for besides international film fest glory. And now that the market has expanded so that a film like 'Mermaid' can achieve the 7th all-time highest-gross from a single territory ($525 million USD earned in China in 2016), you can be sure as shaped-up shit that filmmakers are going to try to get rich quick. \n\nHOWEVER, it's a situation where all boats are being lifted, however imperfectly - with the expansion of the market as a whole and people just watching more movies than ever, it also means the market for arthouse films in China is growing at the same time that the commercial market is exploding. \n\nIt's still a lopsided ratio, but to complain so inaccurately about the present situation while praising the past - that just shows you're not keeping up with what's going on and have no idea about that which you speak of.\n\n\n\n\n", "parent_id": "t1_de2acta", "score": 2, "displayText": "soeffed", "name": "de2oe6n", "sentiment": -1.0, "author": "soeffed", "children": [{"body": "So going back to what I was saying. They made this movie to make money at the box office in China, and that they did. So success! Had they made the kind of \"good movie\" that wins prizes at Oscars and other festivals like Cannes and Oscars, much less people would have gone to see it, and maybe they wouldn't even recover the cost of production. And that is my explanation to Dong_Hung_lo and cagedcat as to \"Why does it feel like that Chinese movies are getting worse and worse every year?\"\n\nBetter or worse is subjective, but what is happening for sure is the directors want to movies that can sell in the domestic market (China). Complete fantasy movies like this where it's swimming and flying around in 100kg+ full plate armor or the ones set in the present day where it looks like all of the characters have unlimited money and don't need to work and just engage in cheesy dialogue and cliched relationships. That is what sells tickets in China. I just hope at some point this type of Chinese movies can move a bit more towards the direction of \"Lord of the rings\" where nerds can argue endlessly about the weight of Gandalf's staff or the flying speed of an eagle, so directors would have to pay a bit more attention to making scenes that look at least somewhat plausible with respect to the laws of physics.", "parent_id": "t1_de2oe6n", "score": 1, "displayText": "jiristomec", "name": "de2uq3t", "sentiment": 1.0, "author": "jiristomec", "children": [{"body": "Yeah, that's the weird thing that's going on in this thread...the film did not make money, and people are saying it did well in China when it didn't. It managed to save face by crossing the 1 billion RMB threshold, but that is like getting a C when you needed an A++ on the biggest test ever. \n\nThe Great Wall was supposed to be the Chinese blockbuster to end all blockbusters since it had the all-time highest budget for any Chinese film, with a reported production budget of $150m USD (though it went overbudget and could be as high as $180m USD). \n\nIf we're talking in very loose terms, then the movie would have to make at least $450-$500m USD worldwide to simply not lose money. Its gross is going to squeak just barely past $300m USD worldwide (currently at approx $270m USD), and that means the Hollywood and Chinese investors are getting a serious haircut with TGW. \n\nFor comparison, 'Mermaid' cost ¥400m RMB ($58m USD), which is already a really high budget for a Chinese film, since most mainstream films will cost between one-quarter and one-eighth of that amount. It needed to gross around ¥1.2 billion RMB to break even, but instead went all the way to ¥3.4 billion RMB.\n\nGiven the ambitions that 'The Great Wall' had, I think anything less than ¥2.5 billion RMB in China would have been a disappointment, and in the end it couldn't even muster half of that (it did ¥1.17 billion RMB, even against crappy competition). \n\nAs for wanting to see something that compares with 'Lord of the Rings'...I think you gotta keep in mind that Hollywood is the only entity in the world that can produce films of that caliber. \n\nThe series might feature a director from New Zealand and cast and crew from Europe and beyond, but make no mistake, LOTR is pure Hollywood. Could it have been made without the backing of a major studio? I'm not sure that it could, and the same goes for 'Harry Potter'. Could the 'Potter' series have been done only with support from British production companies and no investment, development, marketing and distribution backing from Warner? Nope, I don't think so.\n\nNobody would expect the Bollywood or the French or Italian or Scandinavian film industries to try and mount a huge and epic fantasy series on their own, but the expectations for China is a different case altogether. Even Japan can't do live action films that the rest of the world wants to see! Did you try to watch 'Attack On Titan'? I mean...\n\n'The Great Wall' was the first sacrificial lamb, and hopefully it didn't ruin things for future attempts from Hollywood and China to create a co-production film that everybody wants to see. It might take 10 years or it might never happen. Like my man Clooney circa 2009, it's all pretty up in the air at this point.  \n", "parent_id": "t1_de2uq3t", "score": 1, "displayText": "soeffed", "name": "de2x41f", "sentiment": 1.0, "author": "soeffed", "children": []}]}, {"body": "Wow, I so want learn from you, ye mighty one. I'm not saying you are not good at watching good Chinese films. But chill man. Take a break. \n\nI'm a girl, by the way. Not your bro. \n\nI still stand by my earlier assessment, which is true. \n\n1) The Chinese love and can appreciate arthouse films, or at least big budget ones. The growing educated, middle class is a big consumer. \n\n2) Recent censorship has decreased the number of good big budget art house films that are shown in the theaters \n(Such as \"Let the Bullet Fly\") in favor of big budget films that suck ass. \n\n3) Zhang Jiake makes good indie films, but he's not popular, just as other art house directors are not popular in the US. \n\n4) I know good indie films are made, but they don't have the level of commercial backing that big directors' arthouse projects get. I personally know indie film makers who find it much harder to find funding in China and had trouble with the censorship board since 2011. And plenty of films don't make past the censorship board. \n\nMinor mistake about Raise the Lantern. But his \"Qiu Ju\" and other films were a tremendous success in China and won the Golden Rooster Awards. \n\nBtw, thanks for recommending Tharlo and Knife in the Clear Water. These look very promising. ", "parent_id": "t1_de2oe6n", "score": 1, "displayText": "cagedcat", "name": "de33apt", "sentiment": 2.0, "author": "cagedcat", "children": []}]}]}]}]}]}, {"body": "I saw this on Wednesday. And this was after I saw Rings and 50 Shades Darker, I'm not sure if that has anything to do with how much I liked this movie. It was so refreshing to see characters, and to see an actual story where things happen. It was visually rich, and the writing was okay, but that's good enough. It was fun. 6/10.", "parent_id": "t3_5ujuqd", "score": 9, "displayText": "cloud_loud", "name": "ddvmjyn", "sentiment": 2.0, "author": "cloud_loud", "children": [{"body": "how the heck are you seeing so many movies in theaters", "parent_id": "t1_ddvmjyn", "score": -1, "displayText": "heykarlll", "name": "ddx0xcj", "sentiment": 4.0, "author": "heykarlll", "children": [{"body": "I can't afford to pay to see movies often, but there are these things called advance screenings. Where they show you movies before they come out and for free.", "parent_id": "t1_ddx0xcj", "score": 5, "displayText": "cloud_loud", "name": "ddx1fk6", "sentiment": 0.0, "author": "cloud_loud", "children": []}]}]}, {"body": "My issue with the film could be summarized as a lack of character development. They gave side characters way too much while not focusing on the most important people. [Like, why do I care that DeFoe's character, who went from super chill to psycho way too quickly, got his comeuppance? I barely knew him.](#spoiler) Also, when we couldn't see the monster at the beginning and it was a bunch of horrible close ups- I hated that bit. But I LOVED the world in which the film was set. The battle sequences were fabulous, the use of color was grand, and I loved the ingenuity in every invention and tactic.", "parent_id": "t3_5ujuqd", "score": 7, "displayText": "trigunnerd", "name": "ddzk1od", "sentiment": 1.0, "author": "trigunnerd", "children": []}, {"body": "This is a movie you want to rent.\n\n", "parent_id": "t3_5ujuqd", "score": 20, "displayText": "AustinQuinn", "name": "ddumiwa", "sentiment": 0.0, "author": "AustinQuinn", "children": [{"body": "Actually, I don't know about renting this. The whole reason to see this movie is the grand/epic visual and action aspects. Like I would recommend seeing this on the biggest screen you can find.\n\n Unless you have an IMAX at home.", "parent_id": "t1_ddumiwa", "score": 18, "displayText": "DragonFireDon", "name": "ddupvkz", "sentiment": 4.0, "author": "DragonFireDon", "children": [{"body": "While much of the production design is gorgeous, many of the visual effects don't hold up too well by modern standards.  It may actually look better in a smaller screen and lower res.", "parent_id": "t1_ddupvkz", "score": 10, "displayText": "JC-Ice", "name": "ddus5oi", "sentiment": 2.0, "author": "JC-Ice", "children": []}, {"body": "I was thinking the same thing. The visual on the size of the wall and epic feeling of the set was good on a large screen", "parent_id": "t1_ddupvkz", "score": 2, "displayText": "usechooserid", "name": "ddv84a8", "sentiment": 2.0, "author": "usechooserid", "children": []}]}, {"body": "Not even for me. I'm torrenting this.", "parent_id": "t1_ddumiwa", "score": -3, "displayText": "mnl2", "name": "ddw3dnr", "sentiment": 0.0, "author": "mnl2", "children": []}]}, {"body": "Zhang Yimou really seems to be wasting his talent these days. It's a shame.", "parent_id": "t3_5ujuqd", "score": 6, "displayText": "Delta_Assault", "name": "dduso0o", "sentiment": 0.0, "author": "Delta_Assault", "children": [{"body": "He is slowly becoming like Michale Bay", "parent_id": "t1_dduso0o", "score": 3, "displayText": "sickboi19", "name": "dduzdnu", "sentiment": 2.0, "author": "sickboi19", "children": [{"body": "I think I'll rewatch \"To Live\" tonight to remind myself of when he used to be good.", "parent_id": "t1_dduzdnu", "score": 1, "displayText": "Delta_Assault", "name": "ddvt5kh", "sentiment": 4.0, "author": "Delta_Assault", "children": []}]}]}, {"body": "Strange film.  Was expecting to really enjoy it, but didn't really.  Unnecessarily long, very baggy.\n\nThe whole film is one big build up to the final battle...there's not much else that goes on.  \n\nVery silly, not spectacular, real shame.  There was real potential but they wasted it.", "parent_id": "t3_5ujuqd", "score": 7, "displayText": "thedeadmann", "name": "ddwfnwe", "sentiment": 1.0, "author": "thedeadmann", "children": [{"body": "The premise from what was shown on the trailers looked really clunky to me...didn't think there'd be much in here, so wasn't disappointed.", "parent_id": "t1_ddwfnwe", "score": 1, "displayText": "CQME", "name": "ddx0os3", "sentiment": 1.0, "author": "CQME", "children": []}]}, {"body": "Just got back from this in IMAX 3D.\n\nIncredible visual spectacle and battle sequences unfortunately paired with a generic action movie plot and a cliché ending. Acting was pretty average all the way through. Really thought the film could have actually been better if it was maybe 10-15 minutes longer to develop the characters and relationships more. On a final note, IMO the soundtrack for this film was actually *incredible*. I normally don't notice film scores unless they really stand out and this one definitely did.\n\nAll in all: 7/10", "parent_id": "t3_5ujuqd", "score": 7, "displayText": "AndyChrono", "name": "ddxlco8", "sentiment": 1.0, "author": "AndyChrono", "children": []}, {"body": "I went to see The Great Wall this morning in IMAX 3D, and I genuinely liked this movie.\n\nI've been wanting to see it since I know Zhang Yimou was directing it, and I was familiar with his other work.\n\nI thought it was a great epic monster movie, and I loved how Zhang Yimou et al. used color-- especially in the beginning to highlight all the different parts of the army and towards the end inside the tower.   \n\nI wouldn't say this is his best work, but I think it was successful in what it tried to be, and the visuals were great especially in an IMAX setting. I think it added to the enormity of the wall in certain scenes.\n\nI am critical towards the opinion that this movie is somehow whitewashing or plays the white savior trope, though I understand why some feel that way because of how it's marketed in the US. The chinese poster's for the Great Wall tend to place the cast on more equal terms, unlike the US posters that have Matt Damon front and center.\n\nThere are criticisms to this movie, but I think the outrage for Matt Damon being in this movie is a bit misplaced, and I think that energy would be better spent celebrating and sharing examples of some great Chinese films. I appreciated the fact they decided to keep several dialogue scenes in Chinese with subtitles, instead of having the entire film in English. I hope this continues for future productions. I don't know if Yimou had to fight to keep subtitles in, but if he did, I'm glad. \n\nOverall, the $11.29 IMAX ticket was worth it, for me at least.", "parent_id": "t3_5ujuqd", "score": 11, "displayText": "Firefox711", "name": "ddvto6p", "sentiment": 4.0, "author": "Firefox711", "children": [{"body": "> I am critical towards the opinion that this movie is somehow whitewashing or plays the white savior trope, though I understand why some feel that way because of how it's marketed in the US. \n\nIn China the main criticism is that Matt Damon gets a lot of screen time over popular Chinese actors, while Jing Tian is seen as a bad actress getting screen time over popular Chinese actors. \n\nSo yeah Matt Damon isn't the savior of China, but the whole thing comes together like an after-school special with an overbearing message to Chinese critics. \n\n\n\n\n", "parent_id": "t1_ddvto6p", "score": 3, "displayText": "AndyLC", "name": "ddwb67s", "sentiment": 1.0, "author": "AndyLC", "children": [{"body": "Hi, thanks for your response.\n\nI think that is a fair criticism to make regarding the screen time, and one that is understandable. I'm very curious to know what the overall reaction was in China, and I've been learning a lot reading from people's comments in this thread. I saw the segment of the link you posted with \"China's Oprah\", and she made a lot of great points that gives the idea that the film wasn't unanimously admired. I really appreciated her comments from the perspective about china's culture and how it will be represented. The way in which she admits, if the movie was called anything else besides \"the GREAT wall\" she would just concede it as a popcorn flick, but the fact that it contains the word Great in the title is something that is very important for her, and it is something I would not have otherwise considered had you not shared that link, so thank you!\n\nAlso her line about what ever happened to Zhang Yimou's spirit who made \"The Story of Qui Ju\" I was like damn! Right on!\n\nDo you know if there's a website where I could watch regular episodes from that show? Seems very interesting :) Again, thanks a bunch!", "parent_id": "t1_ddwb67s", "score": 5, "displayText": "Firefox711", "name": "ddwcwuf", "sentiment": 4.0, "author": "Firefox711", "children": [{"body": "I got the link from [a Quora answer](https://www.quora.com/What-are-native-Chinese-peoples-reaction-to-the-upcoming-movie-The-Great-Wall), there's a fair amount of mainland Chinese on there. ", "parent_id": "t1_ddwcwuf", "score": 1, "displayText": "AndyLC", "name": "ddxkbsf", "sentiment": 1.0, "author": "AndyLC", "children": []}]}]}, {"body": "$11.29?! Shit my IMAX ticket was $20.50", "parent_id": "t1_ddvto6p", "score": 3, "displayText": "JeffDenlon", "name": "ddxhusg", "sentiment": 0.0, "author": "JeffDenlon", "children": []}, {"body": "[deleted]", "parent_id": "t1_ddvto6p", "score": -4, "displayText": "None", "name": "ddw3l3a", "sentiment": -1.0, "author": "None", "children": [{"body": "Well it might make you feel better that the film's been critically panned in China and underperformed compared to the huge marketing push it had.\n\n\"China's Oprah\" calls it an embarassment to Chinese culture:\nhttps://www.youtube.com/watch?v=E1B27Cr331w\n ", "parent_id": "t1_ddw3l3a", "score": 7, "displayText": "AndyLC", "name": "ddwb7ug", "sentiment": 2.0, "author": "AndyLC", "children": [{"body": "http://www.forbes.com/sites/scottmendelson/2017/02/19/box-office-matt-damons-the-great-wall-was-a-hit-in-china-but-not-in-america/#e496adf4a6d0\n\nIt made more than its budget in China alone ... not exactly underperforming ", "parent_id": "t1_ddwb7ug", "score": 1, "displayText": "el_Di4blo", "name": "ddz3d5g", "sentiment": 0.0, "author": "el_Di4blo", "children": []}, {"body": "[deleted]", "parent_id": "t1_ddwb7ug", "score": -2, "displayText": "None", "name": "ddwbaa2", "sentiment": -1.0, "author": "None", "children": [{"body": "\"It's not personal\" Proceeds to whine and moan about how it's offended him and his enlightened sensibilities\n\nNice meme", "parent_id": "t1_ddwbaa2", "score": 1, "displayText": "ThatRule34Guy", "name": "de12pk1", "sentiment": 1.0, "author": "ThatRule34Guy", "children": []}]}]}, {"body": "Hi Dargomir. First of all, I want to thank you for your response to my comment, and for taking the time to share your view of the film. :) \n\nLet me also say that I agree with you're underlying point that the \"white savior\" trope can have harmful impacts whenever a culture's history or story is exploited in order for a white protagonist (or any non-member of that group's history for that matter) to come in and save the day in place of that group's shared history--especially when it is done to make a buck. And since movies are communicated to massive audiences, it has the dangerous potential to spread a \"single story\" of that group's history which may be incomplete or flat out inaccurate. \n\nIt's why I enjoy seeing the films of other countries, because I get the chance to see how they tell their stories, how they perceive certain events to have happened, and their reactions to it. It allows me to empathize with the stories of their own heroes. I'm reminded of Zhang Yimou's \"The Story of Qiu Ju\", where the main protagonist in that film is a pregnant wife who has traveled a long ways from her village, and is persistent in pursuing justice for her husband's injury even if it means putting up with a bureaucracy and other people's demands encouraging for her to go back home.\n\n I mentioned earlier how I am critical towards the opinion that The Great Wall somehow whitewashes or plays the white savior trope. I think a valid argument could be made for the white savior trope, and I would be open to hearing it. I think these types of discussions are important given the history of US cinema, and its examples found throughout it.\n\nHowever, as it pertains to The Great Wall I still conclude that the outrage towards Matt Damon's presence in the movie is misplaced, and that by having Matt Damon in the movie, it somehow whitewashes the story. I do not intend to convince you of my position, but rather to clarify my reasoning behind my conclusion. If you disagree with my reasoning, that is wonderful and I would love to continue having this discussion with you or anyone else who sees the film differently. :) \n\nI think it helps to clarify what we mean by whitewashing. In the context of Matt Damon's casting in the film, the premise is that by having a white actor (in this case Matt Damon) cast in a non-white character role, you are thereby whitewashing that element of the story. I would agree with you if that was the case, especially if Matt Damon was cast as one of the generals leading the soldiers on the wall or the emperor of China. \n\nHowever, given what we see and hear in the film, Matt Damon's role  as a character is meant be a mercenary which serves as a contrast to one of the main female soldiers who is fighting for something beyond just money. There is a scene in which she asks Damon's character who he has fought for, and he mentions how he has fought for many 'flags\" from Spain, to France, and even the Pope (we presume he's talking about the crusades). As I understand it, Damon's character is a mercenary from the west who has been paid, or will be paid if he can manage to find black powder and return it to the west. Unless you are suggesting that this role should have been played by a non-white actor, I don't see how this is whitewashing a role.\n\nAs for the white savior trope, I'm not entirely convinced. For a while, towards the end of the film, (although the movie plot-wise is very thin) Damon's character is unsuccessful in killing off the queen. As cheesy as the image may seem, it was both Damon's character and Commander Lin who took down the queen together. I think she was just as active in saving her own country, if not more considering she had an effect on Damon's character decision to stay and fight rather than run away for the pursue of money. It's almost a weird reversal on the white savior trope in a way.\n\nCould this film have been made without Matt Damon's role in it? Definitely. I'm sure you could just have a monster film about the great wall, with nothing but Chinese characters and actors. Could the mercenary have been from elsewhere besides the west? Sure. I don't see why mercenaries wouldn't exist in other parts of the world at the time. I'm sure their were probably even mercenaries acting within the East region. It would still be a valid way to tell a story, but it would be a different story than the one that Zhang Yimou decided to tell. \n\nWhich brings me to my last point. If Zhang Yimou, a Chinese film director, had decided to whitewash his own country's history, I would be one the first to be disappointed. For Zhang Yimou, (who was banned from making films from his own country for a period of time for depicting a film [To Live] that was critical of communist policies) to consider whitewashing certain elements of Chinese history would be surprising and unlike him given his previous filmography. Obviously The Great Wall is not a documentary, but I think Zhang Yimou has a vested interest in portraying Chinese roles respectfully in a way that is accurate and faithful at least to his own understanding of his culture's current and past history. I think more than anything it is the people of China who would feel the most betrayed if their own history or culture had been whitewashed. Why would Zhang Yimou be any different?\n\nIf you feel I have misunderstood or mischaracterized your point of view, feel free to let me know. :) I thank you for taking the time to read this far, and I encourage others to celebrate stories and experiences in films made beyond the US. As I understand it, this film was a co-production between studios in China and the US, so there was bound to be some elements in order to appeal to a western/US audience. I will say that the US trailer for the Great Wall, for someone who hasn't yet seen the movie, does set up the potential for a movie like this to become whitewash. I think for those who see the film for themselves, may not find that to be the case.", "parent_id": "t1_ddw3l3a", "score": 2, "displayText": "Firefox711", "name": "ddwacvt", "sentiment": -1.0, "author": "Firefox711", "children": []}, {"body": "What does this even mean?", "parent_id": "t1_ddw3l3a", "score": 1, "displayText": "huracans", "name": "ddw4q4v", "sentiment": 0.0, "author": "huracans", "children": [{"body": "[Something that your feeble brain cannot grasp!](https://www.youtube.com/watch?v=FW1QY76d-40)", "parent_id": "t1_ddw4q4v", "score": -1, "displayText": "Dargomir", "name": "ddw5fvx", "sentiment": 0.0, "author": "Dargomir", "children": []}]}]}]}, {"body": "Did anyone else hurt to see how the crane women were being devoured? It was really visceral. Also really awesome? Like they're front of the line warriors yet fought gracefully with no objections.", "parent_id": "t3_5ujuqd", "score": 6, "displayText": "Retroself", "name": "ddwl1v1", "sentiment": 4.0, "author": "Retroself", "children": [{"body": "Yeah! I have to admit that I'm not really sure why you would choose to waste soldiers like that (it seems like an ineffective use of manpower), but it's hard to judge because we didn't see what things were like the last time the monsters attacked.", "parent_id": "t1_ddwl1v1", "score": 4, "displayText": "perdur", "name": "ddwvffb", "sentiment": 0.0, "author": "perdur", "children": []}, {"body": "But why? Why on Earth would you use that method, there were thousands of those creatures.", "parent_id": "t1_ddwl1v1", "score": 2, "displayText": "JukePieStalker", "name": "ddwnbyn", "sentiment": 1.0, "author": "JukePieStalker", "children": [{"body": "If the beasties jump after the bait women then they don't climb the wall?", "parent_id": "t1_ddwnbyn", "score": 1, "displayText": "trilobitemk7", "name": "ddwoe8f", "sentiment": 1.0, "author": "trilobitemk7", "children": []}]}]}, {"body": "I really liked  it,\nDon't go into the cinema hoping this will be a Oscar Film, because it isn't. But the CGI is amazing and Pedro's one liners are really funny.\nActing is OK not the best but pretty good.\n\nAll in all: 7.5/10", "parent_id": "t3_5ujuqd", "score": 5, "displayText": "berndeklerk", "name": "ddxqs8v", "sentiment": 2.0, "author": "berndeklerk", "children": []}, {"body": "So I had no idea this was a monster (alien?) movie. lol.\n\nI saw some early promos but i never watch trailers and it showed one monster thing so I was expecting a kinda 300 esq stylized war movie. With a few mythical creatures.\n\nHad no idea it was  full blown monster movie. hahaha.\nStill, it was okay. Fun popcorn flick, but not much else. ", "parent_id": "t3_5ujuqd", "score": 5, "displayText": "CatoDarpa", "name": "ddxuu79", "sentiment": 2.0, "author": "CatoDarpa", "children": []}, {"body": "It was watchable enough, I just can't stand the whole \"kill the queen and rest magically die\" angle. It's too much of a get out of jail free card.", "parent_id": "t3_5ujuqd", "score": 6, "displayText": "MontanaSD", "name": "ddy90xp", "sentiment": 1.0, "author": "MontanaSD", "children": [{"body": "you need to watch Great Wall Anthology.. the Tao Tei was designed with a flaw in mind.. some rebel fighters stole the plan", "parent_id": "t1_ddy90xp", "score": 5, "displayText": "skybala", "name": "de10ul1", "sentiment": 4.0, "author": "skybala", "children": []}]}, {"body": "Definitely enjoyed this film, it doesn't pretend to be anything other than what it is, which is a fun action flick with good effects.\n\nThe scenes on the wall with the soldiers various colored armor were a highlight, was a real spectacle to see.\n\nThe relationship between Pedro Pascal and Matt Damon was very good, but felt there should have been more scenes with them, and perhaps a little more backstory.", "parent_id": "t3_5ujuqd", "score": 6, "displayText": "Hogglebog", "name": "ddz4ii8", "sentiment": 3.0, "author": "Hogglebog", "children": [{"body": "It pretends that Americans are Chinese.", "parent_id": "t1_ddz4ii8", "score": -5, "displayText": "karljt", "name": "ddzpcu6", "sentiment": 4.0, "author": "karljt", "children": [{"body": "Have you seen it?\n\nYour statement suggests you have not seen it...", "parent_id": "t1_ddzpcu6", "score": 6, "displayText": "Hogglebog", "name": "de0h26l", "sentiment": 0.0, "author": "Hogglebog", "children": []}]}]}, {"body": "Takes a few liberties.", "parent_id": "t3_5ujuqd", "score": 5, "displayText": "YoungLadyGodiva", "name": "de3immm", "sentiment": 3.0, "author": "YoungLadyGodiva", "children": []}, {"body": "This is a brainless monster movie with cool and good-looking action. No problem with such films being around, they should exist, but when they take themselves a tad too seriously it's annoying.\n\nThey kept pushing a theme about greed that wasn't there. Hey, intro here, the monsters actually symbolize greed, and our main hero is so greedy, mm, will he overcome that greed we wonder... But no, the monsters were just monsters, and there was nothing too defining about Matt Damon to make him 2-dimensional. I was bothered the movie was trying to convince me it was anything more than mindless fun.\n\nThe film tells you it has meaning. It tells you to care about deaths for characters you don't know. It tells you to laugh with forced jokes, about half of which being about food (because being hungry is funny!). I don't like The Great Wall telling me it's got storytelling any more than I like Why Him? telling me what I'm looking at is funny.\n\nTop it off with a couple bad performances like that of Tian Jing (in my humble opinion), and this film is just disappointing.", "parent_id": "t3_5ujuqd", "score": 16, "displayText": "PhantomV13", "name": "dduue7w", "sentiment": 1.0, "author": "PhantomV13", "children": [{"body": "A bit more backstory to kitchen kid, strategist Wong, maybe tension between capital and the wall, you know like the nights watch 😏\nAll the other commanders too, their colored armor defined them like power rangers but with no character! Wish there were more behind them ", "parent_id": "t1_dduue7w", "score": 5, "displayText": "UgeneCrabs", "name": "ddxbnci", "sentiment": 2.0, "author": "UgeneCrabs", "children": []}]}, {"body": "TGW's situation reminds me a lot of Edge of Tomorrow in that it got a lot of initial hate but the movie itself is pretty darn good. Reading the comments on Reddit, I went in expecting Dragon Blade or Warcraft quality but it was much better.\n\nThe first few moments I was apprehensive. There was a short chase we'd all seen before, then some fireplace banter, and the make or break moment where the Matt Damon and Pedro \"Oberyon\" Pascal first meet the Chinese at the Great Wall. It could've gone really cheesy and nationalistic but it didn't and soon we were just watching the story about a mercenary and his friend happening upon a crazy situation.\n\nThere were many things it did right and I'll jot each one down.\n\nThe relationship between Matt and Pedro was the highlight for me. Like Edge of Tomorrow, it's a shame the commercials didn't feature more of the banter between them because we were laughing each time they were together. Pedro Pascal definitely has a future in action comedies and Matt Damon's accent could pass as Brad Pitt's brother in Snatch.  Also, for a blockbuster, the characters were well defined and rich with conflict.\n\nThe visuals were absolutely amazing. Someone compared it to watching the opening ceremony of the Beijing Olympics and it's a good comparison. You'll get to see the Great Wall, inventive battles on it, the monster cgi was actually not distracting and look better than World War Z's zombies, the costumes are gorgeous and the colors help to organize the different groups of soldiers. Please don't watch it online because its visuals are such eyecandy.\n\nFor anyone worried about Chinese propaganda, the message of the movie is cooperation and trust over greed. There are both bad and good Western and Chinese characters. I never got the sense they were good or bad because of where they were from but because of who they were. Both Western and Chinese characters kicked major ass and equally saved the day. If scenes of Chinese people kicking monster ass unsettles you, then it's just you.\n\nThe marrying of Western and Chinese elements were really well done. We got a tight Western structure and the most Chinese things invariably were the dressings on it. So there's really sweet archery from Matt Damon and kung fu and Chinese battle tactics, Lord of the Rings-type pacing and suspense and monsters and a Chinese Forbidden City-like capital. My favorite scene was the singing and lantern scene because it was very Chinese and appreciated the filmmakers respecting us enough not to cut it.\n\nI'm a big Hong Kong cinema fan so seeing Matt Damon and Andy Lau together was awesome (they starred in their respective versions of Infernal Affairs).\n\nSo those are my two cents on TGW. It's a fun quality blockbuster that I wholeheartedly recommend.  Grade: A.", "parent_id": "t3_5ujuqd", "score": 9, "displayText": "heykarlll", "name": "ddyt9t9", "sentiment": 2.0, "author": "heykarlll", "children": [{"body": ">reminds me a lot of Edge of Tomorrow in that it got a lot of initial hate\n\nI like remember this being totally incorrect lol", "parent_id": "t1_ddyt9t9", "score": 5, "displayText": "Michaelbama", "name": "ddyylya", "sentiment": 1.0, "author": "Michaelbama", "children": []}]}, {"body": "Think of this movie as a sandwich - in the middle is some deeply satisfying bacon and sausages from a decent butcher. But the bread is made from dead bodies and dogshit. The battles are the meat of the movie and everything else is the bread. However, I wasn't disappointed because I knew what I was getting. This movie will just be used to demo 4K TVs and that will be the film's legacy.", "parent_id": "t3_5ujuqd", "score": 11, "displayText": "TheUltimateInfidel", "name": "ddzlol8", "sentiment": 2.0, "author": "TheUltimateInfidel", "children": []}, {"body": "It isn't without tropes and there are a few head-scratchy, imitation-Hollywood moments, but every so often you're reminded that you're watching a movie by a MASTER (in Zhang Yimou). \n\nVisually, this probably won't be topped until Oscar season. A lot of the criticisms I've seen have been valid, but to say it's a \"horrible\" movie is, I think, wrong based on the incredible imagery alone. ", "parent_id": "t3_5ujuqd", "score": 6, "displayText": "Bowlero", "name": "ddv6b5u", "sentiment": 1.0, "author": "Bowlero", "children": []}, {"body": "Well, the Chinese sure liked it--The Great Wall grossed $170 million dollars, putting the movie in like 5th place all time--By comparison,Star Wars TFA only grossed $124 million there", "parent_id": "t3_5ujuqd", "score": 5, "displayText": "outrider567", "name": "ddw2yfl", "sentiment": 2.0, "author": "outrider567", "children": [{"body": "The Chinese did not like it. Wanda, the company that bought out Legendary, made sure to cook the numbers so it looks like the movie was making huge bucks. But both audience reception and critics reception were less than favorable and the movie has horrible ratings on Chinese review sites. Also not sure where you got the \"5th place all time\" thing because it's actually #20.", "parent_id": "t1_ddw2yfl", "score": 3, "displayText": "brunchingermany", "name": "ddxjvs3", "sentiment": 0.0, "author": "brunchingermany", "children": []}, {"body": "Star Wars is not a good comparison point being comparatively weak in China. They like Hollywood films just fine with a number [last year](http://www.boxofficemojo.com/intl/china/yearly/?yr=2016&p=.htm) and [before](http://www.boxofficemojo.com/intl/china/yearly/?yr=2015&p=.htm) that beating both SW films handily. \n\nThis movie is getting to be a fairly modest result though the dissonance between the probable American and Chinese results is striking we've seen that before too. Warcraft, Pacific Rim, and even say Furious 7 which pulled in 390 million in China against a less notable 353 million American result.\n\nFor all that, yes this did fairly well in China, which if China paid this movie might even save the movie financially. And the potential is there which has certain Hollywood execs salivating all over their expensive suits... though my personal bet is that they'll be disappointed when in a couple of years China just turns to domestic features that have closed the budget/FX gap and you'll see American films underperforming next to them. ", "parent_id": "t1_ddw2yfl", "score": 4, "displayText": "SolomonBlack", "name": "ddxwjjr", "sentiment": 1.0, "author": "SolomonBlack", "children": []}, {"body": "Seems like it's only self loathing white college students that think casting a white guy was racist. Who would have thought?", "parent_id": "t1_ddw2yfl", "score": -6, "displayText": "Thunderstruck79", "name": "ddxfzig", "sentiment": 1.0, "author": "Thunderstruck79", "children": []}]}, {"body": "I felt like all the trailers for this movie focused on Matt Damon and nothing else. Made me very suspicious that the studio was relying on Damon to get western audiences to see the movie and that the rest of the movie just wasn't very good. And from the reactions I've been seeing from most people it sounds like my suspicion was accurate.\n\nThat said I will watch it eventually, just not at the theater. I am curious though, are the Chinese actors dubbed over or did they subtitle?", "parent_id": "t3_5ujuqd", "score": 5, "displayText": "Baron164", "name": "ddzru4s", "sentiment": 1.0, "author": "Baron164", "children": [{"body": "Subtitles, Pascal has a few lines in is subtitled as well.", "parent_id": "t1_ddzru4s", "score": 2, "displayText": "Steellonewolf77", "name": "ddzzcxr", "sentiment": 2.0, "author": "Steellonewolf77", "children": []}, {"body": "I actually feared it would focus on Matt Damon too much, but I found that at least the main actress lady got a lot of screen time too. ", "parent_id": "t1_ddzru4s", "score": 1, "displayText": "tw04", "name": "de150p5", "sentiment": 1.0, "author": "tw04", "children": []}]}, {"body": "My personal summary...this movie was not made for North American audiences and it's the international  (china) box office that they were aiming for. So for as Chinese movie..it was good. Because Chinese audiences and American audiences look for different things In  their movies.  Good Chinese movie..bad American movie..", "parent_id": "t3_5ujuqd", "score": 3, "displayText": "al57115", "name": "de1d632", "sentiment": 1.0, "author": "al57115", "children": [{"body": "I'm Chinese, and this movie is pretty standard for Chinese releases ---meaning, it's a fucking load of crap. ", "parent_id": "t1_de1d632", "score": 5, "displayText": "cagedcat", "name": "de23cz3", "sentiment": 0.0, "author": "cagedcat", "children": [{"body": "There's a difference between Chinese and Chinese American. You sound like the latter.", "parent_id": "t1_de23cz3", "score": 1, "displayText": "unamity", "name": "de4kp66", "sentiment": 2.0, "author": "unamity", "children": []}]}, {"body": "I enjoyed the movie, because I dated a Chinese gal. So for biased reasons it can happen.", "parent_id": "t1_de1d632", "score": -6, "displayText": "DavidRagnar", "name": "de1jumd", "sentiment": 3.0, "author": "DavidRagnar", "children": []}]}, {"body": "The thumbnail for the discussion is hilarious.", "parent_id": "t3_5ujuqd", "score": 6, "displayText": "redflcn", "name": "de4y2ro", "sentiment": 4.0, "author": "redflcn", "children": []}, {"body": "I just came here to say the thumbnail pic on the header for this film makes Matt Damon look like Jonah Hill", "parent_id": "t3_5ujuqd", "score": 8, "displayText": "blackgaylibertarian", "name": "dduz5gt", "sentiment": 4.0, "author": "blackgaylibertarian", "children": [{"body": "More of a Jack Black to me", "parent_id": "t1_dduz5gt", "score": 10, "displayText": "Flucifer_Queen666", "name": "ddv0jct", "sentiment": 2.0, "author": "Flucifer_Queen666", "children": []}, {"body": "You made me scroll up. ", "parent_id": "t1_dduz5gt", "score": 3, "displayText": "AdamFiction", "name": "ddv7fu0", "sentiment": 4.0, "author": "AdamFiction", "children": []}]}, {"body": "the bromance was cute <3.  the romance less so.  and the general are you kidding me what an idiot.  he knew one was behind and baiting and still got bit and dead", "parent_id": "t3_5ujuqd", "score": 4, "displayText": "jivebeaver", "name": "ddx3y02", "sentiment": 2.0, "author": "jivebeaver", "children": []}, {"body": "Story and acting wasn't great. Cinematography was amazing though.\n\nThe use of color, the scale of the Great Wall and its combined use with the air events was beautiful.", "parent_id": "t3_5ujuqd", "score": 5, "displayText": "Nexism", "name": "ddx6trc", "sentiment": 4.0, "author": "Nexism", "children": []}, {"body": "I saw the movie tonight in Imax. It was good, but I don't think it was a great movie. For a movie that was being bragged about as the movie expense Chinese movie of all time the monster lizards looked really lame and the special effects had a very cheap look to it at times.\n\nMatt Damon and Jing Tian are the two leads of this movie and they are definitely co-leads in the film. Jing Tian is incredibly charismatic and beautiful and incredible as the leader of the idless army. I definitely want to see her in more films. Looks like Hollywood knows how good she is since she is also in the new King Kong movie and Pacific Rim 2. Look forward to seeing her.\n\nThe non-Chinese characters weren't as great. Damon was fine though I wasn't sure what kind of accent he was going for. Not saying it was bad, but I just didn't know what it was supposed to be. Maybe its my own ignorance. \n\nWillem Dafoe is completely wasted in the film. He's barely present in the film and nothing he does holds any baring on the plot. He just tries to steal the black powder and randomly gets captured and blown up off screen. \n\nPedro Pascal only fares a little better. He should have a bigger role and he makes every scene he's in better which makes it even worse when his character disappears in the 3rd act. I thought for sure he'd change his mind and join Damon in the final battle but instead you find out at the end of the movie he's been put in prison and then Damon bails him out. Should have had him in the final battle. Pascal saving Damon in the middle of the movie and helping him capture a monster was easily the best scene in the movie imo.\n\nBattle scenes are okay but they could have been a lot better. At times it felt like World War Z with giant lizards instead of a war/monster movie. The scene with Damon and Pascal fighting alone while trying to capture one monster was probably the best scene in the movie. Needed more boots on the ground combat scenes like that.\n\n6/10. Unless your a big fan of one of the actors involved then I'd wait till it hits Netflix.", "parent_id": "t3_5ujuqd", "score": 5, "displayText": "JeffDenlon", "name": "ddxhlxd", "sentiment": 1.0, "author": "JeffDenlon", "children": [{"body": "\"Looks like Hollywood knows how good she is since she is also in the new King Kong movie and Pacific Rim 2.\"\n\nDo you not notice that all three of the movies she's in are Legendary films? She's dating an executive. She was criticized in China for her acting in this.", "parent_id": "t1_ddxhlxd", "score": 7, "displayText": "brunchingermany", "name": "ddxjom6", "sentiment": 2.0, "author": "brunchingermany", "children": [{"body": "That's a lucky executive.", "parent_id": "t1_ddxjom6", "score": 2, "displayText": "JeffDenlon", "name": "ddxk97u", "sentiment": 3.0, "author": "JeffDenlon", "children": [{"body": "Eh, [not that lucky](http://www.celebzz.com/wp-content/uploads/2017/02/jing-tian-at-premiere-of-universal-pictures-the-great-wall-in-hollywood_1.jpg).", "parent_id": "t1_ddxk97u", "score": -4, "displayText": "brunchingermany", "name": "ddxkhgx", "sentiment": 1.0, "author": "brunchingermany", "children": []}]}, {"body": "Not saying you are wrong but studios like reusing talent all of the time.", "parent_id": "t1_ddxjom6", "score": 1, "displayText": "drmantiss", "name": "de0x2rd", "sentiment": 0.0, "author": "drmantiss", "children": [{"body": "Reusing the same actress who has neither the popularity or the talent for Hollywood movies? No one's heard of this chick in China.", "parent_id": "t1_de0x2rd", "score": 1, "displayText": "brunchingermany", "name": "de0xzva", "sentiment": 0.0, "author": "brunchingermany", "children": [{"body": "Okay, still just a gossipy claim.", "parent_id": "t1_de0xzva", "score": 1, "displayText": "drmantiss", "name": "de105ue", "sentiment": 2.0, "author": "drmantiss", "children": []}, {"body": "yea I was surprised too. She was not that famous in China as an actress anyway - at least not many break out roles. How did she get so many foreign film deals haha. \n\nI can count with my fingers a dozen Chinese actresses who are talented and can take on the role. How disappointing. \n\nZhang Ziyi had so much character as an international star. What a heartbreakingly good actress. Bummer. I was hoping the US gets to see beautiful talented Chinese actresses. ", "parent_id": "t1_de0xzva", "score": 1, "displayText": "cagedcat", "name": "de23l9f", "sentiment": 1.0, "author": "cagedcat", "children": []}]}]}]}, {"body": "Jing tian is notorious for her bad acting and only gets into films because of nepotism. Sorry to call out your Asian fetish", "parent_id": "t1_ddxhlxd", "score": 2, "displayText": "harsheehorshee", "name": "ddz19sj", "sentiment": 0.0, "author": "harsheehorshee", "children": []}]}, {"body": "What do the guys in yellow and purple do?\n\nRed are archers, blue are females bungee jumping with spears, black are foot soldiers.\n\nWasnt there another color too? ", "parent_id": "t3_5ujuqd", "score": 4, "displayText": "murkycoffee", "name": "de5yda9", "sentiment": 1.0, "author": "murkycoffee", "children": []}, {"body": "6/10\n\nRight well first off, I was going into this with quite low expectations. I thought it would more than likely be a bit of a dumb popcorn action/fantasy movie and that's pretty much what it is. Does what it says on the tin! And I think having low expectations allowed me to enjoy this one for what it was.\n\nThe visuals in this film are absolutely gorgeous. The use of colour and the cinematography was a treat. If you've seen the director's previous work (Hero, House of Flying Daggers etc) then you know that is to be expected. Some of the shots in this movie were breathtaking! I watched in 2D but I bet it looks even better in IMAX.\n\nThe film is the most expensive Chinese film ever made and it shows through the production design and scale. The sets were stunning and you could tell a lot of practical effects went into this film which I'm a big fan of.\n\nThe world building was great. The weapons, fighting styles, character designs, costumes, gadgets were all very original and it all came together quite nicely.\n\nThe action was absurdly fun too. Very entertaining and they handled the big battle sequences well. Some interesting choreography and camera work. Probably the best thing about the film.\n\n\nWhere this film fails (and why it will get a LOT of bad reviews) is the writing, plot and character development. Because there is pretty much none in either case. This is what lets it down massively. I genuinely had a fun time watching it though.\n\n\nThe dialogue is cheesy as hell, the plot is as basic as they come and the characters were all very one dimensional and bland. I'd say Damon's character was one of the most bland roles he's ever played. There was literally no character development whatsoever and it was lacking heart.\n\n\nI think with a film such as this where they have to cater to both the Asian and Western markets it's easy to play it safe. And that's what they've done here. It will probably make a shit ton of money which is great for the Chinese film industry as a whole though.\n\nAlso a lot of people seem to be hating on this film (even before they've seen it) because it has a white male lead character. First of, he's not portrayed as some white saviour type. Secondly, the part wouldn't work if it wasn't a westerner (which is why the part was written that way) And thirdly, having Matt Damon in it will make people go see it. Which equals more money. It's not rocket science.\n\nFew other points:\nMatt Damon's accent - what the hell is even going on there? Like seriously. Fucking awful. \nWillem Dafoe - not really much point to his character at all and his motivations were non existent\nCGI - Could have been better\nAll in all, I'd say it's worth a watch if you want a film that's just gonna entertain you for a couple hours and not do much beyond that. Go in with low expectations and you will probably enjoy it.", "parent_id": "t3_5ujuqd", "score": 7, "displayText": "kastroescobar", "name": "ddzxran", "sentiment": 1.0, "author": "kastroescobar", "children": []}, {"body": "Ok, not awful, in fact, whilst hardly a cinematic great, its an enjoyable action film worth a watch.\n\n\nHowever, for fucks sake can we please ditch the cliches. The 'it misses the first two times' crap, the 'they all stop after the queen dies' shit, and the 'no one wins a battle without deus ex machina' bullshit.\n\nCan we please have a film where a battle is actually hard fought and won....no eagles, alien queen death, mothership destruction, or equivalent plot device required?\n\nAlso, no other magnets in china? None?\nAnd wasn't it handy the wind was blowing in the right direction for those balloons....\n\n\nI think they watched a few too many western action movies when writing this, they got all the damn cliches just right.....\n\n\nWhite actor thing? Dont care, plot, such as it is, would not make sense without western actor in that role, those bitching obviously have not actually seen movie.\n\nI think they should have not gone quite so western in movie style, there are elements of the film that are really good and original,  but the characters are a bit boring, the lines cheesy, and the reliance on western tropes and cliche just disappointing.", "parent_id": "t3_5ujuqd", "score": 7, "displayText": "Annoyed_Badger", "name": "de06b8v", "sentiment": 2.0, "author": "Annoyed_Badger", "children": [{"body": "Yup I thinking the same thing about the magnet. Why didn't they go hunting for more magnets?? The movie could have ended with an epic battle of the good guys dressed in magnet armor.", "parent_id": "t1_de06b8v", "score": 3, "displayText": "BlueSky502", "name": "de0fdyk", "sentiment": 1.0, "author": "BlueSky502", "children": []}, {"body": "Screenplay by \t\n\n    Carlo Bernard\n    Doug Miro\n    Tony Gilroy\n\nStory by \t\n\n    Max Brooks\n    Edward Zwick\n    Marshall Herskovitz\n\nOh and also since I saw quite a few comments of people comparing it to World War Z\n\n    The film originally came from Legendary CEO Thomas Tull, who conceived the idea with \n    World War Z writer Max Brooks.", "parent_id": "t1_de06b8v", "score": 2, "displayText": "leeyuuh", "name": "de0gy9n", "sentiment": 2.0, "author": "leeyuuh", "children": []}, {"body": "American writers fyi, did World War Z and Michael Clayton", "parent_id": "t1_de06b8v", "score": 1, "displayText": "heykarlll", "name": "de0dfrs", "sentiment": 4.0, "author": "heykarlll", "children": [{"body": "Regardless, does not mean they could not have altered style for the material.", "parent_id": "t1_de0dfrs", "score": 1, "displayText": "Annoyed_Badger", "name": "de0mj2h", "sentiment": 1.0, "author": "Annoyed_Badger", "children": [{"body": "The movie was already in production before the acquisition by the Chinese company though, which only occurred in early 2016. Kinda late.", "parent_id": "t1_de0mj2h", "score": 1, "displayText": "leeyuuh", "name": "de11p2n", "sentiment": 2.0, "author": "leeyuuh", "children": [{"body": "so?\n\nI'm not sure of your point. dealing with the themes it does and its setting, I would have prefered a less western approach regardless of the writers or company owning the rights. No reason you cant adopt different styles, regardless of who you are.", "parent_id": "t1_de11p2n", "score": 1, "displayText": "Annoyed_Badger", "name": "de14h9b", "sentiment": 1.0, "author": "Annoyed_Badger", "children": []}]}]}]}]}, {"body": "Oh come on guy, this movie was a blast. The action was great and there were so many genuinely clever things. The whistle arrows! The wrist matches! Yes, some of the story wasn't very good at all, but man those battle sequences were fun as hell. \n\nI've become obsessed with the way the Wall works. Do each of the other \"factions\" get a id like the Crane Corps? Were the Black Foot Soldiers called the Death Squadron? What's the id of the Red Archers? Were the Purple Soldier just like the Commander's Bodyguards? What was the role of the Yellow Soldiers? Engineer/Artillery? There was a lot of cool world building going on and I loved it all.", "parent_id": "t3_5ujuqd", "score": 11, "displayText": "HanzoSteel", "name": "ddw2a1n", "sentiment": 4.0, "author": "HanzoSteel", "children": [{"body": "[deleted]", "parent_id": "t1_ddw2a1n", "score": -6, "displayText": "None", "name": "ddw35sx", "sentiment": -1.0, "author": "None", "children": [{"body": "there are plenty of asian films with no white people, I don't see your point...", "parent_id": "t1_ddw35sx", "score": 1, "displayText": "nonsensefree", "name": "ddw3zvt", "sentiment": 0.0, "author": "nonsensefree", "children": []}]}]}, {"body": "Well I bet Matt Damon probably regret participating in this film instead of Manchester by the Sea...\n\nEdit: I should say starring in Manchester by the Sea.", "parent_id": "t3_5ujuqd", "score": 9, "displayText": "AwesomeWilliam", "name": "ddup3yk", "sentiment": 0.0, "author": "AwesomeWilliam", "children": [{"body": "He got paid an absolute FUCKTON for this film so I highly doubt it mate.", "parent_id": "t1_ddup3yk", "score": 10, "displayText": "shaneo632", "name": "dduw12y", "sentiment": 4.0, "author": "shaneo632", "children": [{"body": "Do we know the exact amount he was paid. ", "parent_id": "t1_dduw12y", "score": 3, "displayText": "Im_Not_Daredevil", "name": "ddv9nm7", "sentiment": 0.0, "author": "Im_Not_Daredevil", "children": [{"body": "FUCKTON.", "parent_id": "t1_ddv9nm7", "score": 6, "displayText": "Dargomir", "name": "ddw3okd", "sentiment": 4.0, "author": "Dargomir", "children": [{"body": "Metric or imperial?", "parent_id": "t1_ddw3okd", "score": 1, "displayText": "LolTethTroll", "name": "ddz2hsg", "sentiment": 0.0, "author": "LolTethTroll", "children": []}]}, {"body": "20m usd perhaps", "parent_id": "t1_ddv9nm7", "score": 2, "displayText": "carrotsugar", "name": "ddxgqrp", "sentiment": 2.0, "author": "carrotsugar", "children": []}, {"body": "enough to water Africa", "parent_id": "t1_ddv9nm7", "score": 1, "displayText": "heykarlll", "name": "ddx0v26", "sentiment": 0.0, "author": "heykarlll", "children": []}]}]}, {"body": "Didn't he produce Manchester by the Sea?", "parent_id": "t1_ddup3yk", "score": 6, "displayText": "tterbman", "name": "dduqoxx", "sentiment": 1.0, "author": "tterbman", "children": [{"body": " Yes, but he originally was going to star in it", "parent_id": "t1_dduqoxx", "score": 4, "displayText": "kunkadunkadunk", "name": "ddutkud", "sentiment": 2.0, "author": "kunkadunkadunk", "children": []}]}, {"body": "He share an oscar nomination in Machester by the Sea though", "parent_id": "t1_ddup3yk", "score": 4, "displayText": "pedro_from_peru", "name": "ddur27n", "sentiment": 4.0, "author": "pedro_from_peru", "children": []}, {"body": "i was wondering what matt  damon was doing in this film, but then i remembered he did Brothers Grimm too. Suppose it could just be money, but maybe sometimes he just likes to have a less serious movie to do.", "parent_id": "t1_ddup3yk", "score": 2, "displayText": "BelovedApple", "name": "ddx6v1a", "sentiment": 0.0, "author": "BelovedApple", "children": []}, {"body": "I'm sure his bank account doesn't regret it", "parent_id": "t1_ddup3yk", "score": 1, "displayText": "JeffDenlon", "name": "ddxjjdu", "sentiment": 1.0, "author": "JeffDenlon", "children": []}]}, {"body": "It was a steaming pile of it, and I can't believe I'm seeing so many positive comments about the use of color. It was a kitbash of heavyhanded symbolism and disjointed in its emphasis -- or lack thereof. The internal logic wasn't even consistent, with significant plot elements being treated as both a surprise and somehow common knowledge from *centuries* prior to the film.\n\nThere's a dozen other issues big and small, ranging from wooden characterization to muddled character drivers.\n\nAnd *then* we get into the fact it's a goddamn white savior plot, rendering an entire *empire* useless and incompetent, incapable of learning from its own histories or developing its own warriors, all for the sake of one man's character development.", "parent_id": "t3_5ujuqd", "score": 12, "displayText": "obscurica", "name": "ddxetuw", "sentiment": 0.0, "author": "obscurica", "children": []}, {"body": "The only things that I loved about that movie were the cinematography, costume & production design and CGI effects. Apart from that, I didn't enjoy this movie. I felt the plot was so predictable.\nAnd Matt Damon's accent is weird", "parent_id": "t3_5ujuqd", "score": 3, "displayText": "MrWhite96", "name": "dduyb63", "sentiment": 1.0, "author": "MrWhite96", "children": [{"body": "Yes! That accent made no sense to me... It's just like he was trying to get rid of his boston accent and didn't know what to do", "parent_id": "t1_dduyb63", "score": 4, "displayText": "swervingmoss", "name": "ddv67gb", "sentiment": 0.0, "author": "swervingmoss", "children": []}]}, {"body": "Zhang yi mou has made some really heart wrenching dramas and intense look at societal structures and poverty in the 90's. But this. .....this feels so mundane and derivative. ", "parent_id": "t3_5ujuqd", "score": 3, "displayText": "lockezwill", "name": "dduz3v9", "sentiment": 1.0, "author": "lockezwill", "children": [{"body": "Dude's like a Chinese Francis Ford Coppola or something. ", "parent_id": "t1_dduz3v9", "score": 5, "displayText": "Delta_Assault", "name": "ddvt44v", "sentiment": 4.0, "author": "Delta_Assault", "children": [{"body": "Has he put his daughter who can't act into a major role that she's not ready for?", "parent_id": "t1_ddvt44v", "score": 1, "displayText": "JC-Ice", "name": "ddvts0g", "sentiment": 1.0, "author": "JC-Ice", "children": [{"body": "Please tell me Keanu's not in this trying to speak with a Chinese accent!", "parent_id": "t1_ddvts0g", "score": 1, "displayText": "MatttheBruinsfan", "name": "ddx4ybz", "sentiment": 0.0, "author": "MatttheBruinsfan", "children": []}]}]}, {"body": "cash is cash right?", "parent_id": "t1_dduz3v9", "score": 2, "displayText": "princessfinn", "name": "ddv2r3q", "sentiment": 0.0, "author": "princessfinn", "children": [{"body": "True, I don't blame the man for going commercial but at least put some heart into it like Hero.", "parent_id": "t1_ddv2r3q", "score": 3, "displayText": "lockezwill", "name": "ddvb3q9", "sentiment": 2.0, "author": "lockezwill", "children": []}]}]}, {"body": "Is that thumbnail from Willow?", "parent_id": "t3_5ujuqd", "score": 3, "displayText": "RefreshNinja", "name": "ddv2z48", "sentiment": 1.0, "author": "RefreshNinja", "children": [{"body": "Mattmartigan", "parent_id": "t1_ddv2z48", "score": 3, "displayText": "MulciberTenebras", "name": "ddv4qr8", "sentiment": 2.0, "author": "MulciberTenebras", "children": [{"body": "> Mattmartigan\n\nMattmartian\n\nBut I really think the pic makes him look like the little dude from Willow.", "parent_id": "t1_ddv4qr8", "score": 2, "displayText": "RefreshNinja", "name": "ddv4wuf", "sentiment": 2.0, "author": "RefreshNinja", "children": [{"body": "Willow", "parent_id": "t1_ddv4wuf", "score": 2, "displayText": "sounds_like_kong", "name": "ddvegm3", "sentiment": 4.0, "author": "sounds_like_kong", "children": [{"body": "Yes, from the movie Willow.\n", "parent_id": "t1_ddvegm3", "score": 3, "displayText": "RefreshNinja", "name": "ddvggs3", "sentiment": 4.0, "author": "RefreshNinja", "children": []}]}]}, {"body": "The greatest swordsman who ever lived!  He wouldn't use a bow. ", "parent_id": "t1_ddv4qr8", "score": 2, "displayText": "JC-Ice", "name": "ddvtni9", "sentiment": 4.0, "author": "JC-Ice", "children": []}]}]}, {"body": "Did the CGI in the final cut still look as bad as the CGI shown in the trailer?", "parent_id": "t3_5ujuqd", "score": 3, "displayText": "rovinja", "name": "ddv7qiv", "sentiment": 0.0, "author": "rovinja", "children": [{"body": "Yeah pretty much", "parent_id": "t1_ddv7qiv", "score": 5, "displayText": "Pliknotjumbo", "name": "ddvak9c", "sentiment": 2.0, "author": "Pliknotjumbo", "children": []}]}, {"body": "Feel like they portrayed Matt Damon as some arrow shooting god, but then we just got like 3 scenes when he actually shows off his skill. ", "parent_id": "t3_5ujuqd", "score": 3, "displayText": "Patiiii", "name": "ddwjctd", "sentiment": 2.0, "author": "Patiiii", "children": [{"body": "The scene where he \"shows off\" just how good he is was really weak, lame even", "parent_id": "t1_ddwjctd", "score": 1, "displayText": "Retroself", "name": "ddwl45n", "sentiment": 0.0, "author": "Retroself", "children": []}]}, {"body": "I wish the movie was a bit longer (2 hours or so). While I do not want in-fighting between the commanders, I wish we got to know more about each one, even just a bit.\n\nI also wished there were more action scenes like the opening defense scene.", "parent_id": "t3_5ujuqd", "score": 3, "displayText": "Nyanderful_", "name": "ddwz88p", "sentiment": 2.0, "author": "Nyanderful_", "children": []}, {"body": "I enjoyed the film.  Pedro Pascal was great in this. His career looks to be on the rise. ", "parent_id": "t3_5ujuqd", "score": 3, "displayText": "hale093", "name": "ddxd2mr", "sentiment": 4.0, "author": "hale093", "children": [{"body": "He shouldnt have said yes  to a shitty script. I hope he learned his lesson", "parent_id": "t1_ddxd2mr", "score": 1, "displayText": "MG87", "name": "ddy8jvt", "sentiment": 0.0, "author": "MG87", "children": []}]}, {"body": "If this film didn't have absolutely stunning CGI and Tao Tei Siege Scenes, it would have been a complete bore, but the Special FX made up for that, so I'd say a solid 7/10.", "parent_id": "t3_5ujuqd", "score": 3, "displayText": "Echoblammo", "name": "ddxr6kx", "sentiment": 2.0, "author": "Echoblammo", "children": []}, {"body": "Question: I want to post a theory I has about the Tao Tei after seeing the film. Do I post it here or should I make a separate post on the main subreddit page?", "parent_id": "t3_5ujuqd", "score": 3, "displayText": "ShawBrosFan", "name": "ddyidn3", "sentiment": 0.0, "author": "ShawBrosFan", "children": [{"body": "A separate post probably wouldn't hurt.", "parent_id": "t1_ddyidn3", "score": 1, "displayText": "carolinemathildes", "name": "ddzd64t", "sentiment": 1.0, "author": "carolinemathildes", "children": []}]}, {"body": "If you go into this movie expecting an Oscar worthy story with great characters and the like, don't see it. If you go into this movie expecting a fun action movie with a cool premise, congrats you found a really really fun action movie with a really cool premise and a load of amazing effects and visuals.", "parent_id": "t3_5ujuqd", "score": 3, "displayText": "Scotb6", "name": "de1czz3", "sentiment": 3.0, "author": "Scotb6", "children": [{"body": "Yeah I pretty much got what I expected from this movie. It was pretty and entertaining and fun. That's all it had to be. Not everything has to be some kind of political statement.", "parent_id": "t1_de1czz3", "score": 2, "displayText": "moonlightonneptune", "name": "de24u8g", "sentiment": 3.0, "author": "moonlightonneptune", "children": []}, {"body": "I mean that goes without saying; I'm positive no one went into this movie expecting an Oscar worthy story.", "parent_id": "t1_de1czz3", "score": 1, "displayText": "FreshTunaSushi", "name": "de1hgcz", "sentiment": 2.0, "author": "FreshTunaSushi", "children": [{"body": "Reading some of the comments in this thread, you'd think they did.", "parent_id": "t1_de1hgcz", "score": 5, "displayText": "Scotb6", "name": "de1hx8w", "sentiment": 0.0, "author": "Scotb6", "children": []}]}]}, {"body": "Matt Damon stars as: Token White Guy.\n\nIn short I liked the movie. The one thing that I found out after leaving the theater was just how little Damon´ s character really did.\n\n[He only kills one of the Tao Tei because he had the magnet with him, whose properties were discovered by strategist Mao, who also studied the Queen AND came up with the plan to feed the walking bomb to her. ] (#spoiler)\n\nHe is a great archer, the movie makes all that clear, but I don´t think  it can be agreed he is there to be a white savior.", "parent_id": "t3_5ujuqd", "score": 10, "displayText": "_Violetear", "name": "ddvw1yu", "sentiment": 3.0, "author": "_Violetear", "children": [{"body": "From what I've heard, it's actually a Chinese Superiority Propaganda movie disguised as a White Saviour movie to bring in a Western audience. ", "parent_id": "t1_ddvw1yu", "score": 16, "displayText": "StruckingFuggle", "name": "ddvx9ry", "sentiment": 1.0, "author": "StruckingFuggle", "children": [{"body": "And where exactly did you hear that?\n", "parent_id": "t1_ddvx9ry", "score": 5, "displayText": "NewToCool", "name": "ddwxe4v", "sentiment": 0.0, "author": "NewToCool", "children": [{"body": "Some film critic on Twitter, I don't remember which one exactly. Moviebob?", "parent_id": "t1_ddwxe4v", "score": 0, "displayText": "StruckingFuggle", "name": "ddx12jv", "sentiment": 1.0, "author": "StruckingFuggle", "children": []}]}, {"body": "how's it different from any american war movie?", "parent_id": "t1_ddvx9ry", "score": 5, "displayText": "heykarlll", "name": "ddwzu8r", "sentiment": 0.0, "author": "heykarlll", "children": []}, {"body": "It's not really. Damon doesn't learn to embrace communism or anything like that. He doesn't even stay in China at the end. \n\nThis same exact story (minus gunpowder) could have been made with Romans and foreign mercenaries at Hadrian's Wall.\n\nDragon Blade was a bit more propaganda-y with a scene suggesting that the Chinese soldiers somehow are more noble in their reasons for signing up than the Roman. ", "parent_id": "t1_ddvx9ry", "score": 3, "displayText": "JC-Ice", "name": "ddy942s", "sentiment": 2.0, "author": "JC-Ice", "children": []}, {"body": "That actually makes a lot more sense as to why the director said he wanted Damon for the role and not a chinese actor", "parent_id": "t1_ddvx9ry", "score": 5, "displayText": "_Violetear", "name": "ddvytu2", "sentiment": 2.0, "author": "_Violetear", "children": [{"body": "Yeah it's weird that he would want one of the most famous actors in the world for his movie. ", "parent_id": "t1_ddvytu2", "score": 15, "displayText": "bone-dry", "name": "ddw1lgi", "sentiment": 2.0, "author": "bone-dry", "children": []}]}]}, {"body": "[Plus jumping dowfrom the wall and grabbing one, coming up with the plan to capture it](#spoiler)", "parent_id": "t1_ddvw1yu", "score": 1, "displayText": "the1who_ringsthebell", "name": "ddw2iri", "sentiment": 2.0, "author": "the1who_ringsthebell", "children": []}, {"body": "[deleted]", "parent_id": "t1_ddvw1yu", "score": 0, "displayText": "None", "name": "ddw3bmg", "sentiment": -1.0, "author": "None", "children": [{"body": "About half of the producers, the director, and most of the actors are Chinese. The movie was marketed for china, and made more money in China. \n\nHe's acting for a movie marketed to an audience that is completely unlike what we have in the U.S. (assuming you are american). Well over half of the humans who will watch this come from a state whose population triples our own, and is nearly entirely homogeneous. \n\nThis is not \"whitewashing\". You haven't thought this through all the way. To say that Mat Damon is harming the representation of POC in movies because of this role is very silly. ", "parent_id": "t1_ddw3bmg", "score": 5, "displayText": "a_coppa", "name": "ddw3x3a", "sentiment": 0.0, "author": "a_coppa", "children": []}, {"body": "LOL", "parent_id": "t1_ddw3bmg", "score": 1, "displayText": "lesboautisticweeabo", "name": "ddw3qxz", "sentiment": 4.0, "author": "lesboautisticweeabo", "children": []}]}]}, {"body": "**The Good:**\n\n- Some really gorgeous cinematography and production designs.  The color coded ranger armors and various anachronistic contraptions are nice too look at.\n\n- Related to the above, there are some reasonably cool, well done action sequences to be seen.\n\n- Damon and Oberyn have a fun buddy chemistry.  I'd watch these two stumble into more movies.  Maybe they run afoul of Djinn in Arabia.  Or they stay at an inn back in England and it turns into a murder mystery/rom com.\n\n- Commander 'Mulan's Life Goal Achieved' is very pretty.\n\n- There's no cringe-inducing propaganda that I noticed.  Damon's character arc is a pretty standard selfish rogue-selfless hero to defend humanity, it's not about him embracing the Central Government, communism, forgiving the Emperor for genocide or anything like that. \n\n- Nice score and sound design. \n\n**The Bad:**\n\n- Some of the sequences have ambitions that outpace was the production can convincingly sell.\n\n- A lot of the CG looks a bit second rate.  But at least it's only second rate, not third.  And thankfully, most of the worst-looking shots are kept brief.\n\n- Matt Damon is doing some kind of accent...a little bit.  I think he might have been trying to sound Scottish, but I'm honestly not sure.  It's not as gloriously awful as Jessica Chastin's Groundskeeper Willie brogue from The Huntsman: Winter's War, instead it's very underplayed.\n\n- Kill the boss, the whole army dies.  Ugh!  We're still using this trope in 2017?  People were groaning aloud back in 2000 when it was used in The Phantom Menace, and when it showed up in Avengers in 2012, and however many lesser films as well.   It's lazy and annoying.  The moment the introduce the idea of the command queen you can guess how the war will be won.\n\n- Some of the action beats are just too goofy, like they could belong in an episode of Xena.\n\n- Willem Dafoe is under-used.\n\n- Plot hole involving the Tao-Tei's weakness, since it appears that a 900 year old battle report already explained it.  So why haven't they attempted to use it before?\n\n- The General of the Wall is under-used.\n\n**The Meh:**\n\n- Damon is rather bland in the scenes he doesn't share with Oberyn.\n\n- Creature design is hovers between interesting an uninspired. I think there should have been more variety among them.  Maybe a big armor tusked-version to smash into the wall, for instance.  I still thought the Tao-Tei resembled Outlander's Moorwen, so I chuckled a bit when it was revealed that they came from outer space.  I wonder if the \"meteor\" was actually a ship.\n\n- Commander 'No Way Her Boobs are Actually Big Enough to Fill Out that Armor' isn't terrible, but she isn't very captivating as an actress, either.\n\n- The plot is serviceable but by-the-numbers all the way.  SyFy has had lots of similar movies with people fighting dragons, zombies, aliens, or what-have you various time periods, there's probably a computer that spits out these scripts by now.  This just has more competent acting and and a real budget to go with it.          \n\n**The Missed Opportunities:**\n\n- Touch on what the Mongols know about the Tao-Tei.  Maybe they're the reason they developed a nomadic horse-based culture, so they can stay the hell away from them!\n\n- They could have had a general idd Tso cook one of the dead creatures and say \"it tastes like chicken\".\n\n- Show the monster hive!  We only the green-tinted mountain in the distance, neither character no camera over goes inside.\n\n- There's a scene where Damon is obviously supposed to kiss Commander 'Female Blue Ranger', or at least try to kiss her and she says they can't because of duty/custom/whatever.  But the scene just ends with them talking and there's no resolution at all.\n\n- It would have been nice to hear what the purple and gold corps were.  Black was foot soldiers, so purple was...other foot soldiers?  Gold was cavalry?  Were they different from the engineer guys who were mostly shirtless but seemed to have gold on too?\n\n- Somebody should have explained what Tao-Tei means.", "parent_id": "t3_5ujuqd", "score": 7, "displayText": "JC-Ice", "name": "ddutqjj", "sentiment": -1.0, "author": "JC-Ice", "children": [{"body": "Tao-Tei is from old chinese legends. They are just monsters like depicted in the movie. Anyways, good review and love the 'missued opportunities'", "parent_id": "t1_ddutqjj", "score": 2, "displayText": "sickboi19", "name": "dduzdpl", "sentiment": 4.0, "author": "sickboi19", "children": []}, {"body": "> The plot is serviceable but by-the-numbers all the way. SyFy has had lots of similar movies with people fighting dragons, zombies, aliens, or what-have you various time periods, there's probably a computer that spits out these scripts by now. This just has more competent acting and and a real budget to go with it.\n\n\"Or vampires, whatever fuck you\"", "parent_id": "t1_ddutqjj", "score": 3, "displayText": "MG87", "name": "ddy8rwt", "sentiment": 1.0, "author": "MG87", "children": []}, {"body": "> There's a scene where Damon is obviously supposed to kiss Commander 'Female Blue Ranger', or at least try to kiss her and she says they can't because of duty/custom/whatever. But the scene just ends with them talking and there's no resolution at all.\n\nI noticed this too, it felt like they were going to kissed, but it was just cut short or something where I was watching it. Did she actually have a line about it being about duty or custom? Cause for my screening they just looked at each other and went on their ways. Either I missed the line, or a scene has been cut lol. Would be interesting to know. As far as I know, I didn't read anything about the Chinese released version being any different from the US release version. \n\nEnjoyed reading your missed opportunities x)", "parent_id": "t1_ddutqjj", "score": 2, "displayText": "Firefox711", "name": "ddvu5pc", "sentiment": 2.0, "author": "Firefox711", "children": [{"body": "> Did she actually have a line about it being about duty or custom? \n\nNope. It felt like there should have at least been something like that. Instead, as you noticed, the scene just ends abruptly, it feels like it's missing an ending. ", "parent_id": "t1_ddvu5pc", "score": 1, "displayText": "JC-Ice", "name": "ddvue1f", "sentiment": 1.0, "author": "JC-Ice", "children": []}]}, {"body": "> Somebody should have explained what Tao-Tei means.\n\n[Taotie](https://en.wikipedia.org/wiki/Taotie) are a motif found on ancient Chinese bronze, they can be interpreted as a glaring fanged face or two fanged animals facing off. \n\nIt's not clear what they stood for at time of creation but later dynasties idd them 'taotie'\n", "parent_id": "t1_ddutqjj", "score": 2, "displayText": "AndyLC", "name": "ddwbeb6", "sentiment": 1.0, "author": "AndyLC", "children": []}, {"body": "> It would have been nice to hear what the purple and gold corps were. Black was foot soldiers, so purple was...other foot soldiers? Gold was cavalry? Were they different from the engineer guys who were mostly shirtless but seemed to have gold on too?\n\nI think it was:\n\nBlue were the Crane Troops, that really seemed pointless since they had those blades in the walls.\n\nRed were Archers\n\nGold were Engineers\n\nBlack were Garrison Infantry\n\nPurple were Mobile Infantry/Cavalry.\n\nThere seemed to be a lot of overlap as every group except the Archers took part in close quarters combat.", "parent_id": "t1_ddutqjj", "score": 2, "displayText": "Tricky4279", "name": "de1xik1", "sentiment": 1.0, "author": "Tricky4279", "children": []}]}, {"body": "Saw this last night and had a need to tell someone that this was one of the worst movies I've ever seen. \n\nAnd I'm a huge fan of both Hero and House of the flying daggers. This was like a terrible version of both films. \n\nDamons accent was beyond distracting and the dialogue was cringeworthy. \n\nI wish I was more articulate but if I can help one person save money with this comment  it did its job I guess. ", "parent_id": "t3_5ujuqd", "score": 6, "displayText": "Sfnyc46", "name": "ddxqp7j", "sentiment": 0.0, "author": "Sfnyc46", "children": [{"body": "Also the story was a hollywood cliche, basically I already knew the whole story halfway through. It became so boring to me, fell asleep at the end.", "parent_id": "t1_ddxqp7j", "score": 1, "displayText": "Velgax", "name": "ddxr6po", "sentiment": 0.0, "author": "Velgax", "children": [{"body": "Haha. I almost fell asleep also. ", "parent_id": "t1_ddxr6po", "score": 1, "displayText": "Sfnyc46", "name": "ddxrsme", "sentiment": 0.0, "author": "Sfnyc46", "children": []}]}, {"body": "Sleepless in Seattle\n", "parent_id": "t1_ddxqp7j", "score": 1, "displayText": "RifleGun2", "name": "ddy86lh", "sentiment": 4.0, "author": "RifleGun2", "children": []}]}, {"body": "Someone who enjoyed this film, please make an argument as to why I should bother with this. It looks worse than The Mummy Dragon Emperor garbage from a few years ago. Also, what kind of blackmail did the producers have on Damon to get him in this? He definitely murdered babies or something", "parent_id": "t3_5ujuqd", "score": 6, "displayText": "Severus_Amadeus", "name": "de1naza", "sentiment": 0.0, "author": "Severus_Amadeus", "children": [{"body": "Bro, just an FYI.  That Mummy Dragon Emperor garbage was in 2008, almost 9 years ago.  Time flies yo.", "parent_id": "t1_de1naza", "score": 9, "displayText": "thoshi64", "name": "de49sra", "sentiment": 0.0, "author": "thoshi64", "children": [{"body": "Holy shit I'm getting old! Wonder what BFras is up to these days", "parent_id": "t1_de49sra", "score": 3, "displayText": "Severus_Amadeus", "name": "de4aa5u", "sentiment": 4.0, "author": "Severus_Amadeus", "children": [{"body": "/r/SAVEBRENDAN ", "parent_id": "t1_de4aa5u", "score": 9, "displayText": "MJM247", "name": "de4avf7", "sentiment": 3.0, "author": "MJM247", "children": [{"body": "LOL...the interwebs never fails to astonish. Well played, well played (golf clap).", "parent_id": "t1_de4avf7", "score": 2, "displayText": "Severus_Amadeus", "name": "de4cwia", "sentiment": 2.0, "author": "Severus_Amadeus", "children": []}]}]}]}, {"body": "It's a chinese funded film isn't it? So the answer is a literal boatload of money.", "parent_id": "t1_de1naza", "score": 6, "displayText": "MrBigShot94", "name": "de1qifh", "sentiment": 0.0, "author": "MrBigShot94", "children": [{"body": "Imagine having so much $ you're like I'm gonna buy Matt Damon", "parent_id": "t1_de1qifh", "score": 7, "displayText": "Severus_Amadeus", "name": "de1w7oz", "sentiment": 0.0, "author": "Severus_Amadeus", "children": []}]}, {"body": "It was decent on weed.", "parent_id": "t1_de1naza", "score": 4, "displayText": "F_a_W", "name": "de48nkq", "sentiment": 2.0, "author": "F_a_W", "children": []}, {"body": "Saw it last night in Imax. I actually really liked it, as a movie I thought it was around 6.5 or 7/10, but enjoyment wise I'd give it an 8.\n\nThe CGI was well done, the concept was fun with a bunch of different weaponry. The acting really isn't as bad as everyone makes it out to be, and the chemistry between Matt Damon and Obyren was surprisingly good. \n\nMore than anything though, was the few moments where this movie had some pretty cool fights.", "parent_id": "t1_de1naza", "score": 9, "displayText": "splader", "name": "de2ogmh", "sentiment": 2.0, "author": "splader", "children": []}, {"body": "Matt Damon is just Matt Damon, but his chemistry with Obryen is actually kinda funny, but ultimately the movie is painfully generic and that's about all I can say about it.\n\nIt's pretty to look at at times, seeing the way the chinese army functions is absolutely gorgeous, but ultimately every single bit of action and dialogue is completely predictable and it's just not an exciting movie.\n\nThat said, I'd still see it if you could get in without paying full theater price.", "parent_id": "t1_de1naza", "score": 4, "displayText": "ThaliaofThraben", "name": "de3ddos", "sentiment": 2.0, "author": "ThaliaofThraben", "children": [{"body": "Haha Damon is Damon...He really does just play one guy! I feel sad that Pedro (Oberyn) is in this, but an actor's gotta eat. This sounds like a solid movie to get baked to & just enjoy for what it is", "parent_id": "t1_de3ddos", "score": 3, "displayText": "Severus_Amadeus", "name": "de3mayj", "sentiment": 3.0, "author": "Severus_Amadeus", "children": [{"body": "That's an excellent way to view it and I 100% agree.", "parent_id": "t1_de3mayj", "score": 4, "displayText": "ThaliaofThraben", "name": "de3o01x", "sentiment": 4.0, "author": "ThaliaofThraben", "children": []}]}]}, {"body": "I actually just saw it tonight and both my wife and I really liked it.  The visuals and soundtrack were really good.  My one gripe with it is that since of the cgi was a bit to obvious.  It was a fun movie which want really trying to take itself you seriously.", "parent_id": "t1_de1naza", "score": 4, "displayText": "Ryland42", "name": "de1y6am", "sentiment": 3.0, "author": "Ryland42", "children": [{"body": "that was the only thing that I took away from the trailers: this is going to be a pretty movie to watch.\n\nI don't think I'll pay theater prices for it, but it looks pretty.", "parent_id": "t1_de1y6am", "score": 1, "displayText": "runasaur", "name": "de38ygw", "sentiment": 2.0, "author": "runasaur", "children": [{"body": "Oh it was definitely good looking for a movie and it was definitely worth the $5 I spent to see it.", "parent_id": "t1_de38ygw", "score": 1, "displayText": "Ryland42", "name": "de39odn", "sentiment": 2.0, "author": "Ryland42", "children": []}]}]}, {"body": "Do you like mindless action movies with a little plot then you will like it.  \nIt does not take it self to serious but focus more on action to drive the movie.\n\nMatt Damon is the person who experience the situation but its not a white hero saves the day.", "parent_id": "t1_de1naza", "score": 1, "displayText": "Engletroll", "name": "de59ulb", "sentiment": 1.0, "author": "Engletroll", "children": [{"body": "Some of my favorite movies growing up were Anaconda, Starship Troopers, Waterworld, & Revenge of the Nerds (still can't believe I saw this in 1st grade lol) so despite my friends saying I'm a movie snob, I love a good mindless movie! \n\n\nI really like that Damon is just there & isn't the hero like Cruise in The Last Samurai (my big issue with that movie)", "parent_id": "t1_de59ulb", "score": 2, "displayText": "Severus_Amadeus", "name": "de657np", "sentiment": 4.0, "author": "Severus_Amadeus", "children": []}]}]}, {"body": "Honestly, Lu Han is the only incentive to watch this movie", "parent_id": "t3_5ujuqd", "score": 7, "displayText": "ArcticFoxxKA", "name": "ddzm3y8", "sentiment": 0.0, "author": "ArcticFoxxKA", "children": [{"body": "As seen on Shark Tank", "parent_id": "t1_ddzm3y8", "score": 2, "displayText": "RifleGun2", "name": "de0nzcy", "sentiment": 2.0, "author": "RifleGun2", "children": []}, {"body": "That's the only reason I watched this movie haha. I honestly enjoyed it more than I thought I would. As other users have said, don't expect a lot and you won't be disappointed. The plot and lines are weak but everything else still made it an enjoyable movie to watch.", "parent_id": "t1_ddzm3y8", "score": 1, "displayText": "AlphaBaby", "name": "ddzybpx", "sentiment": 2.0, "author": "AlphaBaby", "children": []}]}, {"body": "What was up with the General tagging along to investigate the disappearance of two guards? This shit ain't Dynasty Warriors, keep the hell back!\n", "parent_id": "t3_5ujuqd", "score": 2, "displayText": "getsbauer", "name": "ddutyav", "sentiment": 0.0, "author": "getsbauer", "children": []}, {"body": "Is it as visually impressive as Yimou's Hero,  House of Flying Daggers and Curse of the Golden Flower? ", "parent_id": "t3_5ujuqd", "score": 2, "displayText": "Dreossk", "name": "dduy770", "sentiment": 4.0, "author": "Dreossk", "children": [{"body": "Visually, yes. But acting not as good.", "parent_id": "t1_dduy770", "score": 3, "displayText": "DragonFireDon", "name": "ddv861v", "sentiment": 2.0, "author": "DragonFireDon", "children": []}]}, {"body": "I thought this movie was entertaining. The visuals were great and I loved the colors of the army. Reminded me of how elves tend to be portrayed as nimble warriors in sci-fi.", "parent_id": "t3_5ujuqd", "score": 2, "displayText": "huracans", "name": "ddw4dhw", "sentiment": 4.0, "author": "huracans", "children": []}, {"body": "Was it just my theater or was there no subtitles for the Mandarin so I had no idea what was happening half of the movie.", "parent_id": "t3_5ujuqd", "score": 2, "displayText": "89balognablaster", "name": "ddyr3ll", "sentiment": 1.0, "author": "89balognablaster", "children": [{"body": "The thing that is odd about that is that in an English language film with a foreign language used situationally, the subtitles should be a part of the actual print during those segments. They shouldn't have to be turned on separately or anything of that nature.  ", "parent_id": "t1_ddyr3ll", "score": 3, "displayText": "Fiveblade", "name": "ddz5zhy", "sentiment": 1.0, "author": "Fiveblade", "children": [{"body": "What about subtitles for other countries?", "parent_id": "t1_ddz5zhy", "score": 2, "displayText": "Bendaario", "name": "ddzh29t", "sentiment": 0.0, "author": "Bendaario", "children": [{"body": "Generally they're in different places on the screen so they don't overlap (the ones that are \"in\" the film as part of the film vs. the subtitle options which are turned on as an overlay). ", "parent_id": "t1_ddzh29t", "score": 1, "displayText": "Fiveblade", "name": "ddzip23", "sentiment": 2.0, "author": "Fiveblade", "children": []}]}]}, {"body": "Mine had subs, pretty strange that yours didn't", "parent_id": "t1_ddyr3ll", "score": 2, "displayText": "ItzDante", "name": "ddz25hy", "sentiment": 1.0, "author": "ItzDante", "children": []}]}, {"body": "I thought thered be dragons, a sex scene betwee  Damon and the Asian chick, and more skilled swordfighting scenes with the Red Viper ", "parent_id": "t3_5ujuqd", "score": 2, "displayText": "murkycoffee", "name": "de5y3fk", "sentiment": 3.0, "author": "murkycoffee", "children": []}, {"body": "I don't get the hate for this movie. Yeah the plot and acting weren't very good. But the effects and visuals (especially in 3D) were insanely cool. I went in expecting a special effect extraganza blockbuster that would make me go, \"That's awesome!\" and that's exactly what I got.", "parent_id": "t3_5ujuqd", "score": 7, "displayText": "SirCakez", "name": "ddyr2pq", "sentiment": 3.0, "author": "SirCakez", "children": [{"body": "> the plot and acting weren't very good.\n\nThat explains the hate for the movie.", "parent_id": "t1_ddyr2pq", "score": 16, "displayText": "HoldenFinn", "name": "ddyr4sf", "sentiment": 2.0, "author": "HoldenFinn", "children": [{"body": "It definitely wasn't a very good movie. What I'm confused about is people below calling this the worst movie they've ever seen and a huge waste of time and etc when it did at the least have good visuals and effects that if nothing else, kept me entertained for the run time.", "parent_id": "t1_ddyr4sf", "score": 2, "displayText": "SirCakez", "name": "ddz7ino", "sentiment": 0.0, "author": "SirCakez", "children": []}, {"body": "Who wants/expects good plot and acting when they're seeing a special effects extravaganza, though? As long as I'm visually tantalized in this type of movie, it's a win. ", "parent_id": "t1_ddyr4sf", "score": 2, "displayText": "Fiveblade", "name": "ddzbq5z", "sentiment": 2.0, "author": "Fiveblade", "children": [{"body": "Pedro Pascal, Andy Lau, Willem DeFoe, and Matt Damon are all exceptional actors. Just because this is a stunt piece doesn't mean that the acting has to be shit.", "parent_id": "t1_ddzbq5z", "score": 2, "displayText": "drmantiss", "name": "de0x07l", "sentiment": 1.0, "author": "drmantiss", "children": [{"body": "The acting wasn't really that bad, it was the writing that was terrible. I found the chemistry between Damon and Pascal to be surprisingly good.", "parent_id": "t1_de0x07l", "score": 1, "displayText": "splader", "name": "de2opwu", "sentiment": 1.0, "author": "splader", "children": []}]}]}]}, {"body": "if you seen other awkward dialogues from english-chinese movies (anything by jackie chan recently, dragon blade, skiptrace), TGW is way better, not a lot of that kind of awkwardness", "parent_id": "t1_ddyr2pq", "score": 1, "displayText": "skybala", "name": "de16peh", "sentiment": 1.0, "author": "skybala", "children": []}, {"body": "how much they paying you boi", "parent_id": "t1_ddyr2pq", "score": -1, "displayText": "theoncomingnoob", "name": "ddz33dg", "sentiment": 4.0, "author": "theoncomingnoob", "children": []}]}, {"body": "It was a great time. I went in based solely on how Damon said the line \"we're here to trade\" - his accent was so weird. But cool. SO I got what I wanted out of this film, the action elements were great, Jing Tian was absolutely gorgeous. My buddy made a quip about Dafoe being the Green Goblin, I power laughed as he made away with the black powder. I liked the buddy-cop aspect of Damon and Pedro. It was fun. Fun times indeed.", "parent_id": "t3_5ujuqd", "score": 3, "displayText": "Jay_Eye_MBOTH_WHY", "name": "dduvly9", "sentiment": 3.0, "author": "Jay_Eye_MBOTH_WHY", "children": []}, {"body": "I had a ton of fun with this. I feel like the RT score is way too low.\n\nYes, the plot's really simple but the cheesy one-liners and plentiful action left me satisfied.\n\nI also liked how it didn't drag on and was barely 90 minutes long. Straight to the point, no fucking around.\n\nAnd the Chinese actress spoke surprisingly good English which was nice.\n\nPedro Pascal GOAT.", "parent_id": "t3_5ujuqd", "score": 2, "displayText": "shaneo632", "name": "dduvzet", "sentiment": 2.0, "author": "shaneo632", "children": [{"body": "Because critics generally highly value acting and plot over just visual and action.\n\nNot as good acting/plot will get the movie a low-score.", "parent_id": "t1_dduvzet", "score": 1, "displayText": "DragonFireDon", "name": "ddv8a5j", "sentiment": 2.0, "author": "DragonFireDon", "children": []}]}, {"body": "I went into this movie with low expectations and it managed to be even worse.  Even by disaster/monster movie standards, it is a total mess.  The plot is filled with holes and inconsistencies and there are so many slow-mo RIDICULOUS shots in the action scenes that it was embarrasing.  Matt Damon (How the fuck did he get roped into this?) tries a terrible Irish (?) accent in the first third of the movie.  Jing Tian is nice to look at but relatively wooden, though she can certainly cry on cue.  Willem Dafoe is just here for his check.  Pedro Pascal and Damon have a nice chemistry that made me chuckle a couple of times.\n\nThe directing is terrible, especially in an early battle when they encounter the monster for the first time.  I get that they don't want to show the monsters yet but the editing is a confusing mix of cuts and quick edits that are totally disorienting.  The way they fight the monsters is equal parts believable medieval warfare and \"shit that looks cool even though it makes no sense\" like the pole divers and the \"close combat\" soldiers in their shield phalanx who I never saw do anything except get owned.  Oh, and Matt Damon apparently went to Robin Hood school and is a world-class trick archer despite being some fucking mercenary bum from Europe. \n\nGod this movie sucked. ", "parent_id": "t3_5ujuqd", "score": 3, "displayText": "MyOtherLoginIsATiger", "name": "de1f251", "sentiment": 0.0, "author": "MyOtherLoginIsATiger", "children": [{"body": "So a mercenary that lives by his weapons skills can not be extremely good with a weapon?  You do know many warriors threw history was known for their skill with the bow. \n\nAlso he even explain to the audience why he has a mixed accent, he is an Irishman who has been travelling  and fighting his whole life, his brother of arms is Spanish or Portuguese, and those where not common in Ireland.  Jing Tian played a typical Chinese officer, yes they are wooden in behavior. They are not westerners sorry but all of them where wooden except when they where just with other Chinese and in a more relaxed environment.  Go to china and you will see that behavior for yourself.   I experience a lot here. As for the plot its a action flick that does not take itself serious. I have a feeling you went in trying to confirm that it was bad and not to just watch the movie.", "parent_id": "t1_de1f251", "score": 1, "displayText": "Engletroll", "name": "de5acgx", "sentiment": 1.0, "author": "Engletroll", "children": []}]}, {"body": "i had fun with this movie. Was better than most hollywood movies released 2016 ...", "parent_id": "t3_5ujuqd", "score": 2, "displayText": "Romek_himself", "name": "ddwdi8j", "sentiment": 2.0, "author": "Romek_himself", "children": []}, {"body": "I loved this movie, everything was great for me except for the mothership trope and underusing Pedro Pascal's character.", "parent_id": "t3_5ujuqd", "score": 4, "displayText": "JuanDeLasNieves_", "name": "de0fi0t", "sentiment": 4.0, "author": "JuanDeLasNieves_", "children": []}, {"body": "This movie could have been absurd in a genuinely fun way but instead it's just awful in an incredibly generic way.\n\nI hope everyone involved was at least paid handsomely.  ", "parent_id": "t3_5ujuqd", "score": 3, "displayText": "Viney", "name": "ddumeu0", "sentiment": 0.0, "author": "Viney", "children": []}, {"body": "I enjoyed this movie! The visuals (specifically the goings-on at the wall and the color-coded soldiers) were great. Based on how the movie was marketed in the US, I can understand why people had concerns about the white savior trope, but I don't think that was how it played out in the film - it really felt like more of a collaboration between China and Hollywood. I also liked that Commander Lin's status was never questioned or even commented upon, and that she [eventually became the leader of the army. Even better, a romance between her and Matt Damon was narrowly avoided.](#spoiler)\n\nThe main issues I had with it were that the monsters were so unimpressive (intelligent, yes, but pretty standard as far as CGI creatures go), and that Pero Tovar (is he supposed to be Spanish? Is \"Pero\" a Spanish id??) didn't really have much to do. Apart from those quibbles, it was a fun, entertaining movie.", "parent_id": "t3_5ujuqd", "score": 2, "displayText": "perdur", "name": "ddwvdb6", "sentiment": 2.0, "author": "perdur", "children": [{"body": "\"Perro\" means \"dog\", \"Pero\" means \"but\"/\"however\"\n\nEither could be a nickid, but not a real id\n\nCould've been \"Pedro\", i.e. \"Peter\"?\n\nI haven't seen the movie.", "parent_id": "t1_ddwvdb6", "score": 2, "displayText": "ZippyDan", "name": "ddx61hl", "sentiment": 1.0, "author": "ZippyDan", "children": []}]}, {"body": "Just got out of the movie. Now I can finally weigh in on the Matt Damon accent debate. I think he was going for transatlantic maybe? Traveler voice from being so many places?\n\nAlso. I really liked the movie. The action was great and the visuals were fantastic.", "parent_id": "t3_5ujuqd", "score": 2, "displayText": "SutterCane", "name": "ddwxk9w", "sentiment": 4.0, "author": "SutterCane", "children": []}, {"body": "This was a dumber, smaller scale version of World War Z. Great popcorn movie tho. Felt like the film lost a ton of steam whenever Pedro Pascal wasn't on screen. Fav moment had to be first battle when Pedro and Matt are freed and fight together. ", "parent_id": "t3_5ujuqd", "score": 2, "displayText": "drmantiss", "name": "ddx989n", "sentiment": 4.0, "author": "drmantiss", "children": []}, {"body": "This was a very coherent creature-feature/actioneer. It didn't have any sections that drug or felt slow and the story progressed in a predictable but serviceable way. Visually, it was gorgeous to watch. ", "parent_id": "t3_5ujuqd", "score": 2, "displayText": "Fiveblade", "name": "ddz5e88", "sentiment": 2.0, "author": "Fiveblade", "children": []}, {"body": "Chemistry between the main were weak, they didn't stand out at all and looks like it was about to bloom into an equally weak romance but turns out it was still this rhetoric about trust which seemingly was develop from nowhere. The romance wouldn't have been better but it would have made sense, why would Matt Damon had help them? No reason was given, he had been a mercenary all his life then he meets this battalion and suddenly he gets chummy with them, no emphasis or even reason was given on why specifically this battalion gets to be on Matt's good side, it just is and it's a weak reason.\n\nThey talked about trust but nothing noteworthy happened that turned Matt Damon into this noble trusting character that want to save people and trust another. The friendship they were trying to make was weak and unsubstantial, they talk, they were on a board and she ask him trust her to jump. About it, if you tell me he wants to score that pussy, sure [but he failed anyways](#spoiler) then what suprises me the most was when he [fucking free this Spanish guy who betrayed him in place of taking the money, what? This is weak because there is no thought process in this, you can say he is trusting of good people now but this guy he is with is like a scumbag](#spoiler)\n\nIt was a weak connection and made no sense. The plot was generic and about a bunch of monsters that's going to destroy the world, design is okay by a very low standard and some of the mechanisim like dropping spearwoman into the battle made no sense at all, they immediately die before they are even able to make a dent in the monster's attacking formation so what was the point of even doing that? It would have been a better plan to just pour oil down and burn them, or dig a hole filled with spikes around the wall. Either way, the film was average at best, entertained me a little bit with the servicable fight scene but everything else was just mediocrity to shit.", "parent_id": "t3_5ujuqd", "score": 2, "displayText": "TheFuckingGod", "name": "de0npxv", "sentiment": 1.0, "author": "TheFuckingGod", "children": []}, {"body": "For those of you who are upset that this show is whitewashing, please stop. Like seriously, if you are not Asian or that you are an Asian American, please stop assuming you're speaking on behalf of the rest of the Asians. You're only making yourself look bad.\n\nI'm Asian, watched this since January from where I live, and I can never understand why people say this show was a complete whitewash or that it had too many white savior elements. Believe or not, this show received pretty good ratings in China, because it was one of the major films to have made it to the international screens. People need to understand Matt Damon's character was a mercenary, he came to China in search of black powder, that was how he slowly integrated in to the story. He didn't arrive at China by chance and was suddenly crowned as the savior. He was respected because he took down a Tao Tie with ease and he had a pre-encounter with these creatures. He came across the idless Order because he and Pedro's character were attempting to escape the Mongol bandits. \n\nAnd I wished people'd stop hating on the show for being one-dimensional in terms of character development. It's a fantasy war film, if you wanted deep characters then half of the movie would have just been talking, which means you're looking at the wrong film. It would also mean half of it would just be like The Edge of Tomorrow, repetitive and utterly boring. Sure, we got to see Tom Cruise and Emily Blunt kick ass but that show was draggy as heck. The Great Wall's entire focus was on the war itself, which meant everyone had little time for chatter. And mind you, the show was 2 hours, there's only so much the film can put in. \n\nBy no means this show was extremely good, but you guys are giving it far less credit that it deserves. You have to admit, the show paid attention to details and really took time to elaborate certain elements, like how each army squads were formed for very specific purposes. One of the most iconic part of the movie were the Crane Corps, as much as their strategic warfare made zero sense, and it really highlighted the significance of these animals in a Chinese literature. For example, Cranes are graceful & elegant, Eagles are swift and deadly, Bears are courageous and strong, Tigers are ruthless and powerful & Deers are united and intelligent. Had it been any other war film, the directors probably wouldn't have given a damn about these details and probably would have left it to the viewers to figure it out themselves. This is one of the reasons why The Great Wall stood out, every unimportant character got some screen time and you really get to see the show from a holistic view.\n\nDefinitely, the film fell flat after the first major battle, but it still included a ton of action scenes. It was flat but not predictable which meant you were kept in suspense. And to be honest, the events of the film transitioned smoothly so viewers could have an easier time understanding the flow of the film. The CGI effects are pretty standard, but good enough. After all, how can you expect much from a CGI film? At least the creatures didn't seem fake. The Tao Tie design wasn't probably the best it could be, but it was pretty standard for a film creature. They were four legged, vicious and killed soldiers, that's what matters. \n\nThe script was bland but honestly, half of the Chinese cast don't speak English (save for Eddie Peng who received English education in Canada but he wasn't part of the main cast anyway). It definitely had to be simplified because you have to be mindful that there are non-English speaking audiences who were watching the film. Basic at best but it was effective. \n\nIf y'all learned to stop judging the film from a whitewashing perspective and really just enjoy the show as is, the show is easily a 6/10, 7/10 at most. It's slightly above average, and a film that I believe everyone wouldn't have trouble watching it a second time. Personally, it's one of those films that would appeal to certain people, and perhaps a film that would fit perfectly well as a summer tv program. Anytime you've run out films to watch, just take this out and to entertain your crowds then put it back in to your collection of blu rays when you don't need it. \n\nThe only thing that really stood out in the film was how Jing Tian's acting was pretty mediocre. As it stands, 40% of the film time belonged to her due to nepotism. For those of you wondering how a nobody like Jing Tian gets so much attention and  opportunity to star in films like Kong and Pacific Rim, it's partly due to nepotism because she's the girlfriend of the CEO in Wanda Group. Ask anyone in China about Jing Tian and that's the answer you get mostly. But Jing Tian had always made a id for herself by starring in action films. Despite the absence of martial arts in her background, she really puts in effort to perform all her stunts and had the opportunity to star alongside Donnie Yen in a Special ID. \n\nBut really, as far the show goes, it's easily a solid B- or B. And people aren't giving the show the necessary credit it deserves. If you happen to like The Great Wall and probably have some questions surrounding the elements of the show, you could always pick up a copy of The Great Wall: The Last Survivor, a comic that's recently released as a way to promote the release of the film in the States. The comic takes place 60 years before The Great Wall and AFAIK, reviews about the comic was great and it earned an 8/10. In fact, I'm waiting for mine to arrive this coming Wednesday.\n\nThe only thing I'm really curious is why the Crane army had to jump off walls to spear the creatures. I never quite understood its significance from a strategic perspective. I mean if you wanted to prevent the creatures from scaling the wall, they could have always utilized the mechanic blades but alas, it didn't happen. And the Deer armies were pretty useless as far as storytelling went. One would have thought they'd serve as the front line/cannon fodders and expected them to be actual cavalries, but all they really do is march around and die easily. And to that someone mentioning how it was gruesome to see those female soldiers being devoured, I felt the same way too. Funny how the male soldiers all experienced a quick death but then we had to see female soldiers struggling helplessly as the creatures bit them despite it being a war film. But I guess it had to happen since IT IS related to Jing Tian's character anyway.\n\nTL;DR - Lower your expectations, stop having the whitewashing perspective in mind and this show is easily a solid B. Music was great too. \n\n", "parent_id": "t3_5ujuqd", "score": 2, "displayText": "PastaFreak26", "name": "de7g8po", "sentiment": -1.0, "author": "PastaFreak26", "children": []}, {"body": "I am surprised by all these people saying CGI was spectacular, it is some of the worst CGI I have seen for a movie costing this much in this day in age.", "parent_id": "t3_5ujuqd", "score": 2, "displayText": "blaznasn", "name": "ddy0mly", "sentiment": 0.0, "author": "blaznasn", "children": [{"body": "Must be one of those \"I can't listen to songs below 512kbps bitrate or I hear noise\", because to my eyes the CGI was fine ", "parent_id": "t1_ddy0mly", "score": 2, "displayText": "JuanDeLasNieves_", "name": "de0ffv2", "sentiment": 2.0, "author": "JuanDeLasNieves_", "children": [{"body": "Well I guess you have bad eyes then, better get those checked.", "parent_id": "t1_de0ffv2", "score": 0, "displayText": "blaznasn", "name": "de20ijn", "sentiment": 0.0, "author": "blaznasn", "children": []}]}]}, {"body": "This movie is a prime example of guilty pleasure movie. Would I call it good. Hell no, but was I on the edge of my seat? More than a few times. Can't say I'd buy it, but I could totally drown out to this if it was on Netflix.", "parent_id": "t3_5ujuqd", "score": 1, "displayText": "topherthepest", "name": "ddutqec", "sentiment": 2.0, "author": "topherthepest", "children": []}, {"body": "I'm debating whether to see this tonight or A Cure For Wellness.\n\nBoth movies are getting mixed-to-poor reviews. Anyone wanna help me decide?", "parent_id": "t3_5ujuqd", "score": 1, "displayText": "bigpig1054", "name": "ddv8d6w", "sentiment": 0.0, "author": "bigpig1054", "children": [{"body": "This is amazing visuals and action, but not that good acting/plot. While A Cure for Wellness probably has better acting/plot, but boring.", "parent_id": "t1_ddv8d6w", "score": 1, "displayText": "DragonFireDon", "name": "ddv8p8w", "sentiment": 1.0, "author": "DragonFireDon", "children": [{"body": "About sums it up, I would say this is more enjoyable but ACFW is the better film overall. I found both quite engaging", "parent_id": "t1_ddv8p8w", "score": 1, "displayText": "Pliknotjumbo", "name": "ddv9w9f", "sentiment": 3.0, "author": "Pliknotjumbo", "children": []}]}, {"body": "If you want to support a whitewashed film filled with harmful tropes, watch The Great Wall. :) ", "parent_id": "t1_ddv8d6w", "score": -7, "displayText": "Dargomir", "name": "ddw3n3d", "sentiment": 4.0, "author": "Dargomir", "children": [{"body": "I went with A Cure for Wellness...but I suspect that either decision would have been the wrong one.\n\nI should have stayed home.", "parent_id": "t1_ddw3n3d", "score": 2, "displayText": "bigpig1054", "name": "ddw4q0q", "sentiment": 2.0, "author": "bigpig1054", "children": []}]}]}, {"body": "Story and characters could've been a lot better and the creature design seemed uninspired.  However, the visuals are top notch fantasy.  Zhang Yimou more recent works had a penchant for scale and massive numbers and this clearly shows here.  Watching a messenger rush through the center between two lines of marching columns pleading that he has a report for the commander provided a great hectic shot.  Seeing the drummers coordinate to beat out a rhythmic command for their fellow soldiers was awesome.  And the floating lantern scene was absolutely beautiful!  It reminded me of Tangled's memorable scene with a Chinese flair to it.  ", "parent_id": "t3_5ujuqd", "score": 1, "displayText": "polkaron", "name": "ddwc3mn", "sentiment": 2.0, "author": "polkaron", "children": []}, {"body": "The visuals were fantastic and every large scale scene was fantastic to watch. Poor death squad. Also I feel the bungee jumping blue girls had a pretty shit gig.\n\nThe movie had some issues but in character relations and witty lines etc but was amazing from a visual and action stand point", "parent_id": "t3_5ujuqd", "score": 1, "displayText": "ItzDante", "name": "ddwdpz9", "sentiment": 4.0, "author": "ItzDante", "children": []}, {"body": "saw it, was entertained, saw first showing this morning and it was packed. could have been fleshed out a bit more, kinda was just thrown right into the action.", "parent_id": "t3_5ujuqd", "score": 1, "displayText": "st4g3", "name": "ddx3s1z", "sentiment": 2.0, "author": "st4g3", "children": []}, {"body": "Visually a great film, however the story was mediocre. IDK why but as soon as it became an 'alien vs human' kinda thing it was off-putting for me.", "parent_id": "t3_5ujuqd", "score": 1, "displayText": "lostartz", "name": "ddxesfq", "sentiment": 1.0, "author": "lostartz", "children": []}, {"body": "6/10, this is better seen as a rental.", "parent_id": "t3_5ujuqd", "score": 1, "displayText": "genkaiX1", "name": "ddxi0zm", "sentiment": 2.0, "author": "genkaiX1", "children": []}, {"body": "It is the typical movie created by the Chinese market for the USA. \n\nIt is the same as the food from china or Yoga being practiced in the USA.\n\n Once it comes over, it is Westernised. Most people do not want authentic China or India for that matter.", "parent_id": "t3_5ujuqd", "score": 1, "displayText": "Patrick_Reviews", "name": "de5ixrf", "sentiment": 4.0, "author": "Patrick_Reviews", "children": []}, {"body": "Just got back from it and I can't say I was a fan of this one. Visually breathtaking, yes, but I honestly found it really dull. A strong story and compelling characters would've helped.", "parent_id": "t3_5ujuqd", "score": 1, "displayText": "JohnTyler-Flounder", "name": "de7w8c3", "sentiment": 1.0, "author": "JohnTyler-Flounder", "children": []}, {"body": "Saw the flick last night and I walked away thinking it was entertaining as hell. I mean, I expected good graphics and action, nothing more. I could dwell on many little things but my real gripe worth noting was how inefficient that bungee jumping was. Holy shit that's like instant death.  ", "parent_id": "t3_5ujuqd", "score": 1, "displayText": "1337speak", "name": "de8iryz", "sentiment": 2.0, "author": "1337speak", "children": []}, {"body": "[deleted]", "parent_id": "t3_5ujuqd", "score": 2, "displayText": "None", "name": "de48wyi", "sentiment": -1.0, "author": "None", "children": [{"body": "Well it is an action movie. Maybe you shouldn't care and just enjoy it?", "parent_id": "t1_de48wyi", "score": 11, "displayText": "Satyrs010101", "name": "de4b7sp", "sentiment": 4.0, "author": "Satyrs010101", "children": [{"body": "[deleted]", "parent_id": "t1_de4b7sp", "score": -8, "displayText": "None", "name": "de4bica", "sentiment": -1.0, "author": "None", "children": [{"body": "Okay nice dude!", "parent_id": "t1_de4bica", "score": 5, "displayText": "Satyrs010101", "name": "de4bjiu", "sentiment": 2.0, "author": "Satyrs010101", "children": [{"body": "I'm glad he changed his mind!", "parent_id": "t1_de4bjiu", "score": 3, "displayText": "pokapokaoka", "name": "de4djf6", "sentiment": 4.0, "author": "pokapokaoka", "children": []}]}, {"body": "Found the racist", "parent_id": "t1_de4bica", "score": 0, "displayText": "Lemonlaksen", "name": "de4is0y", "sentiment": 0.0, "author": "Lemonlaksen", "children": []}]}]}, {"body": "That's exactly what I thought when I first heard about this movie.", "parent_id": "t1_de48wyi", "score": 2, "displayText": "goldrush7", "name": "de4a1eo", "sentiment": 0.0, "author": "goldrush7", "children": []}]}, {"body": "movie looks like a standard hollywood blockbuster, ill watch it later today", "parent_id": "t3_5ujuqd", "score": 1, "displayText": "heykarlll", "name": "ddwpbn0", "sentiment": 1.0, "author": "heykarlll", "children": []}, {"body": "Really entertaining and fun blockbuster, it's such a shame that it will get bad reviews and won't earn much money from the pathetic controversy of having a white male lead. Beautiful visuals, great CGI and gorgeous action pieces. Jian Tian is my vote for the live action Mulan role now.", "parent_id": "t3_5ujuqd", "score": -2, "displayText": "MindCrypt", "name": "ddwrbzl", "sentiment": 4.0, "author": "MindCrypt", "children": [{"body": "It already beat its budget by over 50 million dollars", "parent_id": "t1_ddwrbzl", "score": 2, "displayText": "el_Di4blo", "name": "ddz3bom", "sentiment": 0.0, "author": "el_Di4blo", "children": [{"body": "Oh, really? That's awesome.", "parent_id": "t1_ddz3bom", "score": 2, "displayText": "MindCrypt", "name": "ddz3d2k", "sentiment": 4.0, "author": "MindCrypt", "children": [{"body": "http://www.forbes.com/sites/scottmendelson/2017/02/19/box-office-matt-damons-the-great-wall-was-a-hit-in-china-but-not-in-america/#e496adf4a6d0 \n\nIt won big in China ", "parent_id": "t1_ddz3d2k", "score": 2, "displayText": "el_Di4blo", "name": "ddz3e14", "sentiment": 4.0, "author": "el_Di4blo", "children": [{"body": "I guess the Chinese aren't offended by a white male in a Chinese blockbuster. Goes to show how most of the people who are offended are offended on behalf of someone else.", "parent_id": "t1_ddz3e14", "score": 1, "displayText": "MindCrypt", "name": "ddz3gck", "sentiment": 0.0, "author": "MindCrypt", "children": []}]}]}]}, {"body": "yea i was going into it like how are they gonna have matt damon save the great wall. everyone complaining just didn't see the movie.\nseems like everybody (not chinese) was there to steal the gun powder.\n\n", "parent_id": "t1_ddwrbzl", "score": -3, "displayText": "st4g3", "name": "ddx3xyt", "sentiment": 1.0, "author": "st4g3", "children": [{"body": "It's a film about a Westerner learning the Chinese culture and ideals through his journey and investigation into this fabled 'black powder' that turns 'air into fire'. You can't really tell that story with a Chinese lead character. And this is also what the Chinese director, Zhang Yimou, and those who worked on the film have been stressing since the controversy broke out.\n\nWhat I find quite hypocritical about this whole scandal is that I have seen no-one complaining about Pedro Pascal, a Chilean, being among the main cast too. Why? Well, because he is a minority himself. This public outcry has nothing to do with Matt Damon 'taking a Chinese man's job'. It's just using him as an easy target because he's a white male in a Chinese movie.", "parent_id": "t1_ddx3xyt", "score": 5, "displayText": "MindCrypt", "name": "ddx55fx", "sentiment": 1.0, "author": "MindCrypt", "children": [{"body": "Obvious counter-argument would be that these specifics are contrived to get an unnecessary white man into the action. \n\nAnd the real problem isn't any particular work but the overall trend where a hundred 'harmless' cases still add up to whitebread everywhere. I'm less offended then I am just plain *bored* with this, though it is still also insulting to say my tastes are that narrow. Oh and yeah I *totally* believe this is all coincidence and not the dying gasp of a bunch of old white dudes in suits who simply can't believe they are no longer the future. \n\nCourse in this case doesn't seem to have paid off the movie is look pretty bombish domestically and made all its money in China. Where most of it won't come back to the studios here. Though obviously China doesn't care about a white guy heading a China centric movie... does this get interpreted as making whitewashing pointless or stay the course?\n\nTime will tell. And how many movies follow Star Wars and how well they do. ", "parent_id": "t1_ddx55fx", "score": 2, "displayText": "SolomonBlack", "name": "ddx6d78", "sentiment": 0.0, "author": "SolomonBlack", "children": [{"body": "Sure, I get that that is the obvious counter-argument, and maybe you are right. However, as I stated, the main plot is about a Westerner learning Chinese culture and values and ultimately adopting them. Not only that but the Chinese actors got more screen time (I don't know if that's 100% accurate, but that is how it felt to me) and Jian Tian is the main star of the film in my eyes. I don't think there was any malicious intent behind the casting and story choices behind this film.\n\nI guess I just don't understand the outrage that this one film got. I don't remember the backlash being so severe when Keanu Reeves was cast in 47 Ronin or when Tom Cruise was cast in The Last Samurai or when RZA was cast in The Man with the Iron Fists. In which all three see a story similar to The Great Wall's in regard to it being about a Westerner adopting Asian culture. Matt Damon just seem to get the brunt of people's anger for some reason.", "parent_id": "t1_ddx6d78", "score": 3, "displayText": "MindCrypt", "name": "ddx6y2v", "sentiment": 2.0, "author": "MindCrypt", "children": [{"body": "Malice is rarely found next to elaborate justifications, distortions of reality, lack of awareness, or even just unconscious behavior. Like say everyone just casually assumed they'd cast a white guy and never even broached alternatives, maybe assuming the studio wouldn't go for it. And being a statistical problem in nature there is also always a 'plausible' defense against every specific case. \n\nAnd by the same time pushing back against this sort of thing will be arbitrary by nature... because it is hard to get fired up every single time this rears its head. Why one might be denied the chance to see any big popcorn movies at all because it is just so omnipresent. \n\nFurthermore consider your other examples for false perception. Do you have some numbers quantifying and backing up the claim, have you controlled for maybe just forgetting people did complain? Even accepting the premise as true we have to consider other factors. Last Samurai was a long time ago now, we've in that time seen gay marriage go from hot button social fault line I've even seen conservative die hards say \"move on, we lost\" to. This isn't the only significant shift of the last decade+ I could id. Far less the case in 47 Ronin but then I might be willing to argue there are some not insignificant shifts in more recent years. Also Keanu hadn't done anything notable since his Klaatu remake being generous, the first Matrix being less generous. Hardly Matt Damon or Tom Cruise. \n\nCertainly this isn't the only movie I've heard complaints of this sort about stretching back to the Last Airbender in 2010. I might dispute any of them amount to significant complaint actually, as opposed to just mutterings on the internet. This is not yet quite a major issue.\n\nOh and finally the scope of complaint has no bearing on the merits of the charge. Reality and truth are not democracies, if 7 billion people say one thing and 1 person alone says another... well it's the same as if just two people had disagreed, one is right and the other wrong. ", "parent_id": "t1_ddx6y2v", "score": 0, "displayText": "SolomonBlack", "name": "ddx9bu4", "sentiment": 1.0, "author": "SolomonBlack", "children": [{"body": "Why is everything a race/political/sexism/etc. issue? Why isn't it that the director/writers/producers wanted to work with an actor like Matt Damon or felt he was best for the story? I highly doubt anyone on the film was like \"You know what, fuck the Chinese.\" Especially seeming as the rest of the cast, bar three other actors, are all Chinese.\n\nOf course some people would have disputed the casting of the actors in the other films I mentioned. Just as they do for every casting choice on the planet, no matter if it's about race or not. The only casting I've seen which has garnered unanimous praise was Jon Bernthal as The Punisher, and even then I guarantee you there were some who didn't like the choice. But can you honestly say that the retaliation for those films was nearly as strong and vocal for that of Matt Damon and The Great Wall.\n\nI also don't get what legalising gay marriage has got to do with anything. Nor do I understand why 47 Ronin being Keanu's first film after a hiatus means anything either.\n\nI'm all for seeing more Asian actors and just foreign actors in general in American blockbusters and I feel we are seeing an increase in this with actors like Byung-Hun Lee, Iko Uwais, Donnie Yen and Rinko Kikuchi all starring in big blockbusters recently.", "parent_id": "t1_ddx9bu4", "score": 5, "displayText": "MindCrypt", "name": "ddy89o0", "sentiment": 2.0, "author": "MindCrypt", "children": [{"body": "Because it really is *everywhere* and sentiments like yours are the chief problem. The refusal to face the evils that violate our world and future by insisting nothing is wrong. \n\nHow many times is it nothing before it is something? Once, twice, six times? How many? ", "parent_id": "t1_ddy89o0", "score": 1, "displayText": "SolomonBlack", "name": "ddyoca7", "sentiment": 0.0, "author": "SolomonBlack", "children": [{"body": "The Chinese director of the movie has said countless times that he cast Matt Damon purely because he wanted to work with him. There was no malice behind it, there is no evil at play here.\n\nAs I mentioned before, there were no outcries when Pedro Pascal, a Chilean, was cast in the movie. Another example would be when Michael B. Jordan was cast as Johnny Storm in Fantastic Four, a character that has been white since the comics started in 1961. (For the record, I liked his casting). Many people were against this casting choice and voiced their opinion on it and were met with hate by being called 'racists' and having 'white privilege' etc. My point here is how is moaning about Michael B. Jordan's casting any different from moaning about Matt Damon's? Both are complaints about the actors skin colour, and if complaing about one is being racist the other has to be too by default.\n\nYou say it is everywhere, but where? id examples. The only two controversies I can think of off the top of my head right now are Matt Damon in The Great Wall and Scarlett Johansson in Ghost in the Shell.\n\nThe fact of the matter is we are seeing a rise in minorities and women taking key roles in blockbusters movies. Although it may not be at the stage you want it to be yet, Rome wasn't built in a day. We are going through the transitional period right now.\n\nThere are countless atrocities happening to minorities and real racism occurring out there in the world which is harming communities and countless lives. I don't think it's too extreme for me to ignore the cries of racism or sexism etc. when an actor with less melanin than other actors or has a penis is cast in a movie.", "parent_id": "t1_ddyoca7", "score": 2, "displayText": "MindCrypt", "name": "ddz1xkk", "sentiment": 2.0, "author": "MindCrypt", "children": [{"body": "> The Chinese director of the movie has said countless times that he cast Matt Damon purely because he wanted to work with him. There was no malice behind it, there is no evil at play here.\n\nMalice is a meaningless evil next to ignorance and lack of concern. Why hardly a sin at all in my book, not worth more then a moment of my time. Malice is the least of problems in the world today.\n\n>As I mentioned before, there were no outcries when Pedro Pascal, a Chilean, was cast in the movie. Another example would be when Michael B. Jordan was cast as Johnny Storm in Fantastic Four, a character that has been white since the comics started in 1961. (For the record, I liked his casting). Many people were against this casting choice and voiced their opinion on it and were met with hate by being called 'racists' and having 'white privilege' etc. My point here is how is moaning about Michael B. Jordan's casting any different from moaning about Matt Damon's? Both are complaints about the actors skin colour, and if complaing about one is being racist the other has to be too by default.\n\nI google imaged \"Great Wall movie\" and I get a mighty wall of Matt Damon. Mr. Pascal is roughly third in prominence in group shots where present. And if things had been reversed well... I might not give a shit because my goal is less whitebread everywhere. Though I suppose that could still be a condescending plot if the hero is just replacing Mighty Whitey at a superficial level that would depend more on the final result. \n\nIts not like there weren't ever Europeans in China, the problem has nothing to do with historical accuracy. Indeed I would gladly sacrifice that in a movie like this to offer more flavors then generic whitebread. \n\nAnd funny you should mention comics because Johnny Storm is just one of countless white dudes all over Marvel and DC. I believe Falcon was the first black guy who wasn't Black [Whatever], and then there's the sort of shit that went on in the Golden Age. Replacing some of that is exactly what should be done. Comics themselves are not a model one should follow being a if not dead but still pretty stagnant medium. You've got to pull some kind of cheap stunt to move over a hundred thousand copies, hence why they are always putting out new number ones and such. That has to do with a lot more then all the white guys everywhere, faithfulness to comics is not an ideal in the slightest. \n\n(Also incidentally one of the top selling comics this century was when Spidey met Obama, only being edged out much more recently)\n\n>You say it is everywhere, but where? id examples. The only two controversies I can think of off the top of my head right now are Matt Damon in The Great Wall and Scarlett Johansson in Ghost in the Shell.\n\nPick five big budget movies. Pick any Marvel movie say. If you don't want to eat whitebread everytime you can hardly go to the movies at all. \n\nAnd that's the problem. \n\n>The fact of the matter is we are seeing a rise in minorities and women taking key roles in blockbusters movies. Although it may not be at the stage you want it to be yet, Rome wasn't built in a day. We are going through the transitional period right now.\n\nI know and I'm glad to see it. However such things are not irreversible, like how Reconstruction was undone and we end up few generations later with that rascist tripe Gone With the Wind being the most popular movie ever. \n\nSqueaky wheel gets the grease so I say keep squeaking until the job is actually done. \n\n>There are countless atrocities happening to minorities and real racism occurring out there in the world which is harming communities and countless lives. I don't think it's too extreme for me to ignore the cries of racism or sexism etc. when an actor with less melanin than other actors or has a penis is cast in a movie.\n\nIndeed people gunned down in the streets is met with dismissals similar to those I see here. \n\nIts the dismissive attitude that allows such things to prosper, to change that one must change it everywhere. ", "parent_id": "t1_ddz1xkk", "score": -1, "displayText": "SolomonBlack", "name": "ddz7qdx", "sentiment": -1.0, "author": "SolomonBlack", "children": [{"body": "Wait, so in your eyes, lack of concern is a more heinous crime than pure malice? That is bonkers.\n\nOf course Matt Damon is gonna be on the posters, he's the lead character. You say if it were reversed and Pedro was the main character you wouldn't care as much because your aim is to have less white leads........ how is that not racist? Why is there this common feeling among many that you can't be racist to white people? Every time you said 'whitebread' in this comment, replace that with 'Blacks' or 'Asians', sounds racist right? Your issues with comic book movies and American blockbusters in general are that the stars are predominantly white.... I just don't understand how you don't see that as a racist comment.\n\nWait what? Since when was Gone with the Wind the most popular movie ever? Yes, racism was rampant in the early 20th Century and before that. But are you saying you want to ban people from watching or reading classic art with racist imagery/language? If that's the case, how are we meant to learn from mistakes or look back on those times with contempt? Banning stuff like that is being ignorant, which according to you, is the worst sin to commit in modern times.\n\nHardly anyone is dismissing the atrocities that go on domestically or abroad to people of colour/homosexuals/women/certain religious beliefs etc., the protest movements like Black Lives Matter and Women's March attests to that. Get out of your bubble and realise that the people you are shouting and screaming at are on your side. Casting white people in movies is not our subtle racist jabs at you.", "parent_id": "t1_ddz7qdx", "score": 2, "displayText": "MindCrypt", "name": "ddz8vhg", "sentiment": 0.0, "author": "MindCrypt", "children": [{"body": "All it takes for evil to prosper is for good men to do nothing. A crime which we with nary an exception are all abundantly guilty of. \n\nAnd you think I'm going to be wounded by being called rascist? Nonsense the goal is collective, noble, and it must be pushed if that is rascist then hand me my swastika and KKK hood I shall wear them with pride. If I didn't think they probably suffered all the delusions of their less obvious kin I would rank white supremascists as superior to softer rascists from simply being open about it.  \n\nThe vile evil of pretending to be race blind will simply allow existing trends to prosper like a ship with no one at the wheel heading towards the rocks. Our society requires course correction, which means action. There is of course potential to overdo it but that feeble hypothetical is insufficient excuse to sit on one's ass and commit sin today to just potentially avert sins in the future. Indeed it is very simple how to not do that in the future... by being aware of the problem you will know when to stop. \n\nAnd yes if Gone With the Wind came out today and did as much business it would do [1.7 billion dollars domestic](http://www.boxofficemojo.com/alltime/adjusted.htm) so approaching twice the current raw dollar champion. It also is a rather telling monument to American delusions about their own past. Which I suppose might give it some study value but otherwise well you could pay me to watch it again... but you *would* have to pay me. \n\nOh and who said anything about banning?", "parent_id": "t1_ddz8vhg", "score": 1, "displayText": "SolomonBlack", "name": "ddz9w75", "sentiment": 1.0, "author": "SolomonBlack", "children": [{"body": "I know Edmund Burke's quote well, and agree with it. Casting white people in a movie is not evil though.\n\nI'm not trying to wound you by saying you are a racist, I'm not even accusing you of being a racist. But what you said in your post is racist. However, if your goal is to belittle and rally action against the white man, then yes, i'm afraid you are a racist. Criticising white people for the colour of their skin is racist, criticising men for their gender is sexist and criticising heterosexual people for their sexuality is heterophobic. It works both ways.\n\nI'm not sure how being content in seeing white actors in movies in a predominantly white western society is evil. As I've already mentioned too, we are very much seeing a change. People of all colours, religions, sexuality and members of both genders are getting many roles in film and TV. The three movies I watched over the weekend were very diversified. One featured many black actors and a homosexual male (Hidden Figures), the second featured a lesbian, many black characters and actors of different nationalities (John Wick 2) and the third featured a nearly complete Chinese cast (The Great Wall). That was just this weekends releases. You keep calling for action, but doing what? Just moaning about it and not realising that things ARE changing.\n\nGone with the Wind, adjusted for inflation is the most commercially successful film of all time, yes. You are correct. Firstly, that does not make it the most popular film of all time. Secondly, are you saying we should blame modern cinema goers that record numbers of people went to see a movie in 1939? The novel, which came out 3 years earlier, was a HUGE hit and back in 1939 you didn't have 4 blockbusters coming out a week. It was cheaper, there was less variety in choice of films to watch, the book was a huge success and the stars of the film were icons. Of course it was going to be successful. But what is your point? You don't like it.....okay, good for you. What are you getting at?\n\nAnd you never mentioned banning these movies, that's true. But I have no idea what you are getting at. You keep saying we need to act and doing nothing is 'evil'. What do you want from us? Do you want us to join you in droves and pointlessly (and racistly) complain about the colour of an actors skin?", "parent_id": "t1_ddz9w75", "score": 1, "displayText": "MindCrypt", "name": "ddzbh2v", "sentiment": 1.0, "author": "MindCrypt", "children": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "I did not care enough when I saw this film [last night] (https://rendyreviews.com/movies//the-great-wall-review). Out of the entire cast, the only performance that keeps this film afloat is from Jing Tian. She's like Mulan if she was given the job as a commander after she saved China. \n\nIt’s not usual that I compliment this aspect in films, but the costuming in this film is great. I really like the costumes of these warriors. Though the colors bear so much resemblance to the Power Rangers, its heavily detailed with shiny metal that looks like actual metal. The armor reminds me of the armor you see of characters from games such as Soulcalibur and Warcraft. \n\nLet me tell you, this film could’ve gone better without Matt Damon.\n\nHis character is incredibly useless and his performance is terrible and deadpan and if it's not him being terrible, it's Pascal being worse than him. The effects are terrible. I liked the designs of the lizard creatures but their CG movements feels like they leapt straight from a Final Fantasy game.", "parent_id": "t3_5ujuqd", "score": 1, "displayText": "rjonreview19", "name": "ddun3xc", "sentiment": 1.0, "author": "rjonreview19", "children": [{"body": "Jing tian is a notorious bad actress from China, and only gets roles because her family is rich. Yellow fever accusations aside, they really wasted a lot of the Chinese actors for giving them minimal lines and making them seem like fodder conglomerate rather than individual badassess. (E.g.: the archer in red). ", "parent_id": "t1_ddun3xc", "score": 1, "displayText": "harsheehorshee", "name": "ddz1dtp", "sentiment": 1.0, "author": "harsheehorshee", "children": []}]}, {"body": "I waited for a friend in the lobby and it was quite busy. Got into the theatre with about 15 minutes before the show started and there was only 15 people there. Luckily a bunch of people arrived and I would say it was about 80% full. The when the film started the picture was \"fuzzy\" for about 5 minutes. Then they fixed it and then restarted the film. \n\nOverall, it wasn't a bad film. It did have it's issues though. I was shaking my head at Damon's accent that kept changing and some of the CGI wasn't good while other times it was really good. I would say it's one of the better CGI action films though that have come out the last few years.", "parent_id": "t3_5ujuqd", "score": 1, "displayText": "Skippy8898", "name": "ddx5a8g", "sentiment": 1.0, "author": "Skippy8898", "children": []}, {"body": "I went in with no expectations and enjoyed it for what it is.   It's basically a tower defense game turned into a visually fantastic film that (at least in my estimation) did not take itself seriously.  The Chinese propaganda wasn't too bad.  All of the characters were forgettable.  Otherwise, it was fun to watch.", "parent_id": "t3_5ujuqd", "score": 1, "displayText": "viceywicey", "name": "ddxjun1", "sentiment": 2.0, "author": "viceywicey", "children": []}, {"body": "I don't know what I expected.", "parent_id": "t3_5ujuqd", "score": 1, "displayText": "Pm_me_cool_art", "name": "de66qpr", "sentiment": 1.0, "author": "Pm_me_cool_art", "children": []}, {"body": "[removed]", "parent_id": "t3_5ujuqd", "score": -3, "displayText": "None", "name": "ddvxoxz", "sentiment": -1.0, "author": "None", "children": [{"body": "[removed]", "parent_id": "t1_ddvxoxz", "score": 1, "displayText": "None", "name": "ddw6qjw", "sentiment": -1.0, "author": "None", "children": []}]}, {"body": "I might be a sucker for Matt Damon, but yeah the movie doesn't look good. Good thing Logan comes out next week.", "parent_id": "t3_5ujuqd", "score": -5, "displayText": "Jonny43", "name": "de2hun3", "sentiment": 2.0, "author": "Jonny43", "children": [{"body": "What does Logan have to do with this movie?", "parent_id": "t1_de2hun3", "score": 7, "displayText": "steelandblood", "name": "de4d0jh", "sentiment": 0.0, "author": "steelandblood", "children": [{"body": "as a penny pincher myself, if one movie is reviewed as bad and another looks good, then I'll buy the ticket for the probably good one rather than the def bad one. \n\nThough I typically wait for movies to come out in the cheap theaters in the first place.", "parent_id": "t1_de4d0jh", "score": 3, "displayText": "WarriorDark", "name": "de5036z", "sentiment": 1.0, "author": "WarriorDark", "children": []}]}]}, {"body": "Movie was awesome, my friend and I were the only asians watching LOL", "parent_id": "t3_5ujuqd", "score": 0, "displayText": "suvsaa", "name": "de5u469", "sentiment": 4.0, "author": "suvsaa", "children": []}, {"body": "From the one trailer I saw, to me this was a big budget Shark Tornado-like movie, because I thought they were dinosaurs.\n\nDino sieges in Feudal China.", "parent_id": "t3_5ujuqd", "score": 0, "displayText": "DavidRagnar", "name": "de1k2nc", "sentiment": 1.0, "author": "DavidRagnar", "children": []}, {"body": "Did they actually use some Chinese actors for a Chinese film? If so, regardless of how bad it is, I will go see it.  Regardless, I am sure it will be visually great.", "parent_id": "t3_5ujuqd", "score": -2, "displayText": "imsosick03k64", "name": "ddv8bv7", "sentiment": 4.0, "author": "imsosick03k64", "children": [{"body": "It was essentially bank-rolled by China. China Film Group, Legenday-East, Le Vision. For all intents and purposes it's a Hong Kong film starring a few American actors. I doubt they knocked on Ken Watanabe's door.", "parent_id": "t1_ddv8bv7", "score": 6, "displayText": "sounds_like_kong", "name": "ddveehg", "sentiment": 2.0, "author": "sounds_like_kong", "children": [{"body": "Ken Watanabe is Japanese.", "parent_id": "t1_ddveehg", "score": 3, "displayText": "spencegeek", "name": "ddvqylr", "sentiment": 2.0, "author": "spencegeek", "children": [{"body": "That was my point", "parent_id": "t1_ddvqylr", "score": 4, "displayText": "sounds_like_kong", "name": "ddvvayh", "sentiment": 1.0, "author": "sounds_like_kong", "children": []}]}, {"body": "more like a mainland china film than hong kong", "parent_id": "t1_ddveehg", "score": 1, "displayText": "heykarlll", "name": "ddx0vvm", "sentiment": 2.0, "author": "heykarlll", "children": []}]}, {"body": "They do. With the exception of Damon/Pascal/Dafoe, and I think maybe one other person, the cast are all Chinese.", "parent_id": "t1_ddv8bv7", "score": 2, "displayText": "carolinemathildes", "name": "ddvcg0z", "sentiment": 4.0, "author": "carolinemathildes", "children": [{"body": "Good to hear, will definitely go see it this weekend!", "parent_id": "t1_ddvcg0z", "score": 1, "displayText": "imsosick03k64", "name": "ddvdzmm", "sentiment": 4.0, "author": "imsosick03k64", "children": []}]}]}, {"body": "Many many many Chinese actresses could've acted much better than Jing Tian.\n\nThis one is very poor, I think.\n\nhttps://www.reddit.com/r/movies/comments/5ujuqd/official_discussion_the_great_wall_spoilers/ddup8pg/", "parent_id": "t3_5ujuqd", "score": -1, "displayText": "DragonFireDon", "name": "ddupq2m", "sentiment": 0.0, "author": "DragonFireDon", "children": [{"body": "The actor's granfather is very rich, and from what i know, she became a famous actor from the money not her skills. ", "parent_id": "t1_ddupq2m", "score": 1, "displayText": "sickboi19", "name": "dduzdo1", "sentiment": 2.0, "author": "sickboi19", "children": [{"body": "So, kind of like Kate Mara.  Well, her looks probably help.  Much like Kate Mara. ", "parent_id": "t1_dduzdo1", "score": 1, "displayText": "JC-Ice", "name": "ddvtx8v", "sentiment": 2.0, "author": "JC-Ice", "children": []}]}]}, {"body": "http://puu.sh/ubzeA.jpg\n\nIs it ok for \"news\" and reviews to mislead people into thinking a movie was a flop when it was actually a success? \n\nSee my image acting like the movie \"crumbled\" with making 21 million, but if you take in its chinese debut which was over 170 million it made more than 220 million worldwide which is a lot more than its 150 million budget according to forbes. What does everyone else think of this?\n\nhttp://www.forbes.com/sites/scottmendelson/2017/02/19/box-office-matt-damons-the-great-wall-was-a-hit-in-china-but-not-in-america/#e496adf4a6d0", "parent_id": "t3_5ujuqd", "score": -3, "displayText": "el_Di4blo", "name": "ddz3ac7", "sentiment": 1.0, "author": "el_Di4blo", "children": [{"body": "Rule of thumb is that movies need to make back 2x their budget to be profitable. Marketing spending isn't including in the reported budget and Hollywood doesn't get as much from overseas sales versus domestic sales. ", "parent_id": "t1_ddz3ac7", "score": 3, "displayText": "Icepick823", "name": "ddzhbz1", "sentiment": 1.0, "author": "Icepick823", "children": [{"body": "I thought this was a definitively *not* Hollywood film, aren't the director, most of the cast, the film location, producers and pretty much everything else of Chinese origin? Except Damon/Dafoe, obviously. \n\nEdit: Just looked into it and no, I was wrong. Hollywood is helping to produce the film in part, at the request of the Chinese producers who are hoping to have their movie seen by larger audiences. I think they're hoping one day that they can release big budget Chinese movies the way that big budget American movies, like Avengers and Warcraft, are released overseas. If that leads to a \"The Raid\" rip off type deal I'll be honest...I'm totally for it. ", "parent_id": "t1_ddzhbz1", "score": 5, "displayText": "tripledavebuffalo", "name": "ddzjwpd", "sentiment": 0.0, "author": "tripledavebuffalo", "children": [{"body": "Actually it was actually already written, budgeted, and announced, complete with Zhang Yimou as director (2014) before Legendary was actually acquired by the Chinese company (2016).", "parent_id": "t1_ddzjwpd", "score": 1, "displayText": "leeyuuh", "name": "de0h1xu", "sentiment": 1.0, "author": "leeyuuh", "children": []}]}, {"body": "> Marketing spending isn't including in the reported budget and Hollywood doesn't get as much from overseas sales versus domestic sales.  \n\nThere was marketing spend for this movie? ", "parent_id": "t1_ddzhbz1", "score": 1, "displayText": "HotCarls", "name": "ddzmacj", "sentiment": 0.0, "author": "HotCarls", "children": [{"body": "There were eff-loads of marketing here in China for the movie. It was pushed hard.", "parent_id": "t1_ddzmacj", "score": 2, "displayText": "zgilly11", "name": "de09hi1", "sentiment": 1.0, "author": "zgilly11", "children": [{"body": "Ah ok, I actually saw one preview for this movie and I'm pretty sure it was on reddit. Not much going on in the states.", "parent_id": "t1_de09hi1", "score": 1, "displayText": "HotCarls", "name": "de0pc8l", "sentiment": 2.0, "author": "HotCarls", "children": []}]}, {"body": "I saw plenty of ads for it. More than I would expect to see in America for what looks like a campy Chinese CGI-fest.", "parent_id": "t1_ddzmacj", "score": 1, "displayText": "AN4RCHID", "name": "de0287h", "sentiment": 2.0, "author": "AN4RCHID", "children": []}, {"body": "The darn ads were everywhere in facebook, tumblr, twitter.", "parent_id": "t1_ddzmacj", "score": 1, "displayText": "ElTamales", "name": "de12azf", "sentiment": 0.0, "author": "ElTamales", "children": [{"body": "I guess you were their target market then. Literally never saw an ad on facebook.", "parent_id": "t1_de12azf", "score": -1, "displayText": "HotCarls", "name": "de14peo", "sentiment": 0.0, "author": "HotCarls", "children": []}]}]}]}, {"body": "This happened with Warcraft aswell.\n\nThe movie made money, exceeded it's budget, but because most of the income was not from the US, it 'is considered financial failure'.", "parent_id": "t1_ddz3ac7", "score": 4, "displayText": "Hogglebog", "name": "ddz4jv0", "sentiment": 0.0, "author": "Hogglebog", "children": [{"body": "Yeah but warcraft sucked. This one is actually enjoyable", "parent_id": "t1_ddz4jv0", "score": -3, "displayText": "Annoyed_Badger", "name": "de06qrf", "sentiment": 3.0, "author": "Annoyed_Badger", "children": [{"body": "warcrap was awful", "parent_id": "t1_de06qrf", "score": -2, "displayText": "heykarlll", "name": "de0dhqc", "sentiment": 0.0, "author": "heykarlll", "children": []}]}]}]}, {"body": "We all know why this movie exists, to pander to the Chinese market and stroke some Chinese ego. It's not meant to be good.", "parent_id": "t3_5ujuqd", "score": -4, "displayText": "Tyranichomp", "name": "de51v4v", "sentiment": 2.0, "author": "Tyranichomp", "children": [{"body": "> The \"poor\" white man tries but still needs the help of the \"strong\" chinese warriors. It's so strokes China's ego that they're about to cum\n\nMade by Chinese to pander to china? are you serious?\n\nDirector Yimou Zhang\n\nIt is the Chinese trying to pander to the western market.", "parent_id": "t1_de51v4v", "score": 12, "displayText": "Engletroll", "name": "de5924v", "sentiment": 1.0, "author": "Engletroll", "children": []}, {"body": "the fuck are you on about?\nit's getting hammered in China because it's got white saviour complex written all over it,  ", "parent_id": "t1_de51v4v", "score": 8, "displayText": "hashtagpls", "name": "de52dmq", "sentiment": 4.0, "author": "hashtagpls", "children": [{"body": "No it doesn't. The \"poor\" white man tries but still needs the help of the \"strong\" chinese warriors. It's so strokes China's ego that they're about to cum", "parent_id": "t1_de52dmq", "score": 1, "displayText": "Tyranichomp", "name": "de52mm1", "sentiment": 1.0, "author": "Tyranichomp", "children": [{"body": "i still enjoyed The Last Samurai. ", "parent_id": "t1_de52mm1", "score": 3, "displayText": "kronikwookie", "name": "de59z2n", "sentiment": 3.0, "author": "kronikwookie", "children": [{"body": "samurai are japanese tho", "parent_id": "t1_de59z2n", "score": 0, "displayText": "RandomNobodyEU", "name": "de5chvj", "sentiment": 4.0, "author": "RandomNobodyEU", "children": [{"body": "come now the point he was making was pretty clear", "parent_id": "t1_de5chvj", "score": 3, "displayText": "_AirCanuck_", "name": "de5lz8k", "sentiment": 2.0, "author": "_AirCanuck_", "children": []}, {"body": "But it still had the same premise. ", "parent_id": "t1_de5chvj", "score": 2, "displayText": "kronikwookie", "name": "de5enco", "sentiment": 1.0, "author": "kronikwookie", "children": []}]}]}, {"body": "keep your chinese cum to yourself, degenerate. though, you do sound like the type who indulges in such things", "parent_id": "t1_de52mm1", "score": -2, "displayText": "hashtagpls", "name": "de53i87", "sentiment": 4.0, "author": "hashtagpls", "children": []}]}]}]}, {"body": "[deleted]", "parent_id": "t3_5ujuqd", "score": 0, "displayText": "None", "name": "ddupmhr", "sentiment": -1.0, "author": "None", "children": [{"body": "Jimmy Kimmel\n\nHilarious\n\nPick one", "parent_id": "t1_ddupmhr", "score": 3, "displayText": "Berserker_Punk", "name": "ddupopc", "sentiment": 4.0, "author": "Berserker_Punk", "children": []}]}, {"body": "I was hoping for that one guy to prove himself but nah he just kills himself.", "parent_id": "t3_5ujuqd", "score": 0, "displayText": "legdropsoup", "name": "de6dyvd", "sentiment": 1.0, "author": "legdropsoup", "children": []}, {"body": "I'm excited to see this, critics wouldn't be entertained unless it was high falutin crap", "parent_id": "t3_5ujuqd", "score": -7, "displayText": "heykarlll", "name": "ddusrs2", "sentiment": 0.0, "author": "heykarlll", "children": [{"body": "Yeah cause critics hate action films John Wick 1 and 2, Mad Max: Fury Road, Mission Impossible 3-5, or Fast and Furious 5-7. They haaatte those movies.", "parent_id": "t1_ddusrs2", "score": 12, "displayText": "mi-16evil", "name": "dduw9qu", "sentiment": 2.0, "author": "mi-16evil", "children": []}]}, {"body": "i waited so long for a kiss scene and they never kissed? \nmy friend who i watched with said it was more about \"trust\" which is said a lot but i am sure their was sexual tension at least. ENOUGH for a kiss before leaving =(", "parent_id": "t3_5ujuqd", "score": -4, "displayText": "stjunk", "name": "de56k40", "sentiment": 1.0, "author": "stjunk", "children": []}, {"body": "One of the worst movie i have seen in a while, everything is just strange in this movie from acting to plot to moral to backstory, newgeneration B-movie", "parent_id": "t3_5ujuqd", "score": -1, "displayText": "Rockerpoep02", "name": "de74hu6", "sentiment": 0.0, "author": "Rockerpoep02", "children": []}, {"body": "[removed]", "parent_id": "t3_5ujuqd", "score": -13, "displayText": "None", "name": "ddxhoth", "sentiment": -1.0, "author": "None", "children": [{"body": "These Donald Trump things are getting old.", "parent_id": "t1_ddxhoth", "score": 1, "displayText": "ArcticFoxxKA", "name": "ddzmacr", "sentiment": 2.0, "author": "ArcticFoxxKA", "children": []}]}, {"body": "[removed]", "parent_id": "t3_5ujuqd", "score": -8, "displayText": "None", "name": "de439xi", "sentiment": -1.0, "author": "None", "children": [{"body": "SHILL HARDER!", "parent_id": "t1_de439xi", "score": 4, "displayText": "omnishazbot", "name": "de47y6m", "sentiment": 0.0, "author": "omnishazbot", "children": []}, {"body": "this guy is right", "parent_id": "t1_de439xi", "score": 0, "displayText": "Niall93", "name": "de47uiz", "sentiment": 4.0, "author": "Niall93", "children": []}]}, {"body": "[deleted]", "parent_id": "t3_5ujuqd", "score": -4, "displayText": "None", "name": "ddw327t", "sentiment": -1.0, "author": "None", "children": [{"body": "Made largely by China...okay. ", "parent_id": "t1_ddw327t", "score": 2, "displayText": "Bitte124", "name": "ddw3mnl", "sentiment": 2.0, "author": "Bitte124", "children": []}, {"body": "Its made by a Chinese Studio with a Chinese director and a Chinese crew... ", "parent_id": "t1_ddw327t", "score": 2, "displayText": "lesboautisticweeabo", "name": "ddw3p1q", "sentiment": 4.0, "author": "lesboautisticweeabo", "children": []}]}, {"body": "Heres a quick review by me\n\nhttps://youtu.be/YOXbEC15ifE", "parent_id": "t3_5ujuqd", "score": -13, "displayText": "swervingmoss", "name": "ddv652s", "sentiment": 4.0, "author": "swervingmoss", "children": []}]}